[{"id":4273249241,"title":"Engineering Manager - Security Standards and Hardening","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>As the most widely used Linux distribution, Ubuntu underpins the security of the entire internet. The role of Security Engineering Manager directly impacts the safety and security of millions of users worldwide. Join a team of security experts dedicated to protecting the open-source ecosystem and driving innovation. Your leadership will be instrumental in addressing emerging threats, developing robust security measures, and ensuring the continued integrity of Ubuntu. This is an opportunity to make a tangible difference and leave a lasting legacy on the digital landscape.<br><br>As we place ever more trust in software and data security in our increasingly connected world, Canonical’s mission to deliver the world’s best open source platform comes with a responsibility: to set the highest possible standard for software security, not only for the OS, but also for the wide range of open source infrastructure and software that developers enjoy within the Ubuntu ecosystem. With Canonical’s Ubuntu being the leading open source platform for large-scale cloud and edge deployments, we are increasingly called upon to help customers meet strict security requirements such as FIPS, CIS, STIG, FedRAMP and the new CRA.<br><br>This role is about leading the charge to set the security standards for open source software across the Ubuntu platform, from desktops, servers and edge devices to cloud infrastructure, Kubernetes and OpenStack, by certifying core components to meet industry standards and guiding development teams across the company in security best practices. We work primarily within the areas of cryptographic modules (FIPS 140) and system hardening, where we collaborate with industry partners including CIS and DISA to define and build secure operating system deployments.<br><br>An Engineering Manager is responsible for line management and career guidance. The ability to develop engineering talent, to represent your team and product from a technical perspective, and to drive collaboration with other teams and customers are all critical to success in this role.</p>\n<h3>What you will do in this role</h3>\n<ul>\n<li>Lead and develop a team of engineers, ranging from graduate to senior</li>\n<li>Coach, mentor, and offer career development feedback</li>\n<li>Identify and measure team health indicators</li>\n<li>Implement disciplined engineering processes</li>\n<li>Represent your team and product to stakeholders, partners, and customers&nbsp;</li>\n<li>Develop and evangelise great engineering and organisational practices</li>\n<li>Plan and manage progress on agreed goals and projects</li>\n<li>Support our products and customers to meet strict product security requirements such as FIPS, CIS, STIG, FedRAMP and the new CRA</li>\n<li>Support the work addressing specific cryptography modules (FIPS 140) and system hardening efforts with indrustry partners, including CIS and DISA</li>\n</ul>\n<h3>What we are looking for in you</h3>\n<ul>\n<li>An exceptional academic track record from both high school and university</li>\n<li>Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path</li>\n<li>Drive, and a track record of going above-and-beyond expectations</li>\n<li>Excellent verbal and written communication skills in English</li>\n<li>A love of developing and growing people and a track record of it</li>\n<li>Organised and able to ensure your team delivers timely, high quality results</li>\n<li>Professional manner interacting with colleagues, partners, and community</li>\n<li>Prior experience working on FIPS/Common Criteria certified products and in-depth knowledge of the underlying standards</li>\n<li>Prior experience working directly with DISA-STIG or CIS benchmarks, including related audit + remediation tooling (e.g. Compliance as Code)</li>\n<li>Knowledgeable and passionate about software and application security</li>\n<li>Solid experience working in an agile development environment</li>\n<li>A demonstrated drive for continual learning</li>\n<li>Builds trust, relationships and confidence</li>\n<li>Result-oriented, with a personal drive to meet commitments&nbsp;</li>\n<li>Ability to travel twice a year, for company events up to two weeks each</li>\n</ul>\n<h3>Optional things we value</h3>\n<ul>\n<li>Hands-on domain knowledge of Linux cryptography libraries (OpenSSL, GnuTLS)</li>\n</ul>\n<h3>What we offer you</h3>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h3>About Canonical&nbsp;</h3>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<p>Canonical is an equal opportunity employer</p>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.</p>\n<p>#LI-remote</p><p>Requisition ID: 907</p><p></p>\n    ","tags":"[\"management\",\"engineering\"]","pubDate":"2024-09-03 07:05:34.821","link":"https://canonical.com/careers/6215514","savedDate":"2024-09-03 07:05:34.821","slug":"engineering-manager-security-standards-and-hardening-canonical-4896"},{"id":1751646808,"title":"Job Title: Customer Success Manager (Remote - Latin America)","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<h1>Who we are</h1>\n<p>MixRank is a YC-backed, profitable Data-as-a-Service (DaaS) company founded in 2011. We're building something sustainable and meaningful for the long haul. Our team of over 40 talented individuals spans the globe, working remotely to handle over 3 petabytes of data each month.</p>\n<p>We're proud of our decade-long journey, during which we've learned, grown, and become profitable. Our commitment is to continue running and improving our business indefinitely. This isn't just a job for us; it's our life's work. We’re not going to get acquired. Instead, we value steady growth, continuous learning, and making a lasting impact.</p>\n<p>Our customer base includes some of the world's largest sales platforms, recruitment solutions, venture capital firms, and private equity companies, as well as cutting-edge startups fresh out of YC.</p>\n<hr>\n<h1>Who we’re looking for</h1>\n<p>We're looking for an experienced Customer Success Manager — someone who has a track record of working with enterprise customers, and can handle seamless communications via Slack, email and calls with customers to handle tickets, escalations and new product/feature requests.</p>\n<p>This isn't just about support—it's about being a trusted advisor, technical liaison, and problem-solver all rolled into one. Your ability to navigate complex client relationships while understanding the technical intricacies of our products will be crucial to success.</p>\n<ol>\n<li>4+ years in Customer Success, Account Management, or Support roles, preferably in B2B data, DaaS, sales-tech, or enterprise recruitment spaces. You should be comfortable managing accounts in the $100-250k ACV range and interfacing confidently with C-suite and VP-level customer champions.</li>\n<li><strong>Truly exceptional</strong> communication skills: We're looking for more than just excellent speaking or writing skills. We need someone with deep empathy who can navigate complex client relationships, handle frustrated customers with grace, and make principled decisions that balance customer satisfaction with optimal outcomes.</li>\n<li>Ability to work within a multi-tool environment. We maintain direct Slack channels with all our enterprise customers, so you'll be juggling requests flowing in throughout the day via Slack and (on a smaller scale) email.</li>\n<li>Your ability to understand and explain the technical intricacies of our products is crucial. Experience working with APIs and basic SQL knowledge is a significant plus.</li>\n<li>Principled discipline: We're looking for someone with a meticulous approach to end-to-end ticket management. From creation to resolution, you'll need to identify problems, assign resources, provide constant updates, and drive issues to closure with unwavering attention to detail.</li>\n<li>As part of a globally distributed team, you must be self-motivated and able to manage your workload effectively. You should be comfortable collaborating across time zones while maintaining high productivity.</li>\n</ol>\n<h1>What you’ll be doing</h1>\n<ol>\n<li>Customer onboarding: You'll be the bridge from sales to success, working closely with our engineering team to launch data products or subscriptions for new customers. Your proactive approach will shine as you create and continuously update documents, FAQs, and resources to help customers quickly get up-to-speed.</li>\n<li>Customer support: As our customers' go-to problem solver, you'll handle a variety of requests:\n<ol>\n<li>How-tos: You'll guide customers through the complexities of working with massive datasets, especially in their crucial first 6 months. We want to make sure we're providing all the right resources and answering all questions, to make sure customers are getting the most out of their MixRank subscription.</li>\n<li>Bug Tickets: When working with over 1B rows of data, bugs are inevitable. You'll be the calm in the storm, acknowledging issues promptly, collaborating with our data engineering team, and orchestrating smooth solutions that keep our customers happy.</li>\n<li>Customer escalations: When customers are frustrated (even if it's beyond MixRank's control), you'll be our diplomat. You'll turn these challenging moments into opportunities for learning and improvement, always striving to exceed our high standards.</li>\n</ol>\n</li>\n<li>Documentation: You'll distill complex information into easily digestible content, ensuring our resources evolve with new customer questions and feature releases. Think of yourself as the architect of our collective wisdom, building a foundation that supports both our internal team and our clients.</li>\n<li>Proactive communication: You'll set the bar for customer engagement, keeping clients informed and feeling valued throughout their MixRank journey. This isn't just about responding to issues – it's about anticipating needs, sharing updates, and fostering a sense of partnership. Your proactive approach will turn clients into advocates, strengthening relationships and driving long-term success.</li>\n<li>You'll be the vital link between our clients and internal teams. But this is more than just relaying information – you'll be a strategic partner in shaping our product roadmap. By effectively communicating client needs, prioritizing issues, and contributing insights, you'll help drive solutions that not only meet but anticipate client expectations.</li>\n</ol>\n<hr>\n<h1>What’s in it for you</h1>\n<ol>\n<li>100% remote work: We trust you to manage your time effectively. Our focus is on your impact and results, not the hours you clock. Work from anywhere, anytime – we believe great work can happen outside the constraints of a traditional office.</li>\n<li>Home-office setup: We provide a Remote Office Grant to ensure you have a comfortable, productive home office. No compromises here – we want you to have the best tools for the job.</li>\n<li>Comprehensive health coverage: We offer 100% health coverage and term life insurance.</li>\n<li>Personal development: Enjoy an unlimited book budget to feed your mind. We also cover your Netflix and Spotify subscriptions under our Entertainment allowance.</li>\n<li>Flexible leave policy: Take the time off when you need to recharge — we recommend at least 15 days a year. Our only ask? Don't let your team down.</li>\n</ol>\n","tags":"[\"management\",\"engineering\",\"B2B\"]","pubDate":"2024-09-03 07:05:34.820","link":"https://www.ycombinator.com/companies/mixrank/jobs/RZCdbKs-job-title-customer-success-manager-remote-latin-america","savedDate":"2024-09-03 07:05:34.820","slug":"job-title-customer-success-manager-remote-latin-america-mixrank-2067"},{"id":7013158067,"title":"Data Center Technician - Dallas, TX","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>We are expanding our data center operations to a new site in the Dallas Downtown Historic District and are looking for a skilled Data Center Technician to join our team as a part-time contractor.</p>\n<p>MixRank processes petabytes of data every month from web crawling. We have hundreds of customers using our data products including Google, Amazon, Facebook, Intel, and Adobe, across industries including Recruiting, Finance, Security, Sales, and Marketing. The company was founded in 2011 and received investment from top-tier investors including Y Combinator and Mark Cuban. We're a fully-remote company with a global footprint in over 20 countries. We're growing, profitable, employee-owned, no dependence on outside funding.</p>\n<p>As a Data Center Technician, you will be responsible for the installation and maintenance of our data center infrastructure in Dallas. You will work closely with our team to manage installation of new servers and networking gear as well as maintenance and upgrades as needed. We'll expect familiarity with server hardware, including replacing components and troubleshooting hardware failures. We'll expect familiarity with network switch configuration, network design, and a working understanding of OSI layers 1 through 3. We appreciate meticulous care to tidy cabling and labeling. Linux experience is desired. Must be able to lift and install heavy server equipment safely.</p>\n<p>The ideal candidate will have experience and passion for tinkering with computers and consider it a hobby instead of just a job. Strong analytical skills are essential for diagnosing and resolving technical issues quickly and efficiently. Excellent verbal and written communication skills are required to document infrastructure and collaborate with team members effectively.</p>\n<p>Junior candidates are welcome to apply as long as you're excited to learn. We can provide training. Senior candidates are also welcome to apply and your experience can be beneficial beyond the scope of this single data center.</p>\n<p>The position will initially not have enough responsibilities to accommodate a full-time position, so we're looking for part-time candidates. We're planning to move in to the new site in late September and will have plenty of work for the first several weeks. Following that, the workload will reduce to occasional maintenance and upgrades. From our experience operating other data centers, it's rare that we have time-sensitive maintenance work, so this job comes with a high degree of flexibility. We expect that you'll have other obligations and can be respectful about timing of work to accommodate other part or full-time jobs or school. Our team is highly competent, experienced, and will be easy to work with. We'll prioritize candidates that are interested in developing a long-term relationship, especially ones that are interested in eventually becoming full-time as we grow.</p>\n<p><strong>Important:</strong> Only accept job offers from emails ending in @<a href=\"http://mixrank.com\" target=\"_blank\">mixrank.com</a>. Offers from any other email addresses are fraudulent. Do not share personal information with unverified senders.</p>\n","tags":"[\"Finance\"]","pubDate":"2024-09-03 07:05:34.820","link":"https://www.ycombinator.com/companies/mixrank/jobs/N86AZiJ-data-center-technician-dallas-tx","savedDate":"2024-09-03 07:05:34.820","slug":"data-center-technician-dallas-tx-mixrank-4568"},{"id":9143405456,"title":"Engineering Manager - AppArmor","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>As the most widely used Linux distribution, Ubuntu underpins the security of the entire internet. The role of Security Engineering Manager directly impacts the safety and security of millions of users worldwide. Join a team of security experts dedicated to protecting the open-source ecosystem and driving innovation. Your leadership will be instrumental in addressing emerging threats, developing robust security measures, and ensuring the continued integrity of Ubuntu. This is an opportunity to make a tangible difference and leave a lasting legacy on the digital landscape.</p>\n<p>The AppArmor team's first responsibility is to develop security features and capabilities for AppArmor, the security module protecting all Ubuntu users, by providing mandatory access control to confine programs and restrict their access to system resources.Your work will improve the security of millions of people. You will engage directly with our community and customers, as well as coordinating efforts across multiple engineering teams and projects to make this happen.</p>\n<p>An Engineering Manager is responsible for line management and career guidance. The ability to develop engineering talent, to represent your team and product from a technical perspective, and to drive collaboration with other teams and customers are all critical to success in this role.</p>\n<h3>What you will do in this role</h3>\n<ul>\n<li>Lead and develop a team of engineers, ranging from graduate to senior</li>\n<li>Coach, mentor, and offer career development feedback</li>\n<li>Identify and measure team health indicators</li>\n<li>Implement disciplined engineering processes</li>\n<li>Represent your team and product to stakeholders, partners, and customers</li>\n<li>Develop and evangelise great engineering and organisational practices</li>\n<li>Plan and manage progress on agreed goals and projects</li>\n<li>Be an active part of the security engineering leadership team, collaborating with other leaders&nbsp;&nbsp;</li>\n</ul>\n<h3>What we are looking for in you</h3>\n<ul>\n<li>An exceptional academic track record from both high school and university</li>\n<li>Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path</li>\n<li>Drive, and a track record of going above-and-beyond expectations</li>\n<li>Excellent verbal and written communication skills in English</li>\n<li>A love of developing and growing people and a track record of it</li>\n<li>Organised and able to ensure your team delivers timely, high quality results</li>\n<li>Professional manner interacting with colleagues, partners, and community</li>\n<li>Proficient in C and have a good understanding of Linux kernel development</li>\n<li>Experience working with Linux Security Modules</li>\n<li>Knowledgeable and passionate about software and application security</li>\n<li>Solid experience working in an agile development environment</li>\n<li>A demonstrated drive for continual learning</li>\n<li>Builds trust, relationships and confidence</li>\n<li>Result-oriented, with a personal drive to meet commitments</li>\n<li>Ability to travel twice a year, for company events up to two weeks each</li>\n</ul>\n<h3>Optional things we value</h3>\n<ul>\n<li>Good understanding of containers/packaging formats</li>\n</ul>\n<h3>What we offer you</h3>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h3>About Canonical&nbsp;</h3>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<p>Canonical is an equal opportunity employer</p>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.</p>\n<p>#LI-remote</p><p>Requisition ID: 907</p><p></p>\n    ","tags":"[\"management\",\"engineering\"]","pubDate":"2024-09-03 07:05:34.820","link":"https://canonical.com/careers/6215502","savedDate":"2024-09-03 07:05:34.820","slug":"engineering-manager-apparmor-canonical-8200"},{"id":6302853562,"title":"Support Engineer [IC2]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that <a href=\"https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4\">everyone can code</a>, not just ~0.1% of the population. We're building the code intelligence platform that powers the world's best code search and the most popular open-source code AI tool. It’s an exciting time to join Sourcegraph—AI has taken over the world, and we aim to automate 99% of the toil in software engineering with our code understanding and code AI tools, leaving the remaining 1% to the irreplicable creative spark from humans.&nbsp;</p>\n<p>Our customers range from startups to the Fortune 500, 4/5 FAANG companies, government organizations, Uber, Plaid, and more. We’ve raised $225M at a $2.625B valuation from <a href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\">a16z</a>,<a href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\"> Sequoia</a>, <a href=\"https://www.redpoint.com/companies/sourcegraph/\">Redpoint</a>, <a href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\">Craft</a> and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Working hours</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire <a href=\"https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4\">almost anywhere</a> in the world, we have a preference for someone to reside in the following locations for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, the expected working hours for this position is 9:00am - 5:00pm Central Standard Time.</p>\n<p><strong>Preferred locations:</strong></p>\n<ul>\n<li>North America - Austin, Texas</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>As part of the Technical Success organization, Support Engineering (SE) is at the forefront of the customer experience. Our customers simply wouldn’t be successful, happy, long term customers without the important work this team does! SE exists to not only resolve technical issues but educate our customers by answering reactive questions, and by importantly identifying improvements we can make to help improve the product. Our customers are developers and we help them throughout their customer journey.</p>\n<p>Within one month you will…</p>\n<ul>\n<li>Learn about our product, our value propositions, our customers, our team, and our practices.</li>\n<li>Learn how Code Search is deployed (e.g., Kubernetes, scaling, and more), product configuration and integrations, our code base, and common user needs.</li>\n<li>Learn how Cody works, the problem it solves and how our customers use it day to day</li>\n<li>Meet for an initial chat with the teammates you will work with most</li>\n<li>Start working with customers to troubleshoot and solve reported issues (with lots of support and help from your team).</li>\n</ul>\n<p>Within three months you will…</p>\n<ul>\n<li>Work with customers to troubleshoot and solve reported issues</li>\n<li>Contribute to improving our product and handbook documentation</li>\n</ul>\n<p>Within six months you will…</p>\n<ul>\n<li>Observe trends causing issues for our customers and suggest remedies (for example, what consistent things happen that we can write tooling for...)</li>\n<li>Suggest (and take responsibility for) improvements for team onboarding and ongoing enablement, improving the customer experience, and/or improving the product</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>About you</strong></span></h2>\n<p>You are curious and compassionate. You are a problem solver - you love the moment where you “figure it out”. You enjoy trying new technologies, breaking them and helping fix them. You want to be part of a technical organization while talking with customers.</p>\n<ul>\n<li>Profound curiosity to figure out why something works the way it does / to learn more</li>\n<li>Experience with Unix/Linux and/or Bash</li>\n<li>Familiarity with Kubernetes containerized solutions</li>\n<li>Familiarity with code hosts such as GitHub, GitLab and BitBucket</li>\n<li>Compassion to meet our customers (who are all developers themselves) where they are, understand their issues, and be compelled to action</li>\n<li>Experience collaborating with cross-functional teams to solve difficult problems for customers</li>\n<li>Proficiency in communicating complex technical ideas and decisions to a variety of audiences (both technical and non-technical)</li>\n</ul>\n<p>Nice to have</p>\n<ul>\n<li>Understanding of databases, especially SQL&nbsp;</li>\n<li>Proficiency in working independently, figuring things out when there aren’t a lot of people to ask real-time</li>\n<li>Foundational knowledge of APIs and/or Git</li>\n<li>Experience or training (formal or self-taught) with Kubernetes (or other container orchestration framework)&nbsp;</li>\n<li>Experience writing code in Go or another language</li>\n<li>Experience supporting AI products or knowledge about LLMs</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC2. You can read more about&nbsp;<a href=\"https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66?pvs=4\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values <a href=\"https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d\">competitive compensation</a>, our compensation ranges are visible to every single Sourcegraph teammate.&nbsp;To determine your salary, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world.&nbsp;&nbsp;</p>\n<p>💰 The target compensation for this role is $84,800 USD</p>\n<ul>\n<li>Zone 2: $84,800 USD</li>\n</ul>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about <a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\">the types of interviews</a> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5 hours in total.</p>\n<p>👋 Introduction Stage - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13\">Recruiter Screen</a></li>\n<li>[30m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694\">Hiring Manager Screen</a></li>\n</ul>\n<p>🧑‍💻 Team Interview Stage - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[45m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded\">Resume Deep Dive</a></li>\n<li>[1.5hr] Async take-home project</li>\n<li>[1hr] <a href=\"https://sourcegraph.notion.site/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7#88b9f826dee04ef98afc2aeec35b877a\">Peer Interview</a> - Review project and follow-up questions</li>\n</ul>\n<p>🎉 Final Interview Stage - we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd\">Values</a></li>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c\">Leadership Interview</a> with co-founder</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Not sure if this is you?</span></strong></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://sourcegraph.notion.site/All-remote-guidelines-4d1270d806294bf4ae6db7ab02911957\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://www.notion.so/sourcegraph/7ed54d4ec4624475a4b45619901236d7?v=e06d936c673f46ca8c313a557bd4410f\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"engineering\",\"database\"]","pubDate":"2024-09-03 07:05:34.819","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5282491004","savedDate":"2024-09-03 07:05:34.819","slug":"support-engineer-ic2-sourcegraph-9532"},{"id":9521253587,"title":"Senior Business Analyst - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3><strong>What You Will Do:</strong></h3><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h3><strong>What We Need:</strong></h3><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry is required (Insurtech or health insurance experience is preferred)</li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing skills and knowledge of other languages (Chinese) is a plus</li> <li>Currently based in the Philippines</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2024-09-03 00:00:00.000","link":"https://apply.workable.com/covergo/j/B86D963384","savedDate":"2024-09-03 07:05:34.823","slug":"senior-business-analyst-insurance-fully-remote-covergo-7169"},{"id":5783883127,"title":"Senior Backend Engineer (V)","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 10 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 24px\">What are we looking for?</b></div><div><br></div><div><span style=\"font-size: 16px;\">In this opportunity, we are looking for an experienced Backend Engineer to work with one of our US clients, a corporation that, through its subsidiaries, provides life insurance protection targeted to the middle American market. The ideal candidate will be responsible for developing and maintaining systems in their enterprise data and analytics environments. You will develop deep knowledge of our client's businesses as you help optimize performance by building and supporting decision-making tools. You will partner closely with their software engineering, AI/ML, Cybersecurity, and DevOps/SysOps teams to deliver best-in-class data solutions that empower enterprise-wide reporting and analytics, including business-critical vendor relationships.</span></div><div><br></div><div><span style=\"font-size: 16px;\">If you are independent, a great communicator, attentive to detail, and a problem solver, this is a great fit for you! Our jobs are fully remote and flexible—as long as you have the skills and can get the work done well, you can work anywhere in the listed countries (and anytime) you want.</span></div><div><br></div><div><br></div><div><b style=\"font-size: 13pt\">What's unique about this job?</b></div><div><br></div><div><span style=\"font-size: 16px;\">As a member of the Engineering team, you will be responsible for designing, developing, and maintaining high-quality software products that meet the needs of </span></div><div><span style=\"font-size: 16px;\">internal teams</span></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Collaborate with cross-functional teams to identify and understand business requirements</li><li>Design, develop, test, and deploy high-quality software products using the AWS platform</li><li>Design, develop, test, and deploy data migration &amp; management internal tools</li><li>Write clean, maintainable, and efficient code that meets coding standards and best practices</li><li>Participate in code reviews and provide feedback to improve code quality</li><li>Work with QA engineers to develop and execute test plans, ensuring high software quality</li><li>Troubleshoot and debug issues in the software and provide timely resolutions</li><li>Keep up to date with emerging trends and technologies in software engineering and recommend improvements to the software development process</li><li>Mentor junior engineers and contribute to their professional development</li>,<h3>You will shine if you have:</h3><li>Bachelor’s degree in Computer Science, Information Systems or demonstrated ability in a related field is required</li><li>+6 years of experience in software engineering</li><li>Strong proficiency in cloud computing platforms such as Google Cloud, AWS, or Azure</li><li>Strong proficiency in one or more programming languages such as C#, C++, Java, Python, or JavaScript</li><li>Strong proficiency with database technologies such as SQL or NoSQL databases</li><li>Experience with software development tools and processes such as Agile/Scrum, Git, and CI/CD pipelines</li><li>Experience building full-stack, enterprise-class applications considering quality and reliability using formal programming languages</li><li>Strong problem-solving skills and ability to work independently or in a team environment</li><li>Strong understanding and practical experience with Agile/Scrum methodologies, with a proven track record of contributing to successful agile teams</li><li>Ability to define problems, collect data, establish facts, and draw valid conclusions</li><li>Excellent communication and collaboration skills</li>,<h3>It doesn’t hurt if you also have:</h3><li>Strong proficiency in AWS Development</li><li>Familiar with Enterprise architecture design patterns</li><li>Familiar with Data Migration &amp; Security</li><li>Familiar with Okta or other SSO &amp; SAML strategies and technologies</li>,<h3>What we offer:</h3><li>Salary in USD</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"javascript\",\"management\",\"engineering\",\"database\",\"aws\"]","pubDate":"2024-09-02 18:11:04.414","link":"https://jobs.lever.co/bluecoding/09877193-c9c7-4216-b721-8192d7314a21","savedDate":"2024-09-03 07:05:34.827","slug":"senior-backend-engineer-v-blue-coding-8725"},{"id":1495560677,"title":"Growth Marketing Intern","company":"Ciceksepeti","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/de4eebbf-97f1-4bdb-b542-4fa65a0b48ab-1662467464737.png","description":"<div><b>Want to join us as we move closer to be a leader in all markets in which we operate, as a pioneering tech company?</b>&nbsp;</div><div><br></div><div>We’re looking for bright, intellectually curious professionals ready to bring out the best in themselves devoid of corporate buzzwords and bureaucracy in a global environment. We offer real-life cases to resolve and a true taste of professional life in a high-growth, high-speed tech company.&nbsp;</div><div><br></div><div>If you want to hold full accountability of your work, if you want to be heard when you have new ideas to contribute to the business, and if you’re ready to experience exceptional on-the-job training; then you’re ready for the challenge.</div><h3>🎯Your Journey Begins: Embrace the Exciting Adventure Ahead!</h3><li><b>This is a great opportunity to grow your career while you grow the business, where you’ll be accountable for the digital growth strategies. Your responsibilities will include:</b>&nbsp;</li><div><br></div><li>Executing digital marketing operations: Campaign setup, budget and bid optimization, audience and creative strategy (SEM, Social Media Ads, App Install, Retargeting etc.)</li><li>Monitoring and optimizing campaigns on a daily basis to meet company goals</li><li>Creating and testing ad copy variations for best results</li><li>Identifying threats and opportunities within competitors and overall digital space</li><li>Analyzing web (GA4) &amp; app (Adjust, AppsFlyer, Firebase) performance data to monitor campaign performance</li><li>Creating reports on marketing channels regularly</li><li>Maintaining communication with 3rd party marketing tools &amp; advertising partners</li>,<h3>✨Let Your Skills Shine with Us!</h3><li><b>We need a strategic team player who won’t hesitate to roll up their sleeves to get results. We know that sounds ambitious, therefore the minimum requirements to handle the challenge are as follows:&nbsp;</b></li><li>You are a senior student (preferably in Engineering, Statistics, or Mathematics)</li><li>You have a basic understanding of Excel, Google Ads, Meta Ads, TikTok Ads, GA4, and <a href=\"http://Adjust.Previous\">Adjust.Previous</a> digital marketing internship experience or digital marketing certifications are a plus.</li><li>You are fluent in written and spoken English.</li><li>You are passionate about digital marketing and eager to learn new technologies.</li><li>You are deadline-oriented and can work in a fast-paced environment.</li><li>You have excellent written and verbal communication skills.</li><li>You can quickly adapt to changing priorities.</li>,<h3>😎What’s in here for you?</h3><li>🎉Fun and Adventure Await: Get ready for exhilarating team adventures and unforgettable company activities that will create memories to cherish!&nbsp;🌈</li><li>🛍️Take excellent care of yourself : HiDoctor, Momento, and More!&nbsp;👩🏻‍⚕️</li><li>🎩Express Your Unique Style: No more stuffy suits or uncomfortable attire. Embrace your personal style and wear whatever makes you feel confident and comfortable. 👗👕</li><li>📚Unlock Your Potential: Biweekly Learning Hours and a Vast Training Library Await! 🎓 Never stop learning and growing! With unlimited access to top-notch training resources like Udemy and more, your professional growth knows no limits! 🚀</li><li>🥰Join Vibrant Social Clubs: Connect, Collaborate, and Create Lifelong Friendships!🎉Be part of our vibrant social clubs, where you can engage with colleagues who share your passions and interests. Cultivate meaningful connections, foster collaboration, and create memories that extend beyond the workplace.🤝</li><li>🤝Seamless Onboarding: Receive a Warm Welcome and a Smooth Transition! 📋 Our dedicated onboarding process ensures you feel supported and empowered from day one. We provide comprehensive training and resources to help you settle into your role quickly and effectively. 🌟</li><li>Join us on this exciting journey a dynamic work ecosystem, thrilling team activities, entertainment galore, a flexible dress code, and endless learning opportunities await you! It’s time to unleash your full potential and embrace the future of work!&nbsp;💃</li><div><b>😍About Us</b></div><div><br></div><div>As a pioneering tech company in gifts, our vision is to be a leader in all markets in which we operate. We create lifelong value in the lives of our employees, customers and all our business partners! 💪</div><div><br></div><div>Founded in 2006 by Emre Aydın, <a class=\"postings-link\" href=\"http://ciceksepeti.com/\">Ciceksepeti.com</a> offers the broadest selection of flowers &amp; gifts delivered same day within a single experience. We are very proud to have created a culture of celebration among people with our gift arrangements and our brand Bonnyfood. We are committed to continuing this tradition by making every special day memorable. In addition to our original mission of bringing a new perspective to the e-commerce sector in Turkey and making shipping faster and easier, now we offer a diverse range of products under various categories, such as electronics, home &amp; living, personal care, supermarket, cosmetics, fashion, sports &amp; outdoor, hobby, pet shop, jewellery &amp; accessories, as well as flowers and edible flowers since 2019.</div><div><br></div><div><a class=\"postings-link\" href=\"http://ciceksepeti.com/\">Ciceksepeti.com</a> is the most visited floral and gifting website according to SimilarWeb data, having 4 times more visitors than the second largest player in the world. 😎</div><div><br></div><div>Besides covering 70+ cities in Turkey through <a class=\"postings-link\" href=\"http://55.0.0.0/\">55.000</a>+ vendors and 24x7 customer support, Ciceksepeti has expanded into Mexico with its international brand, LolaFlora.💃</div><div><br></div><div>We are so happy and proud to have been selected the Best Employer Brand at LinkedIn Turkey Talent Awards in 2019 and 2022! 🥳</div><div><br></div><div>Headquartered in İstanbul, we’re a young, nimble, dedicated team of professionals, who are not only hard workers but also smart workers; who know how to get things done in the right way, as well as getting the right things done for our customers. Moreover, we’re on the verge of an exciting episode in our journey as we simultaneously set foot on international markets and grow further in domestic market.</div><div><br></div><div>\"İşe alım süreçlerimizde kişisel verilerinizi nasıl işlediğimize dair bilgiye çalışan adayı aydınlatma metnimizden ulaşabilirsiniz./ Please see our candidate privacy note for information on how we process your personal data during our recruitment activities.\"</div><div><a class=\"postings-link\" style=\"font-size: 15px\" href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf</a></div><div><a class=\"postings-link\" style=\"font-size: 15px\" href=\"https://cdn03.ciceksepeti.com/editor/hr/CS_Teknoloji_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf\">https://cdn03.ciceksepeti.com/editor/hr/CS_Teknoloji_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf</a></div>","tags":"[\"engineering\"]","pubDate":"2024-09-02 13:39:49.881","link":"https://jobs.lever.co/ciceksepeti/b1079dc3-8f71-462c-964f-a81e006f7c41","savedDate":"2024-09-03 07:05:34.826","slug":"growth-marketing-intern-ciceksepeti-3840"},{"id":2630920042,"title":"Sr. Product Manager/Evangelist (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are looking for a dynamic and experienced Senior Product Manager / Evangelist to lead and promote our Extended Lifecycle Support product lines, focusing on various Linux distributions and open-source libraries and frameworks. This role is a unique blend of product management and evangelism, where you will be responsible for shaping the vision and defining go-to-market strategies. You will be reporting directly to the CEO.</p><p>TuxCare is a subsidiary of CloudLinux. It offers a portfolio of security solutions for Linux and open-source software aimed at enterprise organizations. With TuxCare, enterprises can automate live vulnerability patching, minimize downtime, keep their applications secure and compliant, and get support from a team that knows Linux security best – covering the most popular Linux distributions, end-of-life systems, programming languages, and much more.<br> </p><p>By joining our team of experts, you will have the chance to collaborate with top-notch developers and have a significant impact on the open-source community. For more information about the project and our company, visit our branded websites, <a href=\"https://www.cloudlinux.com\" rel=\"nofollow noreferrer noopener\" class=\"external\">CloudLinux.com</a> and <a href=\"https://www.tuxcare.com\" rel=\"nofollow noreferrer noopener\" class=\"external\">TuxCare.com</a>.</p><p>We are truly a great place to work. </p><p><a href=\"https://tuxcare.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Key Responsibilities:</h3><ul> <li><strong>Product Vision &amp; Strategy:</strong></li> <ul> <li>Define and refine the vision for TuxCare’s Extended Lifecycle Support products.</li> <li>Develop and implement comprehensive go-to-market strategies tailored to different market segments and industries.</li> <li>Continuously assess market trends, customer needs, and competitive landscapes to guide product evolution.</li> <li>Work closely with engineering, marketing, and sales teams to create and launch new product lines.</li> <li>Oversee the entire product lifecycle, from ideation through development, launch, and post-launch support.</li> </ul> <li><strong>Evangelism &amp; Advocacy:</strong></li> <ul> <li>Serve as the public face of TuxCare’s Extended Lifecycle Support products in the open-source community.</li> <li>Promote the adoption of our products through thought leadership, content creation, webinars, and participation in industry events and conferences.</li> <li>Build and nurture relationships with key stakeholders, including customers, partners, and open-source contributors.</li> <li>Engage with customers to gather feedback and understand their pain points, using these insights to influence product enhancements.</li> <li>Analyze market data and user feedback to identify growth opportunities and areas for product improvement.</li> </ul> </ul><h3>Requirements: </h3><ul> <li><strong>Experience:</strong></li> <ul> <li>5+ years of product management experience, preferably in the open-source and security domain.</li> <li>Proven track record of successfully launching and scaling technical products in the enterprise market.</li> <li>Strong understanding of Linux distributions, open-source software, and security practices.</li> </ul> <li><strong>Skills:</strong></li> <ul> <li>Exceptional communication and presentation skills, with the ability to articulate complex technical concepts to diverse audiences.</li> <li>Strong leadership and project management abilities, with a focus on driving results and fostering collaboration.</li> <li>Analytical mindset with the ability to interpret market data and customer feedback to inform product decisions.</li> <li>Fluent English speaker</li> </ul> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong><br></p><ul> <li>A focus on professional development:</li> <ul> <li>training reimbursements;</li> <li>mentor programs;</li> <li>knowledge-exchange programs;</li> <li>interesting and challenging projects.</li> </ul> <li> Flexible working hours.</li> <li>Paid one month of vacation per year and unlimited sick leave.</li> <li>Medical insurance reimbursement.</li> <li>Co-working and gym/sports reimbursement.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-09-02 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/54A224921D","savedDate":"2024-09-03 07:05:34.822","slug":"sr-product-manager-evangelist-worldwide-remote-work-anywhere-cloudlinux-7793"},{"id":7954032832,"title":"New remote customer service role at Omni Interactions","company":"Omni Interactions","image":"https://remotive.com/job/1934796/logo","description":"<p><span style=\"color: #2a2a2a;  \">Omni supports many clients. Independent contractors who are among the qualified candidates will provide customer service (taking inbound phone calls, answering chat messages, &amp; responding to emails) for Fortune 500 companies.</span></p><p><span style=\"color: #2a2a2a;  \">You will interact with customers primarily through inbound phone calls and possibly chat/email, helping them with all their needs.</span></p><p><span style=\"color: #2a2a2a;  \"> </span></p><p><span style=\" \"><strong><span style=\"color: #2a2a2a;\">Schedule:</span></strong></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">🤙</span><span style=\"color: #2a2a2a;\"> Flexible work schedule options available</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">⏰</span><span style=\"color: #2a2a2a;\"> Majority of work hours are during weekdays and daytime</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">🗓️</span><span style=\"color: #2a2a2a;\"> Opportunity to create a work schedule that works best for you</span></span></p><p><span style=\"color: #2a2a2a;  \"> </span></p><p><span style=\" \"><strong><span style=\"color: #2a2a2a;\">Earnings &amp; Revenue:</span></strong></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">💵</span><span style=\"color: #2a2a2a;\"> Contract earnings vary by client, with competitive rates typically ranging from $14 to $20 per hour</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">📞</span><span style=\"color: #2a2a2a;\"> Pay is determined by your phone call status when assisting customers</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">🤑</span><span style=\"color: #2a2a2a;\"> Additional incentives available based on client and performance metrics.</span><span style=\"color: #2a2a2a;\"> </span></span></p><p><span style=\"color: #2a2a2a;  \"> </span></p><p><span style=\" \"><strong><span style=\"color: #2a2a2a;\">Required Skills for Successful Contractors:</span></strong></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">💬</span><span style=\"color: #2a2a2a;\"> Exceptional written and verbal communication skills</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">✅</span><span style=\"color: #2a2a2a;\"> Proven track record in customer service and delivering outstanding customer care</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">🧐</span><span style=\"color: #2a2a2a;\"> Keen attention to detail with strong problem-solving skills</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">🤗</span><span style=\"color: #2a2a2a;\"> Friendly, empathetic tone, and professional demeanor</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">🙌</span><span style=\"color: #2a2a2a;\"> Self-motivated, proactive, and resourceful mindset</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">👩‍💻</span><span style=\"color: #2a2a2a;\"> Proficient in using technology, including computer applications and software.</span></span></p><p><span style=\" \"><strong><span style=\"color: #2a2a2a;\"> </span></strong></span></p><div class=\"h2\"><span style=\"\">Important Information  </span></div><p><span style=\" \"><strong><span style=\"color: #2a2a2a;\">Technology &amp; Equipment Requirements:</span></strong></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">🚪</span><span style=\"color: #2a2a2a;\"> Quiet and secure work environment during working hours</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">💻</span><span style=\"color: #2a2a2a;\"> Personal computer with a minimum of 8GB RAM (tablets and Chromebooks are not permitted)</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">🎧</span><span style=\"color: #2a2a2a;\"> Wired USB headset with microphone for clear communication</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">💨</span><span style=\"color: #2a2a2a;\"> High-speed wired internet with a minimum of 10 Mbps download speed for seamless connectivity. <strong>Please note: You cannot use Mobile home internet (T-Mobile/Verizon, etc) or Satellite internet service. </strong></span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">🪟</span><span style=\"color: #2a2a2a;\">Operating system of Windows 10 or Windows 11 (some clients may accept AppleOS)</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">👾</span><span style=\"color: #2a2a2a;\"> Valid and up-to-date antivirus software installed</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">🤳</span><span style=\"color: #2a2a2a;\">Smart phone, Android tablet or iPad is required for program work, along with an authentication app.</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">💻</span><span style=\"color: #2a2a2a;\"> Windows 10 or Windows 11 operating system must be used (some clients will accept an AppleOS)</span></span></p><p> </p><p><span style=\" \"><strong><span style=\"color: #2a2a2a;\">Work Environment Requirements:</span></strong></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">🤫</span><span style=\"color: #2a2a2a;\"> Quiet, uninterrupted space</span></span></p><p><span style=\" \"><span style=\"color: #2a2a2a;\">⌨️</span><span style=\"color: #2a2a2a;\"> Organized desk area</span></span></p><p> </p><p> </p><p><span style=\" \"><em><span style=\"color: #2a2a2a;\">We are currently unable to work with contractors residing in Alaska, California, Connecticut, Delaware, Illinois, Michigan, Maine, Massachusetts, Maryland, New Jersey, New York, Oregon, Rhode Island, Vermont, Washington, or Washington DC. Contractors must also successfully pass a criminal background check.</span></em></span></p><p><span style=\" color: #2a2a2a; \"> </span></p><p><span style=\" \"><em><span style=\"color: #2a2a2a;\">We <strong>are</strong> able to work with contractors residing in Alabama, Arizona, Arkansas, Colorado, Florida, Georgia, Hawaii, Idaho, Indiana, Iowa, Kansas, Kentucky, Louisiana, Minnesota, Mississippi, Missouri, Montana, Nebraska, Nevada, New Hampshire, New Mexico, North Carolina, North Dakota, Ohio, Oklahoma, Pennsylvania, South Carolina, South Dakota, Texas, Tennessee, Utah, Virginia, West Virginia, Wisconsin, Wyoming and Puerto Rico.</span></em></span></p><p><span style=\" color: #2a2a2a; \"> </span></p><p><span style=\" \"><em><span style=\"color: #2a2a2a;\">Contractual Relationship: The relationship between you and Omni Interactions is a contractual relationship. You will remain an independent contractor for the duration of your program assignment. Omni Interactions will not be responsible for withholding taxes on your earnings while contracted with Omni Interactions. When you receive your contract, you will be asked to agree to have no claim against Omni Interactions hereunder or otherwise for vacation pay, sick leave, retirement benefits, Social Security, worker’s compensation, health or disability benefits, overtime, unemployment insurance benefits or employee benefits of any kind.</span></em></span></p><p><span style=\"color: #2a2a2a;  \"> </span></p><p> </p>\n<img src=\"https://remotive.com/job/track/1934796/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"android\",\"security\",\"chat\",\"insurance\"]","pubDate":"2024-09-01 15:01:42.000","link":"https://remotive.com/remote-jobs/customer-support/new-remote-customer-service-role-at-omni-interactions-1934796","savedDate":"2024-09-03 07:05:34.816","slug":"new-remote-customer-service-role-at-omni-interactions-omni-interactions-9532"},{"id":9445249367,"title":"Construction Analyst","company":"Backflip","image":"https://media.licdn.com/dms/image/D560BAQH1_SFy5Vwlhg/company-logo_200_200/0/1686838667749?e=2147483647&v=beta&t=vjEnSv9MgRj3-PLOfPnBySXxJkFKZF1SkMxzVFcxr8c","description":"<div><b style=\"font-size: 11pt;\">Join a fast growing start up changing the real estate investing industry!&nbsp;</b></div><div><br></div><div><a style=\"font-size: 11pt;\" href=\"https://dobackflip.com/\">Backflip</a><span style=\"font-size: 11pt;\"> is a venture-backed </span><b style=\"font-size: 11pt;\">FinTech</b><span style=\"font-size: 11pt;\"> company that </span><b style=\"font-size: 11pt;\">empowers anyone to improve their life and their neighborhood through real estate investing</b><span style=\"font-size: 11pt;\">. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs. </span><a style=\"font-size: 11pt;\" href=\"https://backflip.app.link/hdYmZF9JwLb\">Check out the Backflip app here to experience first hand how we're making a difference through our technology</a><span style=\"font-size: 11pt;\">.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Backflip is seeking a </span><b style=\"font-size: 11pt;\"><i>Construction Analyst</i></b><span style=\"font-size: 11pt;\"> to join our construction draws team, dedicated to delivering a best-in-class experience. This role is responsible for managing the entire construction draw process, from start to finish. Key responsibilities include: Initial Project Budget Review, Draw Request Processing, Inspection Report Review, and Member Support.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">The ideal candidate will have a strong background in understanding renovation budgets, be highly motivated to proactively engage with our members and able to stay hyper-organized around their draw pipeline. They should also be enthusiastic about contributing to a developing department where their input on process improvements is both encouraged and expected. This position works closely with the Director of Construction and Senior Director of Loan Operations.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">This position is remote (U.S.) and a rare opportunity to get in on the ground floor (~75 person team) working directly with senior leaders in a well-capitalized startup with a great culture (</span><a style=\"font-size: 11pt;\" href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\">Check out our recently announced $15M Series A</a><span style=\"font-size: 11pt;\">).</span></div><div><b style=\"font-size: 11pt;\">Join a fast growing start up changing the real estate investing industry!&nbsp;</b></div><div><br></div><div><a href=\"https://dobackflip.com/\" style=\"font-size: 11pt;\">Backflip</a><span style=\"font-size: 11pt;\"> is a venture-backed </span><b style=\"font-size: 11pt;\">FinTech</b><span style=\"font-size: 11pt;\"> company that </span><b style=\"font-size: 11pt;\">empowers anyone to improve their life and their neighborhood through real estate investing</b><span style=\"font-size: 11pt;\">. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs. </span><a href=\"https://backflip.app.link/hdYmZF9JwLb\" style=\"font-size: 11pt;\">Check out the Backflip app here to experience first hand how we're making a difference through our technology</a><span style=\"font-size: 11pt;\">.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Backflip is seeking a </span><b style=\"font-size: 11pt;\"><i>Construction Analyst</i></b><span style=\"font-size: 11pt;\"> to join our construction draws team, dedicated to delivering a best-in-class experience. This role is responsible for managing the entire construction draw process, from start to finish. Key responsibilities include: Initial Project Budget Review, Draw Request Processing, Inspection Report Review, and Member Support.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">The ideal candidate will have a strong background in understanding renovation budgets, be highly motivated to proactively engage with our members and able to stay hyper-organized around their draw pipeline. They should also be enthusiastic about contributing to a developing department where their input on process improvements is both encouraged and expected. This position works closely with the Director of Construction and Senior Director of Loan Operations.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">This position is remote (U.S.) and a rare opportunity to get in on the ground floor (~75 person team) working directly with senior leaders in a well-capitalized startup with a great culture (</span><a href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\" style=\"font-size: 11pt;\">Check out our recently announced $15M Series A</a><span style=\"font-size: 11pt;\">).</span></div><h3>What You’ll Do:</h3><li>Oversee a construction draw pipeline to ensure draw request submissions, inspection report reviews, and timely disbursement of funds</li><li>Ensure accurate onboarding of construction budgets to Backflip’s draw processing software</li><li>Review and finalize rehab budgets prior to loan closing, ensuring accuracy, consistency and completeness</li><li>Coordinate with third-party inspectors to obtain photographs and inspection reports to validate construction progress</li><li>Coordinate with borrowers to review and approve change order requests</li><li>Conduct welcome calls to educate borrowers on the draw process</li><li>Coordinate with various capital markets counterparties to secure timely approvals</li><li>Assist the treasury department in preparing draw funding disbursements</li><li>Assist the Asset Management team with borrower communication on non-performing loans</li><li>Collaborate with team members to enhance processes to: i)improve borrower experience, and; ii) reduce processing times</li><h3>Qualifications:</h3><li>2+ years of work experience in similar customer-facing processing roles, such as Construction Analyst, Draw Specialist, or Draw Analyst</li><li>1+ year experience processing construction draw requests</li><li>Experience reviewing residential construction budgets, feasibility and inspection reports</li><li>Prior experience working a remote team&nbsp;</li><li>Prior experience with a fintech company or venture-backed startup is a plus</li><li>Prior experience investing in single family real estate is a plus&nbsp;</li><li>Exemplary computer skills - demonstrated ability and desire to learn new technologies (we use Slack + Notion + Google Workspace + Front + HubSpot + Land Gorilla + more)</li><li>General understanding of basic mortgage and investment concepts (or demonstrated desire to learn); comfortable performing basic math calculations</li><h3>This candidate will champion Backflip’s culture & Core Values:</h3><li><b>Raise</b> the standard of what is possible</li><li><b>Embrace</b> being the novice to become the master</li><li><b>Work</b> only with those who want the best for us</li><li><b>Communicate</b> quickly, naturally and with radical candor</li><li><b>Test</b> new things to invent and challenge the status quo</li><li>Today, nay <b>now</b>!</li><div><span style=\"font-size: 11pt;\"><i>Compensation for this role includes a $70,000 annual salary with a $20/per draw performance incentive, and is based on a variety of factors including prior experience, geographic location, stock option grant, and other factors, and may fall outside of the stated range for certain candidates. In addition to a competitive market salary, Backflip employees receive equity stock options, paid health care, and a 401K + company match, among other industry-leading benefits.</i></span></div><div><br></div><div><span style=\"font-size: 11pt;\"><i>All Backflip positions are Remote. Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</i></span></div><div><br></div><div><span style=\"font-size: 11pt;\"><i>Backflip is an equal opportunity employer. We know that building a world-class organization is not possible without an intentional focus on recruiting, empowering, promoting and rewarding the best and brightest people of all backgrounds. Backflip focuses on hiring individuals that align with its Core Values (listed above), and consistently display a high ethical standard, both personally and professionally.</i></span></div><div><br></div><div><span style=\"font-size: 11pt;\"><i>This role is not eligible for visa sponsorship.</i></span></div>","tags":"[\"Finance\",\"management\",\"aws\"]","pubDate":"2024-08-30 20:35:48.339","link":"https://jobs.lever.co/backflip/0c5f2137-415d-4d80-a544-ea990d7acfcb","savedDate":"2024-09-03 07:05:34.828","slug":"construction-analyst-backflip-6409"},{"id":9281622605,"title":"Senior DevSecOps Engineer (V)","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 10 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 24px;\">What are we looking for?</b></div><div><br></div><div>In this opportunity, we are looking for an experienced DevSecOps Engineer to work with one of our US clients, a corporation that, through its subsidiaries, provides life insurance protection targeted to the middle American market. The ideal candidate will be responsible for developing and maintaining systems in their enterprise data and analytics environments. You will develop deep knowledge of our client's businesses as you help optimize performance by building and supporting decision-making tools. You will partner closely with their software engineering, AI/ML, Cybersecurity, and DevOps/SysOps teams to deliver best-in-class data solutions that empower enterprise-wide reporting and analytics, including business-critical vendor relationships.</div><div><br></div><div>If you are independent, a great communicator, attentive to detail, and a problem solver, this is a great fit for you! Our jobs are fully remote and flexible—as long as you have the skills and can get the work done well, you can work anywhere in the listed countries (and anytime) you want.</div><div><br></div><div><br></div><div><b style=\"font-size: 13pt;\">What's unique about this job?</b></div><div><br></div><div>As a member of the DevSecOps team, you will be building, automating, securing, and evolving the software, infrastructure, and technologies that our products depend on. This role focuses on modernizing and migrating our existing on-premises infrastructure into a cloud-native infrastructure. As a contributor to an agile team, you will work with development teams towards automating everything from building CI/CD pipelines, Infrastructure as Code, and application deployment to all dev, test, and production environments, securing and monitoring these systems.</div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Work with multiple development, security, and operations teams and thrive in a DevSecOps environment.</li><li>Participate in the design, implementation, and maintenance of the services that make up our products.</li><li>Work with the development, QA, and operations teams to automate steps in development and deployment processes.</li><li>Work with the development, QA, and operations teams to ensure adequate health and security monitoring for all production systems, including hardware, server components, and deployed applications.</li><li>Design and implement scalability and recoverability for all business-critical services.</li>,<h3>You will shine if you have:</h3><li>Bachelor’s degree in Computer Science, Information Systems or demonstrated ability in a related field is required</li><li>5+ years in a DevOps/DevSecOps role within software organizations, supporting Linux servers (preferably RHEL-based).</li><li>2+ years of experience with AWS, Puppet, and CI/CD tools like Jenkins or Bitbucket.</li><li>1+ years writing Terraform configurations and working with container tools like Docker, ECS, and/or Kubernetes/EKS.</li><li>Proficiency in scripting languages (Bash, Ruby, Python) and managing CI/CD pipelines.</li><li>Experience in deploying, operating, and maintaining software in production environments.</li><li>Strong understanding of networking, routing, firewalls, and DNS in cloud and on-prem environments.</li><li>Proven ability to lead large, complex projects with minimal direction.</li><li>Familiarity with Atlassian products (Confluence, Jira) and agile development principles.</li><li>Excellent documentation skills and ability to write clear, easy-to-understand content.</li><li>A self-motivated team player, willing to take ownership of incidents and help the team as needed.</li>,<h3>What we offer:</h3><li>Salary in USD</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"engineering\",\"aws\"]","pubDate":"2024-08-30 00:23:14.764","link":"https://jobs.lever.co/bluecoding/79fb229b-07c0-45aa-8649-534c25d0bc8f","savedDate":"2024-09-03 07:05:34.827","slug":"senior-devsecops-engineer-v-blue-coding-4216"},{"id":7766396428,"title":"Executive Assistant","company":"Backflip","image":"https://media.licdn.com/dms/image/D560BAQH1_SFy5Vwlhg/company-logo_200_200/0/1686838667749?e=2147483647&v=beta&t=vjEnSv9MgRj3-PLOfPnBySXxJkFKZF1SkMxzVFcxr8c","description":"<div><b style=\"font-size: 11pt;\">Join a fast growing start up changing the real estate investing industry!&nbsp;</b></div><div><br></div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 11pt;\" href=\"https://dobackflip.com/\">Backflip</a><span style=\"font-size: 11pt;\"> is a venture-backed </span><b style=\"font-size: 11pt;\">FinTech</b><span style=\"font-size: 11pt;\"> company that </span><b style=\"font-size: 11pt;\">empowers anyone to improve their life and their neighborhood through real estate investing</b><span style=\"font-size: 11pt;\">. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs. Check out the Backflip </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 11pt;\" href=\"https://backflip.app.link/hdYmZF9JwLb\">app</a><span style=\"font-size: 11pt;\"> here to experience first hand how we're making a difference through our technology.</span></div><div><br></div><div><span style=\"font-size: 10.5pt;\">Backflip is seeking a Dallas based Executive Assistant to provide exceptional support to our founder/CEO. This person will work closely with our CEO and other team members to enhance productivity and efficiency and enable focus on driving the company’s strategic vision forward. The ideal candidate is a highly organized, detail-oriented, and proactive individual with exceptional communication and problem-solving skills in a fast paced, dynamic environment. </span></div><div><br></div><div><span style=\"font-size: 11pt;\">This is a rare opportunity to get in on the ground floor (~75 person team) working directly with senior leaders in a fast-paced and well-capitalized startup (</span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 11pt;\" href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\">Check out our recently announced $15M Series A</a><span style=\"font-size: 11pt;\">).</span></div><div><b style=\"font-size: 11pt;\">Join a fast growing start up changing the real estate investing industry!&nbsp;</b></div><div><br></div><div><a href=\"https://dobackflip.com/\" style=\"font-size: 11pt;\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Backflip</a><span style=\"font-size: 11pt;\"> is a venture-backed </span><b style=\"font-size: 11pt;\">FinTech</b><span style=\"font-size: 11pt;\"> company that </span><b style=\"font-size: 11pt;\">empowers anyone to improve their life and their neighborhood through real estate investing</b><span style=\"font-size: 11pt;\">. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs. Check out the Backflip </span><a href=\"https://backflip.app.link/hdYmZF9JwLb\" style=\"font-size: 11pt;\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">app</a><span style=\"font-size: 11pt;\"> here to experience first hand how we're making a difference through our technology.</span></div><div><br></div><div><span style=\"font-size: 10.5pt;\">Backflip is seeking a Dallas based Executive Assistant to provide exceptional support to our founder/CEO. This person will work closely with our CEO and other team members to enhance productivity and efficiency and enable focus on driving the company’s strategic vision forward. The ideal candidate is a highly organized, detail-oriented, and proactive individual with exceptional communication and problem-solving skills in a fast paced, dynamic environment. </span></div><div><br></div><div><span style=\"font-size: 11pt;\">This is a rare opportunity to get in on the ground floor (~75 person team) working directly with senior leaders in a fast-paced and well-capitalized startup (</span><a href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\" style=\"font-size: 11pt;\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Check out our recently announced $15M Series A</a><span style=\"font-size: 11pt;\">).</span></div><h3>What You'll Do:</h3><li>Provide high-level administrative support</li><li>Heavy calendar management, scheduling, and ability to independently and efficiently own executive level calendars</li><li>Coordinate internal &amp; external meetings including, but not limited, to one-on-one meetings, interviews, company-wide meetings, etc</li><li>Plan and execute quarterly offsites, including company-wide and team-specific events, ensuring seamless coordination, engaging activities, and memorable experiences (Backflip is remote and highly values in person offsites/events)</li><li>Manage complex travel and coordination</li><li>Anticipate potential schedule conflicts and proactively deal with them before they become issues; research, prioritize, and follow up on incoming issues &amp; opportunities, and determine an appropriate course of action, often with little direction</li><li>Build relationships crucial to the success of the organization, and manage a variety of special projects, some of which may have organizational impact</li><li>Liaison and support various team members with IT support in partnership with Backflip’s IT team</li><li>”Office Manage” a remote-first org, helping to raise the standards of our collaborative and innovative work culture</li><div><br></div><div><i>This role will evolve as the company grows; there will be various tasks that fall outside of the responsibilities above. </i></div><h3>Qualifications:</h3><li>Proven experience working with founders; as an Executive Assistant, project lead, etc., preferably in a fast-paced, startup environment</li><li>Exceptional organizational and time-management skills with the ability to prioritize tasks effectively</li><li>Strong communication skills, both written and verbal, with an ability to interact professionally with all levels of the organization and external partners</li><li>Proficiency in office software (e.g., Google Workspace, Microsoft Office), communication tools (Gmail, Front, Slack) and experience with project management tools (Notion)</li><li>Ability to work independently in a remote setting, with a proactive and adaptable mindset</li><li>An understanding that things may come up outside of typical office hours</li><li>Limited travel may be required (offsites, etc)</li><h3>This candidate will champion Backflip’s culture & Core Values:</h3><li><b>Raise</b> the standard of what is possible</li><li><b>Embrace</b> being the novice to become the master</li><li><b>Work</b> only with those who want the best for us</li><li><b>Communicate</b> quickly, naturally and with radical candor</li><li><b>Test</b> new things to invent and challenge the status quo</li><li>Today, nay <b>now</b>!</li><div><i>Compensation for this role includes a base salary ranging from $90,000 - $110,000 plus an annual bonus, and is based on a variety of factors including prior experience, geographic location, stock option grant, and other factors, and may fall outside of the stated range for certain candidates. In addition to a competitive market salary, Backflip employees receive equity stock options, paid health care, and a 401K + company match, among other industry-leading benefits.</i></div><div><br></div><div><i>All Backflip positions are Remote. Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</i></div><div><br></div><div><i>Backflip is an equal opportunity employer. We know that building a world-class organization is not possible without an intentional focus on recruiting, empowering, promoting and rewarding the best and brightest people of all backgrounds. Backflip focuses on hiring individuals that align with its Core Values (listed above), and consistently display a high ethical standard, both personally and professionally.</i></div><div><br></div><div><i>This role is not eligible for visa sponsorship.</i></div>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-08-29 20:59:38.150","link":"https://jobs.lever.co/backflip/3e4d2cca-9a28-4260-b1b8-4484a84c2dee","savedDate":"2024-09-03 07:05:34.829","slug":"executive-assistant-backflip-3745"},{"id":6798329152,"title":"Head of Strategic Partnerships - North America, Telecom","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt;\">We are looking for a partnerships superstar to join the </span><b style=\"font-size: 11pt;\">Airalo Partnerships</b><span style=\"font-size: 11pt;\"> department. The undisputed industry leader in the B2C segment in the eSIM industry, we are now looking to expand our presence in the B2B2C and B2B space to bring the eSIM revolution to adjacent industries.As the </span><b style=\"font-size: 11pt;\">Head of Strategic Partnerships for North America</b><span style=\"font-size: 11pt;\">, you will lead partnerships with medium to large businesses in </span><b style=\"font-size: 11pt;\">North America </b><span style=\"font-size: 11pt;\">across </span><b style=\"font-size: 11pt;\">Telecom</b><span style=\"font-size: 11pt;\"> and other adjacent industries to offer Airalo’s travel connectivity solutions to their end customers.</span></div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with our Director/VP of Partnerships and other team members in the department</li><li>Find, identify, prospect and lead negotiations with potential partners to support Airalo’s market penetration efforts</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Maintain relationships with key partners to drive partner profitability and grow the B2B/B2B2C channel contribution to the business</li><li>Conduct competitive research and refine the Airalo Partnerships roadmap to maintain Airalo’s status as the preferred provider across industry partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Represent Airalo at travel and telecom events and conferences</li><li>Own the Airalo Strategic Partnerships OKRs</li>,<h3>Must Haves:</h3><li>7+ years of experience in partnerships, sales, account management or business development in the <b>Telecom industry</b> in a B2B and/or B2B2C environment</li><li>Partner-first mentality and a genuine passion to help your stakeholders succeed while creating a win-win relationships</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling partnership proposition</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to develop thought leadership skills and build trust with stakeholders</li><li>Ability to multi-task in a complex &amp; matrix environment</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English</li>,<h3>Good to Have:</h3><li>Prior work experience in a consumer tech company</li><li>Experience in building and leading a team</li><li>Graduate degree in a related field</li><li>Certificates and courses in sales and partnerships</li><li>Verbal and written ability in additional languages</li><div><br></div><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-08-29 15:21:53.499","link":"https://jobs.lever.co/airalo/8611a1fa-9d36-4741-9ee0-b8940f9e408e","savedDate":"2024-09-03 07:05:34.825","slug":"head-of-strategic-partnerships-north-america-telecom-airalo-7458"},{"id":4901195629,"title":"Head of Business Development - U.S","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt;\">Airalo is looking for a </span><b style=\"font-size: 11pt;\">Head of Business Development</b><span style=\"font-size: 11pt;\"> to join the </span><b style=\"font-size: 11pt;\">Airalo Partnerships</b><span style=\"font-size: 11pt;\"> department. Expensive roaming and physical SIM cards are passe. The future of connectivity, for leisure and business travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are looking to extend our leadership to the B2B (business travel) and the B2B2C (resellers) channels. As the </span><b style=\"font-size: 11pt;\">Head of Business Development for the U.S</b><span style=\"font-size: 11pt;\">, you will lead Airalo’s B2B and B2B2C strategy and execution to ensure Airalo’s presence across the business travel and reseller channels.</span></div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with our Director of Partnerships and other team members in the department</li><li>Collaborate with the Growth team and partnerships specialists for market mapping of small, medium and enterprise prospects for Airalo Business and travel agents, tour operators and retail stores for Airalo Partner Platform</li><li>Onboard and support new partners as they join the Airalo Partners community</li><li>Build and maintain fruitful relationships with key stakeholders in the partner organization to drive mutual benefits</li><li>Drive visibility, awareness and adoption for Airalo in the partner organization</li><li>Design and manage a program to educate businesses on eSIM adoption</li><li>Support research efforts to keep track of competing developments in the market(s) to help maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs with regular tracking and progress reports</li>,<h3>Must Haves:</h3><li>7+ years of experience in corporate sales (preferred) or channel sales in the relevant market(s)</li><li>Experience in the travel and / or telecom industry or with corporate sales in a consumer business</li><li>You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for customers and partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English</li>,<h3>Nice to Have</h3><li>Familiarity with the travel or telecom industry</li><li>Experience in building and leading a team</li><li>Certificates and courses in sales and partnerships</li><div><span style=\"font-size: 11pt;\">If you are interested in this position, </span><b style=\"font-size: 11pt;\">please apply via the link.</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-08-29 15:17:46.509","link":"https://jobs.lever.co/airalo/4460e5f4-9d88-4317-a522-440cc463b3a0","savedDate":"2024-09-03 07:05:34.825","slug":"head-of-business-development-u-s-airalo-6735"},{"id":8642534639,"title":"Head of Business Development - Canada","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt;\">Airalo is looking for a </span><b style=\"font-size: 11pt;\">Head of Business Development</b><span style=\"font-size: 11pt;\"> to join the </span><b style=\"font-size: 11pt;\">Airalo Partnerships</b><span style=\"font-size: 11pt;\"> department. Expensive roaming and physical SIM cards are passe. The future of connectivity, for leisure and business travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are looking to extend our leadership to the B2B (business travel) and the B2B2C (resellers) channels. As the </span><b style=\"font-size: 11pt;\">Head of Business Development for Canada</b><span style=\"font-size: 11pt;\">, you will lead Airalo’s B2B and B2B2C strategy and execution to ensure Airalo’s presence across the business travel and reseller channels.</span></div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with our Director of Partnerships and other team members in the department</li><li>Collaborate with the Growth team and partnerships specialists for market mapping of small, medium and enterprise prospects for Airalo Business and travel agents, tour operators and retail stores for Airalo Partner Platform</li><li>Onboard and support new partners as they join the Airalo Partners community</li><li>Build and maintain fruitful relationships with key stakeholders in the partner organization to drive mutual benefits</li><li>Drive visibility, awareness and adoption for Airalo in the partner organization</li><li>Design and manage a program to educate businesses on eSIM adoption</li><li>Support research efforts to keep track of competing developments in the market(s) to help maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs with regular tracking and progress reports</li>,<h3>Must Haves:</h3><li>7+ years of experience in corporate sales (preferred) or channel sales in the relevant market(s)</li><li>Experience in the travel and / or telecom industry or with corporate sales in a consumer business</li><li>You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for customers and partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English</li>,<h3>Good to Have:</h3><li>Familiarity with the travel or telecom industry</li><li>Experience in building and leading a team</li><li>Certificates and courses in sales and partnerships</li><li>Verbal and written ability in additional local / regional languages</li><div><br></div><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-08-29 15:13:17.224","link":"https://jobs.lever.co/airalo/e19db2ac-ded4-4ee2-8b8a-992c4edc94c0","savedDate":"2024-09-03 07:05:34.824","slug":"head-of-business-development-canada-airalo-1861"},{"id":2193897195,"title":"Head of Business Development - Eastern Europe","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As the Head of Business Development for Eastern Europe, you will lead Airalo’s B2B and B2B2C strategy and execution to ensure Airalo’s presence across the business travel and reseller channels.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with our Director of Partnerships and other team members in the department</li><li>Collaborate with the Growth team and partnerships specialists for market mapping of small, medium and enterprise prospects for Airalo Business and travel agents, tour operators and retail stores for Airalo Partner Platform</li><li>Onboard and support new partners as they join the Airalo Partners community</li><li>Build and maintain fruitful relationships with key stakeholders in the partner organization to drive mutual benefits</li><li>Drive visibility, awareness and adoption for Airalo in the partner organization</li><li>Design and manage a program to educate businesses on eSIM adoption</li><li>Support research efforts to keep track of competing developments in the market(s) to help maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs with regular tracking and progress reports</li>,<h3>Must Haves</h3><li>7+ years of experience in corporate sales (preferred) or channel sales in the relevant market(s)</li><li>Experience in the travel and / or telecom industry or with corporate sales in a consumer business</li><li>You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for customers and partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English and another eastern european language</li>,<h3>Good to Have</h3><li>Familiarity with the travel or telecom industry</li><li>Experience in building and leading a team</li><li>Certificates and courses in sales and partnerships</li><div><span style=\"font-size: 11pt;\">If you are interested in this position, </span><b style=\"font-size: 11pt;\">please apply via the link.</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-08-29 14:55:51.621","link":"https://jobs.lever.co/airalo/a38b0434-e831-4270-ae5e-36fd55a331df","savedDate":"2024-09-03 07:05:34.824","slug":"head-of-business-development-eastern-europe-airalo-5652"},{"id":5842806790,"title":"Head of Construction","company":"Backflip","image":"https://media.licdn.com/dms/image/D560BAQH1_SFy5Vwlhg/company-logo_200_200/0/1686838667749?e=2147483647&v=beta&t=vjEnSv9MgRj3-PLOfPnBySXxJkFKZF1SkMxzVFcxr8c","description":"<div><b style=\"font-size: 11pt;\">Join a fast growing start up changing the real estate investing industry!&nbsp;</b></div><div><br></div><div><a style=\"font-size: 11pt;\" href=\"https://dobackflip.com/\">Backflip</a><span style=\"font-size: 11pt;\"> is a venture-backed </span><b style=\"font-size: 11pt;\">FinTech</b><span style=\"font-size: 11pt;\"> company that </span><b style=\"font-size: 11pt;\">empowers anyone to improve their life and their neighborhood through real estate investing</b><span style=\"font-size: 11pt;\">. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs. </span><a style=\"font-size: 11pt;\" href=\"https://backflip.app.link/hdYmZF9JwLb\">Check out the Backflip app here to experience first hand how we're making a difference through our technology</a><span style=\"font-size: 11pt;\">.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Backflip is seeking a </span><b style=\"font-size: 11pt;\"><i>Head of Construction</i></b><span style=\"font-size: 11pt;\"> to oversee all aspects of construction project oversight within our business-purpose loan funnel (“fix &amp; flip” investments). This role will be responsible for developing and implementing processes to assess construction budgets and feasibility, review and approve change orders, manage draw and funding process, and build a knowledgeable team that collaborates directly with borrowers to optimize their projects.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">The ideal candidate will have a strong background in residential construction management, project management, or real estate development, with a proven ability to lead teams, streamline processes, and ensure successful project outcomes in a remote environment while prioritizing customer experience. They will also play a key role in ensuring Backflip’s Culture continues to be enlivened in the operation. This position reports to the Senior Director of Loan Operations.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">This position is remote (U.S.) and a rare opportunity to get in on the ground floor (~75 person team) working directly with senior leaders in a well-capitalized startup with a great culture (</span><a style=\"font-size: 11pt;\" href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\">Check out our recently announced $15M Series A</a><span style=\"font-size: 11pt;\">).</span></div><div><b style=\"font-size: 11pt;\">Join a fast growing start up changing the real estate investing industry!&nbsp;</b></div><div><br></div><div><a href=\"https://dobackflip.com/\" style=\"font-size: 11pt;\">Backflip</a><span style=\"font-size: 11pt;\"> is a venture-backed </span><b style=\"font-size: 11pt;\">FinTech</b><span style=\"font-size: 11pt;\"> company that </span><b style=\"font-size: 11pt;\">empowers anyone to improve their life and their neighborhood through real estate investing</b><span style=\"font-size: 11pt;\">. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs. </span><a href=\"https://backflip.app.link/hdYmZF9JwLb\" style=\"font-size: 11pt;\">Check out the Backflip app here to experience first hand how we're making a difference through our technology</a><span style=\"font-size: 11pt;\">.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Backflip is seeking a </span><b style=\"font-size: 11pt;\"><i>Head of Construction</i></b><span style=\"font-size: 11pt;\"> to oversee all aspects of construction project oversight within our business-purpose loan funnel (“fix &amp; flip” investments). This role will be responsible for developing and implementing processes to assess construction budgets and feasibility, review and approve change orders, manage draw and funding process, and build a knowledgeable team that collaborates directly with borrowers to optimize their projects.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">The ideal candidate will have a strong background in residential construction management, project management, or real estate development, with a proven ability to lead teams, streamline processes, and ensure successful project outcomes in a remote environment while prioritizing customer experience. They will also play a key role in ensuring Backflip’s Culture continues to be enlivened in the operation. This position reports to the Senior Director of Loan Operations.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">This position is remote (U.S.) and a rare opportunity to get in on the ground floor (~75 person team) working directly with senior leaders in a well-capitalized startup with a great culture (</span><a href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\" style=\"font-size: 11pt;\">Check out our recently announced $15M Series A</a><span style=\"font-size: 11pt;\">).</span></div><h3>What You’ll Do:</h3><li>Establish clear guidelines for approving all construction budgets prior to closing to ensure alignment with the member and set the project up for success&nbsp;</li><li>Implement processes to review inspection reports and documentation prior to disbursement to ensure compliance with Backflip’s Credit Policy</li><li>Develop and execute strategies to streamline processes and improve operational efficiency within the construction draw funnel to achieve industry-leading processing times and NPS scores</li><li>Recruit and hire a knowledgeable and skilled construction operations team to scale an exceptional draw experience</li><li>Collaborate with the Capital Markets and Product teams to research and develop innovative products and services</li><li>Manage the relationship with capital markets counterparties and actively seek opportunities to build trust and enhance our partnerships</li><li>Assist the team in resolving loan-level escalations and other asset management functions</li><li>Provide leadership, guidance, and training to the team, fostering a positive and productive work environment that enlivens our company values</li><h3>Qualifications:</h3><li>4+ years of relevant experience in residential real estate lending, construction, or project management</li><li>2+ years in a relevant managerial or supervisory role in a remote work environment</li><li>Prior experience working in a high volume construction draw disbursement team</li><li>Prior experience with a fintech company or venture-backed startup is a plus&nbsp;</li><li>Exemplary computer skills - demonstrated ability and desire to learn new technologies (we use Slack + Notion + Google Workspace + Front + HubSpot + more)</li><li>General understanding of construction, mortgage and investment concepts; comfortable performing basic math calculations</li><li>Prior experience investing in single family real estate is a plus</li><h3>This candidate will champion Backflip’s culture & Core Values:</h3><li><b>Raise</b> the standard of what is possible</li><li><b>Embrace</b> being the novice to become the master</li><li><b>Work</b> only with those who want the best for us</li><li><b>Communicate</b> quickly, naturally and with radical candor</li><li><b>Test</b> new things to invent and challenge the status quo</li><li>Today, nay <b>now</b>!</li><div><span style=\"font-size: 11pt;\"><i>Total compensation for this role ranges from $100,000 to $140,000, including a base salary and a performance-based bonus, and is based on a variety of factors including prior experience, geographic location, stock option grant, and other factors, and may fall outside of the stated range for certain candidates. In addition to a competitive market salary, Backflip employees receive equity stock options, paid health care, and a 401K + company match, among other industry-leading benefits.</i></span></div><div><br></div><div><span style=\"font-size: 11pt;\"><i>All Backflip positions are Remote. Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</i></span></div><div><br></div><div><span style=\"font-size: 11pt;\"><i>Backflip is an equal opportunity employer. We know that building a world-class organization is not possible without an intentional focus on recruiting, empowering, promoting and rewarding the best and brightest people of all backgrounds. Backflip focuses on hiring individuals that align with its Core Values (listed above), and consistently display a high ethical standard, both personally and professionally.</i></span></div><div><br></div><div><span style=\"font-size: 11pt;\"><i>This role is not eligible for visa sponsorship.</i></span></div>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-08-29 14:00:05.436","link":"https://jobs.lever.co/backflip/cc073be8-c360-41c1-99ef-857c5df7d282","savedDate":"2024-09-03 07:05:34.829","slug":"head-of-construction-backflip-4059"},{"id":2869569166,"title":"Principal User Researcher","company":"VRChat","image":"https://pbs.twimg.com/profile_images/1719900921793003520/qPc3pV09_400x400.jpg","description":"<div><span style=\"font-size: 24px;\">Join the VRChat Team!</span></div><div><br></div><div><span style=\"font-size: 11pt;\">VRChat offers a first-of-its-kind, game-changing platform that provides an endless collection of social VR experiences and gives the power of creation to its robust community. With over 250,000 worlds and growing, VRChat’s vision is to allow users to bring their imaginations to life and help shape the metaverse anywhere in the world on any device. VRChat has raised $100M to date with the support of investors Makers Fund, Anthos Capital and HTC.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">We have a great team which includes people from: Netflix, Twitter, Meta, Microsoft, Roblox, Google, Amazon, Unity, Spotify, Discord, Uber, eBay, Robinhood, Twitch, Zynga and TikTok.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Come and join the mission!</span></div><div><br></div><div><span style=\"font-size: 24px;\">Job Overview</span></div><div><br></div><div><span style=\"font-size: 11pt;\">We are seeking an experienced User Researcher, with a strong background in quantitative research methods, to join our team and play a key role in establishing and advancing research practices at our company. This individual will be responsible for driving critical research programs that will help us better understand the needs, motivations, and behaviors of creators, influencers, and our diverse community of VRChat users. The insights gathered will be instrumental in shaping our strategies for growth and expanding our reach to new </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 11pt;\" href=\"http://audiences.The\">audiences.The</a><span style=\"font-size: 11pt;\"> role will report into the VP of Design, and will work closely with cross-functional partners across product management, design, data science, engineering, and community to drive our understanding of current and potential users and creators.</span></div><h3>Duties & Responsibilities</h3><li>Design, conduct, and analyze qualitative and quantitative research studies to understand user behavior, preferences, and trends within the VRChat ecosystem.</li><li>Understand motivations and segmentation of our current and potential users to help target strategies and growth toward specific audiences.</li><li>Triangulate data from various sources (e.g., surveys, telemetry, feedback) to generate actionable insights that drive product decisions and growth strategies.</li><li>Collaborate with designers, product managers, and engineers to integrate research findings into product, business and design strategy.</li><li>Mentor and guide teammates in the use of research methods and best practices.</li><li>Stay up-to-date with the latest trends and advancements in research methodologies, applying them to our evolving product needs.</li><li>Develop innovative solutions to conducting research in virtual environments.</li><li>Contribute to building a culture of data-driven decision-making across the company.</li>,<h3>Experience, Skills & Qualifications</h3><li>Advanced degree (Master's or Ph.D.) in a relevant field (e.g., Psychology, Human-Computer Interaction, Data Science, Statistics) or equivalent professional experience.</li><li>Proven experience and impact in a user research role, ideally within the technology or gaming industry.</li><li>Strong expertise in designing, conducting, and analyzing surveys, experiments, and other quantitative research methods.</li><li>Experience with a range of qualitative methods such as user interviews, contextual inquiry, journey mapping, and usability testing.</li><li>Proficient in statistical software (e.g., SPSS, R, Python) and data visualization tools.</li><li>Experience working on products related to virtual worlds or social platforms is a plus, as well as experience in Trust and Safety research</li><li>Excellent communication skills, with the ability to present complex data insights in a clear and compelling manner to diverse audiences.</li><li>A proactive, self-motivated attitude with a passion for understanding user behavior and improving user experiences.</li>,<h3>Benefits</h3><li>Work from anywhere! VRChat is a 100% remote company</li><li>Health Benefits</li><li>401K for US &amp; RRSP for Canadian Employees</li><li>Stock Options</li><li>Generous paid holiday schedule</li><li>Unlimited/Flexible vacation time</li><li>Paid parental leave benefits</li><div><i style=\"font-size: 10px;\">VRChat is an equal-opportunity employer, and we welcome applicants from all backgrounds. VRChat fosters a diverse, creative, and collaborative environment where anyone can contribute to any of the ongoing projects or direction of the roadmap at any time. If you’re a passionate team player who wants to have an impact on a dynamic team, we’d love to hear from you!&nbsp;</i></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-08-28 15:04:12.952","link":"https://jobs.lever.co/vrchat/deafab4d-f475-476b-9fc8-3454503abdfe","savedDate":"2024-09-03 07:05:34.823","slug":"principal-user-researcher-vrchat-9609"},{"id":2528613197,"title":"Community Support Specialist (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all.<br /></p>\n<p><br /></p>\n<p>Our browsers and extensions have been downloaded over 250 million times with our built-in private search engine, which has delivered over 100 billion searches and is the 2nd largest search engine on mobile in the United States and 17 other countries, including the United Kingdom, Canada, Australia, Germany, Poland, and Spain. Our private search engine is also 3rd in market share in the U.S. and over 20 major markets. Oh, and we've been profitable since 2014, with annual revenue exceeding $100 million!</p>\n<p><br /></p>\n<p>The DuckDuckGo browser’s uniquely comprehensive privacy protections are used by tens of millions of people to protect their everyday online activities on <a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a>, <a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a>, <a href=\"https://spreadprivacy.com/duckduckgo-privacy-browser-ios14/\" rel=\"noopener\">iOS</a>, and <a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">Android</a>, from searching to browsing, emailing, and more. We also offer <a href=\"https://spreadprivacy.com/meetprivacypro/\" rel=\"noopener\">Privacy Pro</a>, a three-in-one subscription service that includes a VPN, Personal Information Removal, and Identity Theft Restoration.</p>\n<p><br /></p>\n<p>We’re looking for a Community Support Specialist to champion our consumers' experience, provide user support, and join our mission to show the world that protecting your privacy online can be simple. </p>\n<p>  </p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will have a unique opportunity to deliver exceptional user support while helping shape, manage, and grow DuckDuckGo's online community. You will be responsible for engaging with our 5M+ followers on public-facing social media, executing our broader community management strategy, taking on customer service efforts for Privacy Pro subscribers, delivering timely information and answers to users, and more.</p>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul><li>Ability to propose, contribute to, and lead projects with support from cross-functional advisors.</li><li>Skills to wrangle vague problems, propose innovative solutions, and execute them with a strong focus on metrics. </li><li>At least 5 years of experience executing stellar customer support and community management with sound judgement across multiple channels for a technical and/or software product. </li><li>A customer-first mindset — you empathize with user and customer concerns, gather information from various internal teams, and turn that information into helpful interactions.</li><li>Deep familiarity with social media platforms, community management features, and customer support tools and solutions.</li><li>Proven ability to handle high-stress situations, manage time and workload around shifting priorities in a fast-paced environment, and maintain an unwavering attention to detail.</li><li>Proven experience evolving customer support processes, analytics, and reporting.</li><li>Exceptional writing skills.</li><li>A passion and strong understanding of our industry and our business mission.</li><li>The ability to understand and effectively communicate the features and benefits of DuckDuckGo to a broad range of consumers.</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values — build trust, question assumptions, and validate direction — underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  <br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.</li></ul>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. <br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/how-we-work\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>The annual compensation range for this role is $87,000-$101,000 USD plus stock options and will depend on professional level as assessed through the hiring process. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/how-we-hire\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ul><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.</li></ul>\n<p><br /></p>\n<p>#ENT</p>","tags":"[\"management\",\"aws\"]","pubDate":"2024-08-21 19:58:44.000","link":"https://duckduckgo.recruitee.com/o/community-support-specialist-remote","savedDate":"2024-09-03 07:05:34.818","slug":"community-support-specialist-remote-duckduckgo-1422"},{"id":3011669438,"title":"WordPress Optimization Specialist (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are looking for a talented <strong>WordPress Optimization Specialist</strong> to join our CloudLinuxOS team with perspective to be promoted to <strong>Head of WordPress Performance Engineering</strong>. </p><p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful. </p><p>CloudLinux OS, our flagship product, runs on more than 50,000 production servers today, powering over 40 million websites, and is recognized as the best OS for security and efficiency in a shared hosting environment. CloudLinux OS increases server density and enhances security, thus reducing operating costs, decreasing churn rates, and increasing profitability. </p><p>As a part of the CloudLinux OS department, the CL PRO Team focuses on the diagnostic and optimization of WordPress sites (PHP X-Ray, AccelerateWP), advanced automation, deep-look performance analytics, and centralized monitoring tools. </p><p>Check out our website for more information about our CLOS Product <a href=\"https://www.cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://www.cloudlinux.com/</a></p><p></p><p><strong>Key Responsibilities:</strong></p><ul> <li>Actively participate in defining and driving forward the main strategy, product vision, roadmap, and backlog for optimizing PHP/WordPress sites, in alignment with the technical needs and goals of the organization.</li> <li>Develop and evolve the existing optimization and diagnostic features</li> <li>Make an active comparison with analogs and search for the best website optimization solutions in the market </li> <li>Generate and explore ideas for optimization</li> <li>Implement necessary metrics to monitor product success and provide ongoing oversight of these metrics</li> <li>Lead and manage a team of web developers ensuring effective collaboration and high-quality output</li> <li>Developing UI/UX solutions together with a designer</li> <li>Lead and support technical escalations with global customers, presenting analysis, reports, insights, and findings</li> <li>Collaborate closely with stakeholders to understand their needs and expectations, translating these into actionable tasks for the team</li> <li>Ensure the product meets user needs and provides an excellent user experience, with a particular focus on website performance and speed</li> <li>Identify potential risks and develop strategies to mitigate them, ensuring the smooth delivery of the product</li> <li>Develop and maintain strong and healthy relationships with peers from the other development units, customer success, presales, and other stakeholders at Imunify</li> </ul><p></p><h3>Requirements: </h3><p><strong>Required Skills and Knowledge:</strong></p><ul> <li>Minimum 5 years of experience in site optimization and web technologies</li> <li>Active engagement in the WordPress community</li> <li>Proficiency with programming languages such as PHP and JavaScript, and in web technologies such as HTML and CSS</li> <li>Strong knowledge of WordPress, including themes, plugins, optimization techniques, and explicit development of plugins</li> <li>Understanding and applying different existing solutions/plugins for performance improvement; understanding the variances between different optimization features</li> <li>Strong understanding of various caching techniques/protocols, including web server &amp; edge level caching</li> <li>Experience with tools that measure web page performance and a strong understanding of the most important evaluating performance metrics</li> <li>Good understanding of caching mechanisms</li> <li>Understanding of the most important and popular paint points in WordPress</li> <li>Knowledge of popular frameworks and libraries such as AngularJS, ReactJS, or Vue.js.</li> <li>Strong understanding of web servers such as Apache, Nginx, Litespeed and their advantages/disadvantages</li> <li>Familiarity with web design principles, user experience (UX) design, and accessibility standards</li> <li>Knowledge of SEO practices and web analytics to improve a website’s visibility and performance</li> <li>Understanding of how to create websites that work well on a variety of devices and screen sizes</li> <li>Knowledge of web security practices to protect websites from threats and vulnerabilities</li> <li>Understanding of how to ensure websites function and display correctly across different web browsers</li> <li>Knowledge of web services like REST or SOAP, which allow different software applications to communicate with each other</li> <li>Proficiency in database management and optimization, with knowledge of SQL or NoSQL databases</li> <li>Experience with e-commerce platforms, which are used to create online stores</li> <li>Hands-on experience in Linux (experience with popular distributions such as CentOS, Almalinux, CloudLinux, and Debian)</li> </ul><p></p><p><strong>It would be great if you also have:</strong></p><ul> <li>Experience with other CMS like Drupal or Joomla </li> <li>Knowledge of web hosting control panels such as cPanel, Plesk, or DirectAdmin</li> </ul><p></p><p><strong>Personal Qualities:</strong></p><ul> <li>Strong leadership and communication skills, with the ability to inspire and motivate a team</li> <li>A problem-solving mindset, with the ability to think creatively and come up with innovative solutions to challenges</li> <li>Ability to work under pressure and meet tight deadlines, while maintaining a high standard of work</li> <li>Attention to detail, ensuring all aspects of the product are thoroughly considered and executed</li> <li>Strong organizational skills, with the ability to manage multiple tasks and priorities effectively</li> <li>Can-do attitude, customer-facing, accountable, positive attitude, time management, and multitasking skills</li> <li>Willing to be on alert during off-work hours as necessary</li> <li>Excellent presentation, communication skills, and excellent English (speaking, reading, and writing)</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance </li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy%20\" rel=\"nofollow noreferrer noopener\" class=\"external\">the Cloudlinux Privacy Policy</a><em>and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"javascript\",\"management\",\"engineering\",\"database\"]","pubDate":"2024-08-06 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/38CAF3BF5E","savedDate":"2024-09-03 07:05:34.823","slug":"wordpress-optimization-specialist-worldwide-remote-work-anywhere-cloudlinux-8189"},{"id":5536976303,"title":"Senior Python/Go Developer for Imunify (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person in our team supports each other and does what we can to ensure we all are successful. </p><p>We are looking for a talented Senior Python/Go Developer to join our dynamic team at Imunify. You will have the opportunity to work on cutting-edge projects that are pushing the boundaries of enterprise cyber security applications. As a Senior Python/Go Developer, you will be given the chance to grow and thrive through engaging leadership programs and challenging assignments.</p><p>Imunify Security Suite is our innovative security solution designed specifically for shared and VPS/Dedicated servers. The automated, easy-to-use solution with the six-layer approach to security delivers comprehensive and complete attack prevention. </p><p>Check out our website for more information about our Imunify Product <a href=\"https://www.imunify360.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://www.imunify360.com/</a></p><p></p><p><strong>Join our team as a Senior Python/Go Developer and take on exciting challenges: </strong></p><ul> <li>Be involved in the development of Imunify360 products using Python.</li> <li>Be involved in the porting of Python code to Golang.</li> <li>Cover your code with unit tests and/or functional tests.</li> <li>Review of code written by your colleagues using Gerrit.</li> <li>Architecture development and writing technical documentation for new features.</li> <li>Investigating issues reported by our clients, partners, or support team.</li> </ul><h3>Requirements: </h3><p><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>3+ years of Python programming experience</li> <li>Experience in GoLang or willing to learn it </li> <li>Experience in system programming: sockets, filesystem, process management</li> <li>Proven experience working with Linux</li> <li>Intermediate level of English language</li> </ul><p></p><p><strong>It would be great if you also have:</strong></p><ul> <li>Experience with Linux server administration </li> <li>Experience with network security </li> <li>Experience with automated testing and CI/CD systems </li> <li>Knowledge about rpm/deb package management </li> </ul><p></p><p><strong>Personal skills:</strong></p><ul> <li>Fast learning, proactivity</li> <li>Strong self-motivation, driven to achieve committed milestones</li> <li>Strong prioritization skills and a flexible mindset&nbsp;</li> <li>The ability to independently analyze a task and find the right solution.</li> <li>The ability to work with vague requirements and make independent decisions</li> <li>The ability to work in a team</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance </li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\">the Cloudlinux Privacy Policy</a><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><em> and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\",\"cyber security\"]","pubDate":"2024-08-05 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/D97FC612A0","savedDate":"2024-09-03 07:05:34.823","slug":"senior-python-go-developer-for-imunify-worldwide-remote-work-anywhere-cloudlinux-4501"}]