[{"id":9709211365,"title":"Billing Specialist (Contract)","company":"BioRender","image":"https://yt3.googleusercontent.com/8szApiN8P0n8pp0GeXj_z9R4Wh1gJBGW5OJZDocvTtvuCF69U0Q4h2lXDct74mL2_F7vuUwKMA","description":"<p style=\"min-height:1.5em\">At BioRender, we’re on a mission to accelerate the world’s ability to learn, discover, and communicate science — transforming how knowledge is shared and making science open, collaborative, and easily understandable by all. <br /><br />We’re shaping the future of science communication and are looking for talented individuals to help bring this vision to life! 🚀<br /></p><p style=\"min-height:1.5em\">As a Billing Specialist, you will support the Accounts Receivable team at BioRender to help us grow and support the B2C and B2B customers. We want to change the world, which only happens with great people and sound financial processes to drive effective cash collections that will enable our ambitious growth plans. <br /></p><p style=\"min-height:1.5em\"><strong>What you'll be doing:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Provoding timely responses to daily billing inquiries through Zendesk, ensuring exceptional customer service and prompt resolution to issues.</p></li><li><p style=\"min-height:1.5em\">Process a high volume of purchase orders from customers and produce invoices through Stripe in an accurate and timely manner.</p></li><li><p style=\"min-height:1.5em\">Perform daily cash applications to Stripe and NetSuite invoices to apply customer payments and resolve discrepancies between payments and amount due.</p></li><li><p style=\"min-height:1.5em\">Apply and maintain tax exemption certificates in Avalara, ensuring compliance with tax regulations with various jurisdictions.</p></li><li><p style=\"min-height:1.5em\">Identify, develop and implement more efficient and effective billing procedures and processes within Stripe to B2C customers.</p></li><li><p style=\"min-height:1.5em\">Collaborate closely with other departments to ensure smooth coordination in billing processes and address any discrepancies or issues.</p></li><li><p style=\"min-height:1.5em\">Produce month-end reports for receivables and collections for analysis. </p></li><li><p style=\"min-height:1.5em\">Improve aged receivables by monitoring collections and completing regular follow ups.</p></li><li><p style=\"min-height:1.5em\">Process customer refunds and calculate required credits tailored to meet the specific needs of internal teams.</p></li><li><p style=\"min-height:1.5em\">Other ad hoc projects as assigned, including system implementations for billing, and involvement in user acceptance testing and code rollouts.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What we value:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Minimum 1-2  years in a customer service and data entry-related position.</p></li><li><p style=\"min-height:1.5em\">Proficient with Excel/Google Sheets.</p></li><li><p style=\"min-height:1.5em\">Excellent oral and written communication skills.</p></li><li><p style=\"min-height:1.5em\">Strong customer service experience.</p></li><li><p style=\"min-height:1.5em\">Attention to detail and problem-solving skills.</p></li><li><p style=\"min-height:1.5em\">Experience with NetSuite &amp; Stripe is a plus.</p></li><li><p style=\"min-height:1.5em\">Strong team player with a ‘’can-do’’ attitude and passion for excellence.<br /></p></li></ul><p style=\"min-height:1.5em\"><em>Note: We recognize that career paths vary, and your unique journey may have equipped you with the necessary skills even if you don’t meet all of the criteria above. If you believe you have what it takes to excel in this role, we encourage you to apply!</em><br /></p><p style=\"min-height:1.5em\"><strong>Why Join Us?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 54,000 publications! </p></li><li><p style=\"min-height:1.5em\">It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://biorender.com/testimonials/\">https://biorender.com/testimonials/</a> </p></li><li><p style=\"min-height:1.5em\">We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</p></li><li><p style=\"min-height:1.5em\">BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA. </p></li><li><p style=\"min-height:1.5em\">We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere. </p></li><li><p style=\"min-height:1.5em\">We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC. </p></li><li><p style=\"min-height:1.5em\">We’re proud that women make up 2 of 3 co-founders, 53% of our team, and 37% of leadership. This representation continues to grow and we are hiring!</p></li><li><p style=\"min-height:1.5em\">We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"postings-link\" href=\"https://careers.biorender.com/\"><u>our employees come first</u></a>.<br /></p></li></ul><p style=\"min-height:1.5em\">BioRender is an equal opportunity employer and as such does not discriminate on the basis of race, colour, religion, sex, national origins, age, sexual orientation, disability or any other characteristic protected by applicable laws.  Selection decisions are solely based on job-related factors.<br /></p><p style=\"min-height:1.5em\">You can read more about the <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"postings-link\" href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\"><u>BioRender interview process and FAQs here</u></a>!</p><p style=\"min-height:1.5em\">Check out what it's like to work at BioRender in <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-Canada-Based-Employee-f6e12ab844154bb9948b22b32e3f0c70\">Canada</a> and the <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-U-S-Based-Employee-4ab2cc8e48f546f89aa98c318bccebc9\">US</a>!</p>","tags":"[\"B2C\",\"B2B\",\"aws\"]","pubDate":"2024-11-05 04:22:33.312","link":"https://jobs.ashbyhq.com/biorender/6a012b7e-5378-4d56-854e-a31da928d5f1","savedDate":"2024-11-05 04:22:33.312","slug":"billing-specialist-contract-biorender-3027"},{"id":1000404862,"title":"Marketing Automation and Analysis Executive (Remote/Anywhere)","company":"Collabora","image":"https://media.licdn.com/dms/image/D4E0BAQFdRsd49YG4fQ/company-logo_200_200/0/1688735422027/collabora_logo?e=2147483647&v=beta&t=COQKgdesE_abHpZN-7BjhNZ1IKm2nhQyHB637TbP88E","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div>We are seeking a Marketing Automation and Analysis Executive to manage and implement our email marketing strategies, analyse market data and the result of our marketing activities. You will be responsible for maintaining our email automation platform, creating, executing and optimizing email marketing campaigns to drive engagement, conversion, revenue and reporting on the effectiveness of the team’s marketing activities.</div><div><br></div><div>Your expertise in email marketing automation platforms and your ability to analyse data will be critical in ensuring our marketing efforts are targeted, personalized, and effective. You will work closely with teams across the business including marketing, design and development, to deliver impactful email campaigns that align with our brand values and objectives, and report on other marketing activities.</div></div><div class=\"section page-centered\"><div><h3>Areas of Focus</h3><ul class=\"posting-requirements plain-list\"><ul><li>Manage and maintain our open source email automation platform (we currently use Mautic)</li><li>Develop and execute email marketing strategies, including planning, segmentation, creation, scheduling and optimization of email campaigns</li><li>Implement and manage automated email marketing campaigns, including trigger-based emails, drip campaigns and personalized messaging</li><li>Segment and target email lists based on customer behaviour, demographics and preferences in order to optimise campaign effectiveness</li><li>Monitor and analyse email marketing metrics such as open rates, click-through rates, conversion rates, and overall engagement, in order to measure campaign performance and identify areas for improvement</li><li>Collaborate with cross-functional teams to create engaging email content including copy, graphics and CTA’s to create visually appealing and impactful emails that align with brand guidelines</li><li>Ensure compliance with email marketing best practices and regulations to maintain a high standard of data privacy and security</li><li>Collaborate with the marketing team to integrate email campaigns with other marketing channels such as social media and content marketing, in order to ensure consistent messaging and maximize campaign impact</li><li>Stay up to date with industry trends, emerging technologies, and best practices in email marketing automation to continually improve campaign performance and deliver innovative solutions</li><li>Provide regular reports and insights to stakeholders on marketing activities, highlighting key findings and recommendations for \toptimisation</li><li>Regularly review and analyse competitor content across their marketing platforms and report back to the marketing team with potential strategies to implement</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Competencies</h3><ul class=\"posting-requirements plain-list\"><ul><li>Previous experience with Open Source Marketing Automation Tools: e.g.. Mautic</li><li>Proven experience in email marketing, preferably in a B2B environment</li><li>Proficiency in email marketing automation platforms, ideally Open Source</li><li>Experience in segmenting and targeting email lists based on user behaviour, demographics and preferences</li><li>Strong understanding of email marketing best practices, compliance regulations and data privacy laws</li><li>Analytical mindset with the ability to interpret data and make data-driven decisions</li><li>Good understanding of design principles and the ability to collaborate effectively with designers</li><li>Excellent written and verbal skills in English with the ability to create compelling email copy</li><li>Attention to detail whilst handling multiple projects simultaneously</li><li>Based within +/- 3 hours of UK time zone</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Ideal Experience</h3><ul class=\"posting-requirements plain-list\"><ul><li>Degree in marketing, communications or a relevant technical field</li><li>Passion for Open Source and a good understanding of the Open Source community</li><li>Awareness of the office document creation competitive landscape</li><li>Experience with FLOSS tools and and/or the Linux Desktop</li><li>Experience working remotely</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div>This is an ideal role for somebody who has experience in creating, executing and managing email campaigns and automations, the ability to maintain an open source email automation platform and has an analytical mindset.</div><div><br></div><div><br></div><div><br></div><div><br></div><div>#LI-Remote</div><div><br></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/9e6b3b1f-5f79-4ee1-b7b8-18993562b1e6/apply\">Apply for this job</a></div>","tags":"[\"B2B\",\"aws\"]","pubDate":"2024-11-05 04:22:33.307","link":"https://jobs.lever.co/collabora/9e6b3b1f-5f79-4ee1-b7b8-18993562b1e6","savedDate":"2024-11-05 04:22:33.307","slug":"marketing-automation-and-analysis-executive-remote-anywhere-collabora-6792"},{"id":5862169452,"title":"Senior Infrastructure Engineer","company":"Instrumentl","image":"https://pbs.twimg.com/profile_images/1263546899153502209/ObHsQoNr_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><b style=\"font-size: 18px\">Hello, we’re Instrumentl.</b></div><div><br></div><div><span style=\"font-size: 16px;\">We’re a mission-driven startup helping the nonprofit sector to drive impact, and we’re well on our way to becoming the <b>#1</b> most-loved grant discovery and management tool. To get there, we’re hiring a <b>Senior Infrastructure Engineer</b> to help us build the code, tools, and infrastructure that keep our product running smoothly and reliably for our customers.&nbsp;</span></div><div><br></div><div><b><span style=\"font-size: 18px\">About us:</span></b></div><div><br></div><div><a class=\"postings-link\" style=\"font-size: 12pt\" href=\"https://www.instrumentl.com/\">Instrumentl</a><span style=\"font-size: 12pt\"> is a hypergrowth YC-backed startup with over 4,000 nonprofit clients, from local homeless shelters to larger organizations like the San Diego Zoo and the University of Alaska. We are building the future of fundraising automation, helping nonprofits to discover, track, and manage grants efficiently through our SaaS platform.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Our charts are dramatically up-and-to-the-right 📈 — we’re cash flow positive and doubling year-over-year, with customers who love us (NPS is 65+ and Ellis PMF survey is 60+). Join us on this rocket ship to Mars!</span></div><div><br></div><div><b><span style=\"font-size: 18px\">About the role:</span></b></div><div><br></div><div><span style=\"font-size: 12pt\">As a Sr. Infrastructure Engineer at Instrumentl, you will work closely with our Head of Engineering and partner with team members across design, product, content, and support functions, providing a best-in-class experience to every user.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Our small, distributed engineering team builds, scales, and improves our customer experience and in-house tooling from end to end. We’re accountable for the quality and reliability of our product, support, and data stack, and we believe in continuous improvement. Get to know us at </span><a class=\"postings-link\" style=\"font-size: 12pt\" href=\"http://instrumentl.com/about\">instrumentl.com/about</a><span style=\"font-size: 12pt\">!</span></div><div><br></div><div><span style=\"font-size: 12pt\">Our ideal candidate is eager to learn, willing to experiment, and excited to empower both teammates and customers to accelerate social progress and propel innovation.</span></div><div><br></div><div><span style=\"font-size: 12pt\">The Instrumentl team is fully distributed (though if you’d like to work from our Oakland office, we would love to see you there). For this position, we are looking for someone who has significant overlap with Pacific Time Zone working hours.</span></div></div><div class=\"section page-centered\"><div><h3>What you'll do:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Build, operate, and continuously improve the datastores, tools, and cloud infrastructure used by Instrumentl’s engineering teams to deliver the high-quality software that delights our customers.</li><li>Relentlessly iterate to remove bottlenecks and improve our delivery pipeline, accelerating time-to-market and driving product impact.</li><li>Contribute high-quality, thoroughly tested code that powers resilient and high-performance backend systems.</li><li>Define, implement, and monitor security policies and processes to protect customer data and maintain a strong security posture.</li><li>Collaborate closely with cross-functional teams, including product, sales, support, and content, to enhance internal tools and workflows, ensuring our best-in-class product remains competitive.</li><li>Own complex problems from end to end, engaging with stakeholders to deliver both short-term fixes and long-term solutions that align with business goals.</li><li>Act as a strategic partner by considering everything from business outcomes to system reliability and the user experience, delivering with precision and quality.</li><li>Uphold Instrumentl’s high standards for product excellence and mentor team members, fostering growth and consistently raising the bar for engineering quality.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Who you are:</h3><ul class=\"posting-requirements plain-list\"><ul><li><b>Experienced: </b>you’ve been a software or infrastructure engineer for 5+ years - startup experience is a huge plus!</li><li><b>Generalist:</b> you enjoy working on frontend, backend, infrastructure, data pipelines, or billing pipelines as needed.</li><li><b>Hands-On: </b>you’ve used PostgreSQL, Redis, Heroku, Google Cloud (or AWS), Ruby on Rails, JavaScript, HTML, and CSS, and you’re open to adopting new tools to get the job done.</li><li><b>Collaborative:</b> you thrive in an environment involving different functions, stakeholders, and subject matter experts.</li><li><b>Methodical:</b> you take pride in delivering projects from ideation to completion.</li><li><b>Hungry:</b> you’re on a mission to make an impact and motivated by constant learning.</li><li><b>Results-Driven: </b>you have a history of executing in a fast-paced environment.</li><li><b>Passionate: </b>you’re excited about Instrumentl’s mission to propel nonprofits into a bigger, brighter future.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Compensation &amp; Benefits:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Salary ranges are based on market data, relative to our size, industry, and stage of growth. Salary is one part of total compensation, which also includes equity, perks, and competitive benefits.&nbsp;</li><li>For US-based candidates, our target salary band is <b>$145,000 - $185,000/year </b>+ equity. Salary decisions will be based on multiple factors including geographic location, qualifications for the role, skillset, proficiency, and experience level.&nbsp;</li><li>100% covered health, dental, and vision insurance for employees, 50% for dependents</li><li>Generous PTO policy, including parental leave</li><li>401(k)</li><li>Company laptop + stipend to set up your home workstation</li><li>Company retreats for in-person time with your colleagues</li><li>Work with awesome nonprofits around the US. We partner with incredible organizations doing meaningful work, and you get to help power their success.</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><b><span style=\"font-size: 18px\">What to expect:</span></b></div><div><br></div><div><span style=\"font-size: 16px\">Instrumentl is evolving rapidly. You’ll always have new challenges and opportunities to grow in your role - you won’t be bored! You’ll be an early member of our small but mighty team, playing a huge part in shaping our culture for the years and teammates to come.</span></div><div><br></div><div><b style=\"font-size: 16px\">At Instrumentl:</b></div><div><br></div><div><b style=\"font-size: 16px\">- We’re customer-focused. </b><span style=\"font-size: 16px\">We routinely seek feedback from our customers to improve the Instrumentl experience for everyone. Our first company value is \"The customer is the hero\" and we mean it.</span></div><div><b style=\"font-size: 16px\">- We love to experiment. </b><span style=\"font-size: 16px\">We are constantly generating new concepts and iterating to see what works - ideation and experimentation are essential here. \"Bend the curve\" is another key company value.</span></div><div><b style=\"font-size: 16px\">- We appreciate authenticity. </b><span style=\"font-size: 16px\">We have a diverse range of life experiences, and we encourage open, clear communication with each other about the things that matter most to us.</span></div><div><b style=\"font-size: 16px\">- We’re approachable and collaborative.</b><span style=\"font-size: 16px\"> Everyone has a voice, and we’re all building Instrumentl together.</span></div><div><b style=\"font-size: 16px\">- We kick it every day with some of the nicest people in the world.</b><span style=\"font-size: 16px\"> No joke, our customers are often on the front lines educating kids, saving endangered species, and restoring watersheds. In helping them take advantage of Instrumentl’s technology, you’re helping them move the world forward.</span></div><div><br></div><div><b><span style=\"font-size: 18px\">Ready to apply?</span></b></div><div><br></div><div><span style=\"font-size: 16px\">Please submit a written response addressing the prompts below:</span></div><div><br></div><div><span style=\"font-size: 16px\">1. Why are you interested in Instrumentl and this role?</span></div><div><span style=\"font-size: 16px\">2. What makes you a good fit for this role?&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px\">Don't forget to include the word </span><b style=\"font-size: 16px\">moxie </b><span style=\"font-size: 16px\">in your application to show you read this from start to finish! Along with your written response, please attach your CV or resume.</span></div><div><br></div><div><i><span style=\"font-size: 16px\">At Instrumentl, we pride ourselves on building a diverse team from the ground up. Every role is an opportunity to teach, learn, and create some of your best work - if you’re excited to grow along with us, we encourage you to apply!</span></i></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/Instrumentl/be00e1ac-dde4-4f9f-b2a6-26f3077c2bf5/apply\">Apply for this job</a></div>","tags":"[\"postgres\",\"javascript\",\"management\",\"engineering\",\"aws\"]","pubDate":"2024-11-05 04:22:33.306","link":"https://jobs.lever.co/Instrumentl/be00e1ac-dde4-4f9f-b2a6-26f3077c2bf5","savedDate":"2024-11-05 04:22:33.306","slug":"senior-infrastructure-engineer-instrumentl-3566"},{"id":2202096656,"title":"Support Engineer [IC2]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that <a href=\"https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4\">everyone can code</a>, not just ~0.1% of the population. We're building the code intelligence platform that powers the world's best code search and the most popular open-source code AI tool. It’s an exciting time to join Sourcegraph—AI has taken over the world, and we aim to automate 99% of the toil in software engineering with our code understanding and code AI tools, leaving the remaining 1% to the irreplicable creative spark from humans.&nbsp;</p>\n<p>Our customers range from startups to the Fortune 500, 4/5 FAANG companies, government organizations, Uber, Plaid, and more. We’ve raised $225M at a $2.625B valuation from <a href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\">a16z</a>,<a href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\"> Sequoia</a>, <a href=\"https://www.redpoint.com/companies/sourcegraph/\">Redpoint</a>, <a href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\">Craft</a> and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Working hours</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire <a href=\"https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4\">almost anywhere</a> in the world, we have a preference for someone to reside in the following locations for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, the expected working hours for this position is 9:00am - 5:00pm Central Standard Time.</p>\n<p><strong>Preferred locations:</strong></p>\n<ul>\n<li>North America: CST or MST required</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>As part of the Technical Success organization, Support Engineering (SE) is at the forefront of the customer experience. Our customers simply wouldn’t be successful, happy, long term customers without the important work this team does! SE exists to not only resolve technical issues but educate our customers by answering reactive questions, and by importantly identifying improvements we can make to help improve the product. Our customers are developers and we help them throughout their customer journey.</p>\n<p>Within one month you will…</p>\n<ul>\n<li>Learn about our product, our value propositions, our customers, our team, and our practices.</li>\n<li>Learn how Code Search is deployed (e.g., Kubernetes, scaling, and more), product configuration and integrations, our code base, and common user needs.</li>\n<li>Learn how Cody works, the problem it solves and how our customers use it day to day</li>\n<li>Meet for an initial chat with the teammates you will work with most</li>\n<li>Start working with customers to troubleshoot and solve reported issues (with lots of support and help from your team).</li>\n</ul>\n<p>Within three months you will…</p>\n<ul>\n<li>Work with customers to troubleshoot and solve reported issues</li>\n<li>Contribute to improving our product and handbook documentation</li>\n</ul>\n<p>Within six months you will…</p>\n<ul>\n<li>Observe trends causing issues for our customers and suggest remedies (for example, what consistent things happen that we can write tooling for...)</li>\n<li>Suggest (and take responsibility for) improvements for team onboarding and ongoing enablement, improving the customer experience, and/or improving the product</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>About you</strong></span></h2>\n<p>You are curious and compassionate. You are a problem solver - you love the moment where you “figure it out”. You enjoy trying new technologies, breaking them and helping fix them. You want to be part of a technical organization while talking with customers.</p>\n<ul>\n<li>Profound curiosity to figure out why something works the way it does / to learn more</li>\n<li>Experience with Unix/Linux and/or Bash</li>\n<li>Familiarity with Kubernetes containerized solutions</li>\n<li>Familiarity with code hosts such as GitHub, GitLab and BitBucket</li>\n<li>Compassion to meet our customers (who are all developers themselves) where they are, understand their issues, and be compelled to action</li>\n<li>Experience collaborating with cross-functional teams to solve difficult problems for customers</li>\n<li>Proficiency in communicating complex technical ideas and decisions to a variety of audiences (both technical and non-technical)</li>\n</ul>\n<p>Nice to have</p>\n<ul>\n<li>Understanding of databases, especially SQL&nbsp;</li>\n<li>Proficiency in working independently, figuring things out when there aren’t a lot of people to ask real-time</li>\n<li>Foundational knowledge of APIs and/or Git</li>\n<li>Experience or training (formal or self-taught) with Kubernetes (or other container orchestration framework)&nbsp;</li>\n<li>Experience writing code in Go or another language</li>\n<li>Experience supporting AI products or knowledge about LLMs</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC2. You can read more about&nbsp;<a href=\"https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66?pvs=4\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values <a href=\"https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d\">competitive compensation</a>, our compensation ranges are visible to every single Sourcegraph teammate. Your salary is determined by your pay band for the IC2 job level. For determining pay bands, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that the salaries below may be adjusted in the future.</p>\n<p>💰 The target compensation for this role is $84,800 USD</p>\n<ul>\n<li>Zone 2: $84,800 USD</li>\n</ul>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about <a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\">the types of interviews</a> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5 hours in total.</p>\n<p>👋 Introduction Stage - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13\">Recruiter Screen</a></li>\n<li>[30m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694\">Hiring Manager Screen</a></li>\n</ul>\n<p>🧑‍💻 Team Interview Stage - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[45m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded\">Resume Deep Dive</a></li>\n<li>[1.5hr] Async take-home project</li>\n<li>[1hr] <a href=\"https://sourcegraph.notion.site/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7#88b9f826dee04ef98afc2aeec35b877a\">Peer Interview</a> - Review project and follow-up questions</li>\n</ul>\n<p>🎉 Final Interview Stage - we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd\">Values</a></li>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c\">Leadership Interview</a> with co-founder</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p>We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process. You can learn more about what it is like to work at Sourcegraph by reading <a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\">our handbook</a>.</p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p>Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&nbsp;</p>\n<p><em>Sourcegraph participates in&nbsp;<a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\">E-Verify</a> for U.S. Employees.&nbsp;</em></p></div>\n","tags":"[\"engineering\",\"database\"]","pubDate":"2024-11-05 04:22:33.305","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5365119004","savedDate":"2024-11-05 04:22:33.305","slug":"support-engineer-ic2-sourcegraph-8008"},{"id":4047836731,"title":"Resident Architect, EMEA [IC3]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that <a href=\"https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4\">everyone can code</a>, not just ~0.1% of the population. We're building the code intelligence platform that powers the world's best code search and the most popular open-source code AI tool. It’s an exciting time to join Sourcegraph—AI has taken over the world, and we aim to automate 99% of the toil in software engineering with our code understanding and code AI tools, leaving the remaining 1% to the irreplicable creative spark from humans.&nbsp;</p>\n<p>Our customers range from startups to the Fortune 500, 4/5 FAANG companies, government organizations, Uber, Plaid, and more. We’ve raised $225M at a $2.625B valuation from <a href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\">a16z</a>,<a href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\"> Sequoia</a>, <a href=\"https://www.redpoint.com/companies/sourcegraph/\">Redpoint</a>, <a href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\">Craft</a> and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Location</strong></span></h2>\n<p>🌎 While we hire <a href=\"https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4\">almost anywhere</a> in the world, we require this person to reside in EMEA.</p>\n<p><strong>Preferred locations:</strong></p>\n<ul>\n<li>United Kingdon</li>\n<li>Portugal</li>\n<li>Spain</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>As a Resident Architect (RA), you will have significant responsibility and growth potential in helping us shape and build the newer Professional Services organization. As a RA, you’ll be tasked with scoping, planning, and executing on customer-specific projects centered on improving adoption, utilization, and value demonstration of Sourcegraph’s products for our largest and most strategic customers. You’ll be working directly with customers, in collaboration with many internal teams, to lead engagements spanning a wide range of focus areas including custom training, advanced feature utilization for admins and power users, bespoke value assessments, and more.</p>\n<p>Within one month, you will…</p>\n<ul>\n<li>Start building a trusting relationship with your peers on the Professional Services, Sales, Customer Engineering, Post-Sales Technical Advisory, Support, and other internal teams</li>\n<li>Learn about our products, our value proposition, our customers, our team, and our processes, and our existing materials.</li>\n<li>Become proficient in Professional Services tools and processes, including how we sell and execute on engagements.</li>\n<li>Review current and prospective RA customers, developing an understanding of typical RA engagements, the value we add, and the problems we solve for.</li>\n</ul>\n<p>Within three months, you will…</p>\n<ul>\n<li>Work directly with RA customers and their account teams to lead RA engagements.</li>\n<li>Scope, design, and execute RA projects to solve a variety of customer-specific problems.</li>\n<li>Develop generalized materials, using artifacts and learnings from your RA projects, to set up RA and account teams for better future success.</li>\n<li>Demonstrate the ability to train technical administrators and Sourcegraph end-users at a high level using both standard and customer practices.</li>\n<li>Serve as an advocate on behalf of your customers by bringing important insights, observations, and feedback back to internal teams.</li>\n<li>Use your gained technical understanding of Sourcegraph, code search, and AI coding assistants to effectively collaborate with Engineering and Product teams to drive RA customers to better technical success.</li>\n</ul>\n<p>Within six months, you will…</p>\n<ul>\n<li>Collaborate closely with Technical Success, Sales, Engineering, and Product on what you observe and learn from customers to drive GTM and product improvements in the future.</li>\n<li>Iterate on and mature existing processes, templates, and tools to better service our customers.</li>\n<li>Establish yourself as a thought leader and evangelist by using your insights to teach prospective customers new and better ways to get value from Sourcegraph.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\">About you</span></h2>\n<p>You are autonomous, driven, results-oriented, and technical, sharing <a href=\"https://handbook.sourcegraph.com/company-info-and-process/values/\">our values</a> with a passion for delivering significant value in direct collaboration with customers. You are excited and motivated to work in a nebulous role for a new and rapidly evolving team.</p>\n<p>Your skillset:</p>\n<ul>\n<li data-stringify-indent=\"0\" data-stringify-border=\"0\">You have previous experience as a software developer or in another technical role that gave you exposure to development practices, writing code, and deploying software solutions.</li>\n<li data-stringify-indent=\"0\" data-stringify-border=\"0\">You have experience working with and developing API integrations and architecting API-based solutions.</li>\n<li data-stringify-indent=\"0\" data-stringify-border=\"0\">You have a working knowledge of SQL and are capable of building an understanding of database structures and developing queries to answer specific questions surrounding the available data.</li>\n<li data-stringify-indent=\"0\" data-stringify-border=\"0\">You have experience working with Grafana, Looker, or other data visualization tools.</li>\n<li>You have an organized approach to work, with demonstrated ability to proactively scope, plan, execute, and manage multiple differing customer engagements concurrently.</li>\n<li>You can identify issues and opportunities as well as solutions to solve both internal and external problems or gaps.</li>\n<li>In using your skills to provide solutions for customers, you have a strategic mindset with the ability to identify shortcomings and opportunities that can be shared internally and in future customer engagements.</li>\n<li>Ability to collaborate and communicate fluently with a wide range of customer stakeholders between management, champions, administrators, and users.</li>\n<li>Experience interacting with internal product teams, informing feature prioritization based on customer needs.</li>\n<li>Work experience providing technical training customers on product features, troubleshooting, configuration, and organizational best practices.</li>\n<li>Work experience in a technical, customer facing role with a deep understanding and working knowledge of the end-to-end software development lifecycle.</li>\n<li>Ability to communicate and explain technical concepts to a non-technical audience.&nbsp;</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC3.&nbsp; You can read more about <a href=\"https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values <a href=\"https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4\">competitive compensation</a>, our compensation ranges are visible to every single Sourcegraph teammate.</p>\n<p>💰 The target compensation for this role is based on the IC2 pay band for your zone.&nbsp;</p>\n<p>Zone 1: $173,379 USD<br>Zone 2: $138,703 USD</p>\n<p>Please speak with a recruiter for additional information regarding zone locations.</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 4 hours in total.&nbsp;</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13\">Recruiter Screen</a></li>\n<li>[60m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694\">Hiring Manager Screen</a> / <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded\">Resume Deep Dive</a></li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[45m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#cb00697e95304550a146c32563c0255d\">Cross-functional team collaboration</a> with a Technical Advisor</li>\n<li>[45m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#88b9f826dee04ef98afc2aeec35b877a\">Peer</a> with a Resident Architect</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd\">Values</a></li>\n<li>[30m <a href=\"https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c\">Leadership</a> with co-founder&nbsp;</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p>We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process. You can learn more about what it is like to work at Sourcegraph by reading <a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\">our handbook</a>.</p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p>Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&nbsp;</p>\n<p><em>Sourcegraph participates in&nbsp;<a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\">E-Verify</a> for U.S. Employees.&nbsp;</em></p></div>\n","tags":"[\"management\",\"engineering\",\"database\"]","pubDate":"2024-11-05 04:22:33.304","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5365114004","savedDate":"2024-11-05 04:22:33.304","slug":"resident-architect-emea-ic3-sourcegraph-2430"},{"id":6076429015,"title":"Senior Java Developer (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>At CloudLinux, we seek a talented and passionate Java Developer to join our team.&nbsp;</p><p>As the leading provider of the #1 OS for web-hosting providers, we pride ourselves on developing innovative products used by thousands of companies worldwide.&nbsp;</p><p>In this role, you will be working on the Extended Lifecycle team, where you will have the opportunity to make a significant impact by providing a secure Java instrumentation for heterogeneous Java-based environments.</p><p>We are looking for someone with extensive expertise in Java tools and a fresh and revolutionary approach. This challenging mission requires a deep understanding of Java tools and a keen eye for creating groundbreaking solutions.</p><p>For more details about the project, please visit the product website at <a href=\"https://tuxcare.com/extended-lifecycle-support/\" rel=\"nofollow noreferrer noopener\" class=\"external\">TuxCare.com</a>.<br><br><strong>What will you do in this role?</strong></p><ul> <li>Your role will involve enhancing the security of Java and delving deep into its inner workings.</li> <li>You'll be tasked with conducting research and running experiments to expedite the assembly of Java packages.</li> <li>The fruits of your labor will be a more secure Java environment, facilitating the development work of others.</li> <li>You'll be investigating vulnerabilities in Java and Java libraries, particularly focusing on the most popular end-of-life versions of Java.</li> <li>Your responsibilities will also include improving automation processes that construct the dependency tree and automatically rebuild projects, etc.</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role, you should have:</strong></p><ul> <li>4+ years in software development.</li> <li>High-level Java core, Spring framework.</li> <li>Experience with NoSQL and PostgreSQL.</li> <li>Experience with Gitlab as CI/CD will be a plus.</li> <li>Experience with repository management systems such as Nexus will be a plus.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth:</li> <ul> <li>Interesting and challenging projects,</li> <li>Mentor and other knowledge-exchange programs.</li> </ul> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves to ensure you maintain a healthy work-life balance.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"postgres\",\"management\"]","pubDate":"2024-11-04 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/AB7592AA0A","savedDate":"2024-11-05 04:22:33.307","slug":"senior-java-developer-worldwide-remote-work-anywhere-cloudlinux-1219"},{"id":5586458702,"title":"Senior Software Engineer","company":"Canny","image":"https://remotive.com/job/1947382/logo","description":"<p>Thousands of companies build better software products with the help of Canny’s customer feedback platform. As a <strong>Senior Software Engineer</strong> at Canny, you will play a central role in shaping our product's future, with a focus on offering an unparalleled user experience.</p>\n<p><br>We are...</p>\n<ul style=\"\">\n<li style=\"\">Fully remote with no office</li>\n<li style=\"\">17 people across 6 countries (US, Canada, Mexico, Brazil, Spain, Turkey)</li>\n<li style=\"\">Bootstrapped (no investors) and profitable</li>\n</ul>\n<div> </div>\n<div><strong>What you'll do at Canny</strong>:</div>\n<ul style=\"\">\n<li style=\"\">Collaborate with the product and design teams to develop and implement new features.</li>\n<li style=\"\">Optimize and refine existing features to improve UX and decrease friction.</li>\n<li style=\"\">Troubleshoot, identify, and fix bugs to improve customer experiences.</li>\n<li style=\"\">Participate in code reviews, fostering a culture of quality and collaborative learning.</li>\n<li style=\"\">Keep up-to-date with industry best practices and technologies to maintain Canny’s edge in the market.</li>\n<li style=\"\">Contribute to technical documentation, ensuring ease of use and understanding for future reference.</li>\n</ul>\n<p> </p>\n<p><strong>Tech you’ll use every day:</strong></p>\n<ul style=\"\">\n<li style=\"\">Our stack - TypeScript, ReactJS, Node.js, MongoDB, SCSS</li>\n<li style=\"\">Cloud services - AWS, GitHub, CircleCI, MongoDB</li>\n<li style=\"\">Slack - team and some customer communication</li>\n<li style=\"\">Canny - tracking user feedback 🙂</li>\n<li style=\"\">Missive - email collaboration</li>\n<li style=\"\">ClickUp - project management</li>\n</ul>\n<p> </p>\n<p><strong>Compensation &amp; Benefits:</strong></p>\n<ul style=\"\">\n<li style=\"\">Base salary, competitive in all major cities</li>\n<li style=\"\">Bonus program (8% of base salary, varies on performance)</li>\n<li style=\"\">Regular Compensation Reviews (conducted semi-annually)</li>\n<li style=\"\">Equity grant (RSUs)</li>\n<li style=\"\">20 paid vacation days, 15 paid holidays, and unlimited sick leave.</li>\n<li style=\"\">Healthcare: medical, dental, vision</li>\n</ul>\n<p> </p>\n<p>Join us at Canny and be a part of a team passionate about build high quality software products. We look forward to reviewing your application!</p>\n<div class=\"h5\">Experience you'll bring to Canny:</div>\n<ul style=\"\">\n<li style=\"\">5 years of professional software engineering experience with a frontend focus</li>\n<li style=\"\">Production experience with TypeScript, React, Node.js, MongoDB, AWS</li>\n<li style=\"\">Eagerness to shape the technical direction of the product, lead architectural decision making, and mentor others</li>\n<li style=\"\">Strong written and verbal communication skills</li>\n<li style=\"\">You are self-motivated and have strong organizational skills</li>\n<li style=\"\">Experience working autonomously and as a part of a small, preferably remote, team.</li>\n<li style=\"\">You have demonstrated the ability to onboard and integrate with an organization long-term:\n<ul style=\"\">\n<li style=\"\">within the last 5 years, you've worked at one company for at least 2 years</li>\n</ul>\n</li>\n</ul>\n<div class=\"h5\"><strong>Bonus:</strong></div>\n<ul style=\"\">\n<li style=\"\">Experience building enterprise and/or SaaS software</li>\n<li style=\"\">Deep experience with frontend web applications</li>\n</ul>\n<p> </p>\n<p><strong>Apply:</strong></p>\n<ul style=\"\">\n<li style=\"\">In your application, please submit your resume, an optional cover letter, and explain your motivation for wanting to join Canny (we genuinely value understanding why you're drawn to us!).</li>\n<li style=\"\">A heads-up: Every application is carefully reviewed by our team. To stand out and ensure your success, please answer the screening questions diligently. Candidates who don't invest time in the screening questions rarely advance.</li>\n<li style=\"\">For some extra flair, share a link to your favorite GIF.</li>\n<li style=\"\">Please note, that we have posted this role twice for recruitment marketing purposes as it is helpful to have a variety of job titles to capture the correct market. You do not need to apply to both open roles.</li>\n</ul>\n<p> </p>\n<p><strong>Location:</strong></p>\n<ul style=\"\">\n<li style=\"\">This role requires working North American hours to best serve our customers and coordinate with the team.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1947382/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"mongoDB\",\"node.js\"]","pubDate":"2024-11-03 17:20:13.000","link":"https://remotive.com/remote-jobs/software-dev/senior-software-engineer-1947382","savedDate":"2024-11-05 04:22:33.303","slug":"senior-software-engineer-canny-9879"},{"id":9704683368,"title":"Senior Business Analyst - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3><strong>What You Will Do:</strong></h3><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h3><strong>What We Need:</strong></h3><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry (health, life, P&amp;C) is required </li> <li>Insurtech experience is preferred</li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing skills and knowledge of other languages (Chinese) is a plus</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2024-11-02 00:00:00.000","link":"https://apply.workable.com/covergo/j/8B7D09D999","savedDate":"2024-11-05 04:22:33.308","slug":"senior-business-analyst-insurance-fully-remote-covergo-4026"},{"id":9670372635,"title":"STRATEGY MANAGER (Work from anywhere in the world)","company":"Wishpond","image":"https://yt3.googleusercontent.com/godmUZWusLdpmQ_8MgednMJQy7ZInLrCJ0KkUxuHnx3jeZubp774PPTdp_8MAWcWlbjYx9SX=s160-c-k-c0x00ffffff-no-rj","description":"<div><b style=\"font-size: 18px;\">PersistIQ currently has the position of&nbsp; </b><b><span style=\"font-size: 13pt;\">Strategy</span></b><span style=\"font-size: 13pt;\">&nbsp;</span><b style=\"font-size: 18px;\">Manager&nbsp;available, and we’re excited to tell you about it!</b></div><div><br></div><div><b style=\"font-size: 18pt;\">ABOUT PERSISTIQ BY WISHPOND</b></div><div><span style=\"font-size: 12pt;\">PersistIQ is a fast-growing, innovative tech company specializing in outbound sales solutions. We work with businesses of all sizes to create and execute outbound campaigns that leverage the power of email.&nbsp;<b>PersistIQ is a subsidiary of Wishpond Technologies.</b> Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses. Wishpond serves over 3,000 customers in various industries and sizes, from startups to large Fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company. </span></div><div><br></div><div><b style=\"font-size: 24px;\">OVERVIEW</b></div><div><span style=\"font-size: 16px;\">Wishpond Technologies Ltd. is looking for an experienced and motivated Strategy Manager to work as part of our integrated marketing team to develop marketing campaign strategies that drive growth for our clients. In this role, you’ll use marketing insights to craft data-driven strategies for a diverse range of clients. You’ll collaborate on campaigns with members of our global team and present data-driven insights &amp; performance reporting.</span></div><div><br></div><div><b style=\"font-size: 24px;\">RESPONSIBILITIES</b></div><div><span style=\"font-size: 16px;\">• Review and optimize campaigns for PersistIQ client accounts (including deliverability, audience, and messaging)</span></div><div><span style=\"font-size: 16px;\">• Review, identify issues, and optimize email deliverability for PersistIQ client accounts</span></div><div><span style=\"font-size: 16px;\">• Come up with strategies / tests on how to improve results for all/cohorts of PersistIQ clients</span></div><div><span style=\"font-size: 16px;\">• Work with the General Manager, Account Managers/Account Directors, Lead-Generation team, and Copywriting team to collaborate on strategies</span></div><div><span style=\"font-size: 16px;\">• Find patterns and common client scenarios where we have found specific strategies that work well, and create blueprints to be able to utilize across our entire user base</span></div><div><span style=\"font-size: 16px;\">• Proactively review campaigns and accounts to improve results - don’t wait for tasks to be assigned</span></div><div><span style=\"font-size: 16px;\">• Other duties as assigned&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px;\">QUALIFICATIONS</b></div><div><span style=\"font-size: 16px;\">• 1+ year of experience in Account Management, Copywriting, or campaign management</span></div><div><span style=\"font-size: 16px;\">• You are collaborative and great at working cross-functionally, informing key stakeholders and bringing them along for the greater vision or objective.</span></div><div><span style=\"font-size: 16px;\">• You are self-motivated with the ability to establish and maintain solid relationships through a client-first mentality. </span></div><div><span style=\"font-size: 16px;\">• You are proactive in identifying the root cause of issues and developing solutions.</span></div><div><span style=\"font-size: 16px;\">• You effectively balance autonomy and collaboration.</span></div><div><br></div><div><b style=\"font-size: 24px;\">WORK ENVIRONMENT</b></div><div><span style=\"font-size: 16px;\">• Given the nature of this role, it is expected that the successful candidate will provide their own workstation, computer, headset, and have a fast and reliable internet connection. Certain roles will be required to utilize and or download company-approved software.</span></div><div><span style=\"font-size: 16px;\">• This position is expected to work European time zones.</span></div><div><span style=\"font-size: 16px;\">• Due to the nature of this role, we may verify backgrounds, including conducting employment references, criminal records, and credit checks.</span></div><div><span style=\"font-size: 16px;\">• Once hired, the successful candidate must provide valid governmental photo ID and proof of residential address.</span></div><div>&nbsp;</div><div><b style=\"font-size: 24px;\">GREAT REASONS TO APPLY FOR THIS ROLE</b><span style=\"font-size: 24px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">• Fully remote position allowing you to </span><b style=\"font-size: 16px;\">work from your home anywhere in the world!</b></div><div><span style=\"font-size: 16px;\">• Exciting and dynamic environment with a great leadership team&nbsp;</span></div><div><span style=\"font-size: 16px;\">•&nbsp;Comprehensive training program and regular performance reviews to facilitate your success</span></div><div><span style=\"font-size: 16px;\">•&nbsp;Competitive compensation based on experience and proven abilities</span></div><div><span style=\"font-size: 16px;\">• Great referral programs with incentives and bonuses</span></div><div><span style=\"font-size: 16px;\">•&nbsp;Unbelievable product discounts when you use our products for your own business</span></div><div><span style=\"font-size: 16px;\">•&nbsp;A global workforce of multi-cultural and talented colleagues&nbsp;</span></div><div><span style=\"font-size: 16px;\">• A close-knit operation with amazing growth opportunities for your personal development</span></div><div><span style=\"font-size: 16px;\">• A high-growth SaaS technology company publicly traded on the TSX Venture Exchange</span></div><div><span style=\"font-size: 16px;\">• Corporate headquarters in beautiful Vancouver, British Columbia, Canada</span></div><div><span style=\"font-size: 16px;\">• Access to our education credits program and so much more!</span></div><div>&nbsp;</div><div><b style=\"font-size: 24px;\">ABOUT US</b><span style=\"font-size: 24px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses.&nbsp; The cloud-based platform includes landing pages, social promotions, website pop-ups, online forms, and lead activity tracking. Wishpond has a dedicated team of professional project managers, designers, copywriters, and developers who provide marketing services tailored to our individual clients.</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">Wishpond serves over 3,000 customers in various industries and sizes, from startups to large fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company.</span></div><div><br></div><div><span style=\"font-size: 16px;\"> To learn more about Wishpond Technologies, please visit our website or any of our social media platforms:</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">• Website: </span><a style=\"font-size: 16px;\" href=\"http://www.wishpond.com/\">www.wishpond.com</a></div><div><span style=\"font-size: 16px;\">• Instagram: @wishpondofficial</span></div><div><span style=\"font-size: 16px;\">• Twitter: Wishpond</span></div><div><span style=\"font-size: 16px;\">•  Youtube: Thewishpond</span></div><div><span style=\"font-size: 16px;\">•&nbsp;LinkedIn : Wishpond</span></div><div>&nbsp;</div><div><b style=\"font-size: 24px;\">APPLICATION PROCESS</b></div><div><b style=\"font-size: 16px;\">If you are interested in applying for this exciting opportunity, please provide an updated resume in English (PDF or Word formats only), quoting the position title in the subject line of your cover letter.</b></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">Wishpond Technologies is an equal-opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture that does not discriminate on the basis of disability, status or any other basis protected under legislation.</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">We thank all applicants in advance for their interest in this position however, due to the volume of applications we receive, we are unable to respond to phone, email or agency inquiries.</span></div><div><br></div><div><b style=\"font-size: 24px;\">Internal Applications close on: Friday, November 08, 2024, at 5:00 pm Pacific Time</b></div><div><br></div>","tags":"[\"management\"]","pubDate":"2024-11-01 22:54:22.539","link":"https://jobs.lever.co/wishpond/1a5e7ef2-be86-4113-ac70-c9aa4906184d","savedDate":"2024-11-05 04:22:33.309","slug":"strategy-manager-work-from-anywhere-in-the-world-wishpond-3596"},{"id":7348829633,"title":"SUPPORT TEAM LEAD (Work from anywhere in the world)","company":"Wishpond","image":"https://yt3.googleusercontent.com/godmUZWusLdpmQ_8MgednMJQy7ZInLrCJ0KkUxuHnx3jeZubp774PPTdp_8MAWcWlbjYx9SX=s160-c-k-c0x00ffffff-no-rj","description":"<div><b style=\"font-size: 18px;\">Wishpond Technologies currently has the position of&nbsp; </b><b style=\"font-size: 13pt;\">Support Team Lead</b><b style=\"font-size: 18px;\">&nbsp;available, and we’re excited to tell you about it!</b></div><div><br></div><div><b style=\"font-size: 24px;\">OVERVIEW</b></div><div><span style=\"font-size: 16px;\">Wishpond Technologies Ltd. is looking for an experienced and motivated Support Team Lead to manage, guide, and inspire our Customer Support team. As a Support Team Lead, you’ll be instrumental in ensuring we provide an exceptional customer experience across all support channels. Working closely with the Customer Success, Product, and Development teams, you’ll play a key role in addressing customer needs, improving team efficiency, and contributing to the ongoing success of Wishpond Technologies.</span></div><div><br></div><div><b style=\"font-size: 24px;\">RESPONSIBILITIES</b></div><div><span style=\"font-size: 16px;\">• Lead, mentor, and manage a remote team of Customer Support Representatives to ensure high-quality customer interactions and timely issue resolution.</span></div><div><span style=\"font-size: 16px;\">• Handle and manage escalated support issues, providing strategic solutions and efficient problem-solving.</span></div><div><span style=\"font-size: 16px;\">• Monitor and analyze team performance, setting clear targets and KPIs for response times, customer satisfaction, and issue resolution.</span></div><div><span style=\"font-size: 16px;\">• Conduct training sessions for the support team on new tools, processes, and customer service best practices. Continuously coach team members to improve skills and enhance performance.</span></div><div><span style=\"font-size: 16px;\">• Identify trends in customer issues, optimize workflows, and work with Product and Development teams to address recurring technical challenges.</span></div><div><span style=\"font-size: 16px;\">• Oversee and update the knowledge base, ensuring that all content, articles, and videos are accurate, accessible, and aligned with customer needs.</span></div><div><span style=\"font-size: 16px;\">• Collect and report customer feedback, trends, and insights to internal stakeholders to support product and service improvements.</span></div><div><span style=\"font-size: 16px;\">• Proactively identify and escalate risks and opportunities to the Customer Success and Project Management teams.</span></div><div><span style=\"font-size: 16px;\">• Collaborate with other departments to ensure that support policies align with broader company goals, contributing to product improvements and service enhancements.</span></div><div><span style=\"font-size: 16px;\">• Manage team schedules to ensure optimal support coverage during peak times and across different time zones.</span></div><div><span style=\"font-size: 16px;\">• Other duties as assigned.</span></div><div><br></div><div><b style=\"font-size: 24px;\">QUALIFICATIONS</b></div><div><span style=\"font-size: 16px;\">• 3+ years of experience in customer support within a SaaS company, with a proven track record of effective team leadership and support delivery.</span></div><div><span style=\"font-size: 16px;\">• Strong understanding of software applications and ability to quickly learn complex systems. Knowledge of CRM, marketing automation, landing page, and email marketing platforms is a plus.</span></div><div><span style=\"font-size: 16px;\">• Strong analytical and troubleshooting abilities to handle escalated issues and develop creative solutions for customers.</span></div><div><span style=\"font-size: 16px;\">• Excellent communication skills, with the ability to provide clear, empathetic guidance to customers and constructive feedback to team members.</span></div><div><span style=\"font-size: 16px;\">• Detail-oriented, organized, and able to balance multiple tasks in a fast-paced, high-growth environment.</span></div><div><span style=\"font-size: 16px;\">• Deeply committed to customer satisfaction, capable of fostering a client-first culture within the team.</span></div><div><span style=\"font-size: 16px;\">• Eager to participate in ongoing education and training for both personal and team developm</span><span style=\"font-size: 11pt;\">ent.</span></div><div><span style=\"font-size: 16px;\">• Fluent in English (spoken and written); knowledge of an additional language is an asset.</span></div><div>&nbsp;&nbsp;</div><div><b style=\"font-size: 16px;\">Bonus skills:</b></div><div><span style=\"font-size: 16px;\">• Knowledge of basic CSS, HTML and JS</span></div><div><span style=\"font-size: 16px;\">• Google Tag Manager</span></div><div><span style=\"font-size: 16px;\">• Experience with other marketing automation platforms</span></div><div><span style=\"font-size: 16px;\">• Knowledge of CRM platforms</span></div><div><span style=\"font-size: 16px;\">• Experience with landing page platforms</span></div><div><span style=\"font-size: 16px;\">• Experience with email marketing platforms.</span></div><div><br></div><div><b style=\"font-size: 24px;\">WORK ENVIRONMENT</b></div><div><span style=\"font-size: 16px;\">• Given the nature of this role, it is expected that the successful candidate will provide their own workstation, computer, headset, and have a fast and reliable internet connection. This position may be required to download and utilize company software.</span></div><div><span style=\"font-size: 16px;\">• Due to the nature of this role, we may verify backgrounds including conducting employment reference, criminal record and credit checks.</span></div><div><span style=\"font-size: 16px;\">• Once hired, the successful candidate must provide a valid government-issued photo ID as part of their onboarding process.</span></div><div><span style=\"font-size: 16px;\">• Ability to provide oversight during shift hours from 7 AM to 4 PM PST or 2 PM to 11 PM PST.</span></div><div><br></div><div><b style=\"font-size: 24px;\">GREAT REASONS TO APPLY FOR THIS ROLE</b></div><div><span style=\"font-size: 16px;\">• Fully remote position allowing you to </span><b style=\"font-size: 16px;\">work from your home anywhere in the world !</b></div><div><span style=\"font-size: 16px;\">• Exciting and dynamic environment with a great leadership team&nbsp;</span></div><div><span style=\"font-size: 16px;\">• Comprehensive training program and regular performance reviews to facilitate your success</span></div><div><span style=\"font-size: 16px;\">• Competitive compensation based on experience and proven abilities</span></div><div><span style=\"font-size: 16px;\">• Great referral programs with incentives and bonuses</span></div><div><span style=\"font-size: 16px;\">• Unbelievable product discounts when you use our products for your own business</span></div><div><span style=\"font-size: 16px;\">• A global workforce of multi-cultural and talented colleagues&nbsp;</span></div><div><span style=\"font-size: 16px;\">• A close-knit operation with amazing growth opportunities for your personal development</span></div><div><span style=\"font-size: 16px;\">• A high-growth SaaS technology company publicly traded on the TSX Venture Exchange</span></div><div><span style=\"font-size: 16px;\">• Corporate headquarters in beautiful Vancouver, British Columbia, Canada</span></div><div><span style=\"font-size: 16px;\">• Access to our education credits program and so much more !</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><b style=\"font-size: 24px;\">ABOUT US</b></div><div><span style=\"font-size: 16px;\">Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses.&nbsp; The cloud-based platform includes landing pages, social promotions, website pop-ups, online forms, and lead activity tracking. Wishpond has a dedicated team of professional project managers, designers, copywriters, and developers who provide marketing services tailored to our individual clients.</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">Wishpond serves over 3,000 customers in various industries and sizes, from startups to large Fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company.</span></div><div><br></div><div><span style=\"font-size: 16px;\">To learn more about Wishpond Technologies, please visit our website or any of our social media platforms:</span></div><div><br></div><div><span style=\"font-size: 16px;\">• Website: </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 16px;\" href=\"http://www.wishpond.com/\">www.wishpond.com</a></div><div><span style=\"font-size: 16px;\">• Instagram: @wishpondofficial</span></div><div><span style=\"font-size: 16px;\">• Twitter: Wishpond</span></div><div><span style=\"font-size: 16px;\">• Youtube: Thewishpond</span></div><div><span style=\"font-size: 16px;\">• LinkedIn : Wishpond</span></div><div><br></div><div><br></div><div><b style=\"font-size: 24px;\">APPLICATION PROCESS</b></div><div><b style=\"font-size: 16px;\">If you are interested in applying for this exciting opportunity, please provide an updated resume in English (PDF or Word formats only), quoting the position title in the subject line of your cover letter</b></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">Wishpond Technologies is an equal-opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture that does not discriminate on the basis of disability, status or any other basis protected under legislation</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">We thank all applicants in advance for their interest in this position however due to the volume of applications we receive, we are unable to respond to phone, email, or agency inquiries</span></div><div><br></div><div><b style=\"font-size: 24px;\">Internal Applications close on: Friday, November 08, 2024, at 5:00 pm Pacific Time</b></div>","tags":"[\"management\"]","pubDate":"2024-11-01 21:48:00.171","link":"https://jobs.lever.co/wishpond/ddc89be9-995d-4258-b432-1aff1f92cd22","savedDate":"2024-11-05 04:22:33.310","slug":"support-team-lead-work-from-anywhere-in-the-world-wishpond-857"},{"id":6349639204,"title":"Community Manager - Americas","company":"Crytek","image":"https://pbs.twimg.com/profile_images/1031556251782705153/l7Ht7Yer_400x400.jpg","description":"<div><span style=\"font-size: 11pt;\">We are looking for an experienced and passionate Community Manager to join our </span><i style=\"font-size: 11pt;\">Hunt: Showdown 1896</i><span style=\"font-size: 11pt;\"> communications team. In this role, you will drive player engagement and foster a positive, connected community across Hunt’s digital spaces, particularly within Discord, Reddit, and X (Twitter).</span></div><div><br></div><div><span style=\"font-size: 11pt;\">You’ll be the bridge between our passionate player community and internal teams, working directly with the Communications, LiveOps, and Marketing teams to ensure smooth, authentic, and clear communication in line with our brand’s voice.&nbsp;</span></div><div><br></div><div><b style=\"font-size: 11pt;\">Please note that you <u>must be located and able to work remotely</u> from one of the following countries:</b></div><div><b style=\"font-size: 16px;\">North America:</b><span style=\"font-size: 16px;\"> United States, Canada, Mexico</span></div><div><b style=\"font-size: 16px;\">South America:</b><span style=\"font-size: 16px;\"> Argentina, Brazil, Chile, Colombia, Peru, and any other countries within the continent.</span></div><h3>Responsibilities</h3><li>Serve as the primary point of contact for our players on Discord, building personal connections with the community and moderating discussions to foster a positive environment amongst players.&nbsp;</li><li>Contribute to the development and delivery of community building strategies across all key player hubs&nbsp;</li><li>Act a spokesperson for the project within the community&nbsp;</li><li>Monitor community sentiment, identify and escalate issues to Communications Lead&nbsp;</li><li>Collaborate with the LiveOps team to align player messaging, announcements, and updates, ensuring players stay informed and engaged.&nbsp;</li><li>Work closely with the Marketing and wider Communicationsteam to manage influencers and content creators via our Hunt partner program.&nbsp;</li><li>Actively drive positive internal communication within the marketing, communications, PR departments.&nbsp;</li><li>Provide weekend coverage of key channels to ensure consistent communication as a part of the full Community Management team throughout the week&nbsp;</li>,<h3>Requirements</h3><li>2+ years community management experience, preferably working within the gaming industry.&nbsp;</li><li>Strong personal connection with <i>Hunt: Showdown 1896</i>, with experience as a player, understanding the product and its player community.&nbsp;</li><li>Fundamental understanding and passion for gaming culture and the industry, including familiarity with competitor’s products and trends in the gaming landscape.&nbsp;</li><li>Hands-on attitude with a focus on direct community interaction; this role requires a highly active presence across all channels.&nbsp;</li><li>Ability to quickly identify, flag, and assist in resolving community issues, both individually and with the support of internal teams.&nbsp;</li><li>Excellent written and verbal English skills.&nbsp;</li>,<h3>Pluses</h3><li>Familiarity with key streamers, influencers, and content creators relevant to Hunt and similar games within the genre.&nbsp;</li><li>Other/non-professional community management experience, e.g. as a volunteer Discord moderator.&nbsp;</li>","tags":"[\"management\"]","pubDate":"2024-10-31 14:32:31.623","link":"https://jobs.lever.co/crytek/06fc7f22-eb65-45ef-8f3a-09e33ac0c71e","savedDate":"2024-11-05 04:22:33.312","slug":"community-manager-americas-crytek-4473"},{"id":2097521907,"title":"Senior Business Analyst - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3><strong>What You Will Do:</strong></h3><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h3><strong>What We Need:</strong></h3><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry is required (Insurtech or health insurance experience is preferred)</li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing skills and knowledge of other languages (Chinese) is a plus</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2024-10-31 00:00:00.000","link":"https://apply.workable.com/covergo/j/09944B69DE","savedDate":"2024-11-05 04:22:33.308","slug":"senior-business-analyst-insurance-fully-remote-covergo-9012"},{"id":1654931730,"title":"Middle/Senior Python Developer with Security Expertise (worldwide remote)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p><strong>Imunify360 Security Suite is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers.</strong> Imunify is an innovative security solution designed specifically for shared and VPS/Dedicated servers. The automated, easy-to-use solution with the six-layer approach to security delivers comprehensive and complete attack prevention. Check out our website for more information about our Imunify Product: <a href=\"https://www.imunify360.com/.\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://www.imunify360.com/</a><strong>.</strong></p><p><strong>Our growing Imunify Team is looking for a skilled Middle/Senior Python Developer with a solid background in security. </strong>Be a part of a team making a real impact in the security field. Your work will help shape the future of AI-driven security for web servers. You'll tackle exciting challenges, collaborate with talented peers, and make a difference in the world of web server security. The position is fully remote with flexible hours, allowing you to plan your day and work from anywhere in the world. Join us and take your career to the next level!</p><p></p><p><strong>As a Python Developer on the Imunify Team, you will:</strong></p><ul> <li>Design and implement <strong>malware detection</strong> and <strong>remediation systems</strong> </li> <li>Develop <strong>high-performance</strong>, <strong>scalable</strong> code for <strong>large-scale data processing</strong> </li> <li>Contribute to architectural decisions and technical documentation</li> <li>Participate in <strong>brainstorming sessions</strong> and actively contribute to the team’s development backlog</li> <li> <strong>Analyze and prioritize data</strong> to streamline development efforts</li> <li>Troubleshoot and resolve issues reported by <strong>clients, partners, and support teams</strong> </li> </ul><h3>Requirements: </h3><p><strong>What We’re Looking For (Qualifications):</strong></p><ul> <li> <strong>Several years of experience</strong> in Python development or similar engineering roles</li> <li>Strong passion for <strong>security</strong>, with a deep understanding of threats such as <strong>viruses and web shells</strong> </li> <li>Experience in <strong>Linux server administration</strong> (a plus)</li> <li>Knowledge of <strong>PHP</strong> and <strong>JavaScript</strong> (a plus)</li> <li>Familiarity with <strong>Apache Airflow</strong>, <strong>SQL</strong>, and <strong>CI/CD systems</strong> (a plus)</li> <li>Proficiency in <strong>automated testing</strong> and tools to support development processes</li> <li>Proficiency in English <strong>above intermediate level</strong> </li> </ul><p></p><p><strong>Personal Attributes:</strong></p><ul> <li> <strong>Quick learner</strong> with a proactive mindset</li> <li>Self-driven, focused on achieving key milestones</li> <li> <strong>Strong ability to prioritize</strong> and adapt in fast-paced environments</li> <li>Ability to <strong>analyze problems independently</strong> and provide effective solutions</li> <li>Comfortable with ambiguous requirements and capable of making <strong>autonomous decisions</strong> </li> <li>Collaborative and eager to work in a <strong>team-focused environment</strong> </li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth</li> <ul> <li>Interesting and challenging projects</li> <li>Mentor and other knowledge-exchange programs</li> </ul> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves to ensure you maintain a healthy work-life balance</li> <li>Compensation for private medical insurance</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"javascript\",\"engineering\"]","pubDate":"2024-10-29 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/71A313E884","savedDate":"2024-11-05 04:22:33.307","slug":"middle-senior-python-developer-with-security-expertise-worldwide-remote-cloudlinux-8334"},{"id":7798486856,"title":"Senior Python/Full Stack Developer (Django-focused) (worldwide remote)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p></p><p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful. We are truly a great place to work.</p><p></p><p>Check out our website for more information - <a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a>&nbsp;</p><p></p><p>In this role, you will have two main focuses. Firstly, you will work on the development of web-facing applications that our employees, customers, and their end-users rely on. Secondly, you will handle the internal back-end services responsible for processing, analyzing, and acting upon the scan data submitted by our agent software on customers' web hosting servers.&nbsp;</p><p></p><p>The component you will take responsibility for is offered as SaaS and is delivered from our own centralized infrastructure. This role is incredibly demanding and intriguing, given the scalability challenges and sensitive nature of the data we deal with. A thorough understanding of Python, message queues, large data sets, and security is crucial.&nbsp;</p><p></p><p>Your work directly impacts the safety and functionality of millions of websites worldwide, so attention to detail and a high-quality standard are paramount.</p><p></p><p>Key Responsibilities:</p><p></p><ul> <li>Design, develop, test, and deliver web applications using Django and related technologies.</li> <li>Technical ownership of the created application.</li> <li>Implement user interfaces using front-end technologies (HTML, CSS, JavaScript frameworks).</li> <li>Work with Linux-based systems for deployment and development, including container management (Docker, Kubernetes).</li> <li>Build pipelines for code testing and delivery.</li> <li>Ensure application security and data protection.</li> <li>Troubleshoot and debug code across the stack.</li> <li>Version control using Git, including branching, merging, and pull requests.</li> <li>Review your colleagues' code.</li> <li>Plan your work forward.</li> </ul><h3>Requirements: </h3><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>Minimum of 5 years of experience in Python (Django) or full-stack development.</li> <li>Proficiency in Django and Python for backend development.</li> <li>Strong experience with Linux as a development and deployment environment.</li> <li>Experience with front-end technologies like React, Vue.js, or Angular (at least 1 year).</li> <li>Proven experience in building web applications and scalable systems.</li> <li>Hands-on experience with containers, such as Docker, for development and production.</li> <li>Proficiency with Git for version control.</li> <li>Solid understanding of SQL and experience with relational databases (e.g., PostgreSQL, MySQL).</li> <li>Experience with libraries for managing background tasks like Celery or similar.</li> <li>Experience with tools for managing task queues like RabbitMQ or Kafka.</li> <li>Strong experience with building CI pipelines in tools like Gitlab or Jenkins.</li> <li>Strong problem-solving skills and attention to detail.</li> <li>An intermediate level of English language proficiency.</li> <li>Ability to work with vague requirements.</li> <li>You are a team player who can collaborate effectively.</li> </ul><p></p><p><strong>It would be great if you also have:</strong></p><ul> <li>Experience with test automation frameworks.</li> <li>Experience with Kubernetes, helm charts, and ArgoCD or similar.</li> </ul><h3>Benefits: </h3><p></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance</li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><br><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"postgres\",\"javascript\",\"management\",\"database\",\"mysql\"]","pubDate":"2024-10-29 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/C26D140C16","savedDate":"2024-11-05 04:22:33.307","slug":"senior-python-full-stack-developer-django-focused-worldwide-remote-cloudlinux-7659"},{"id":2868086480,"title":"HR Intern (Immediate Hire) - Fully Remote","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>International Environment</li> <li>100% Remote</li> <li>Exposure to Diverse HR Functions</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>We are seeking a motivated and enthusiastic Human Resources Intern to join our HR team. This is a fantastic opportunity for a student or recent graduate who is looking to gain practical experience in a dynamic and fast-paced environment.</p><p>The HR Intern will assist with various HR tasks and projects, including recruitment, employee onboarding, HR administration, and employee engagement initiatives.</p><p><strong>What You Will Do</strong></p><ul> <li>Assist with recruitment activities, such as posting job ads, screening resumes, and scheduling interviews</li> <li>Support the onboarding process for new hires</li> <li>Assist with HR administrative tasks, including but not limited to maintaining employee records and updating HR databases</li> <li>Organize employee engagement initiatives and events</li> <li>Contribute to HR projects and process improvements</li> <li>Provide general HR support as needed</li> </ul><p><strong>What We Need</strong></p><ul> <li>Currently enrolled in a Bachelor's degree program in Human Resources, Business Administration, or a related field, or a recent graduate</li> <li>Strong organizational and time management skills</li> <li>Excellent communication and interpersonal skills</li> <li>Ability to maintain confidentiality and handle sensitive information</li> <li>Proficiency in Google Workspace</li> <li>Keen attention to detail</li> <li>Proactive and willing to take initiative</li> <li>Ability to work collaboratively in a team environment</li> <li>Positive attitude and eagerness to learn</li> <li>Must be based in the Philippines</li> </ul><p>Please be advised that this internship opportunity is unpaid</p><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Remote Setup</li> <li>International Environment</li> <li>Professional Development Opportunities</li> <li>Company activities and events</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"database\"]","pubDate":"2024-10-29 00:00:00.000","link":"https://apply.workable.com/covergo/j/D3A1B3EE92","savedDate":"2024-11-05 04:22:33.309","slug":"hr-intern-immediate-hire-fully-remote-covergo-7680"},{"id":5573611743,"title":"Motion Graphics Designer","company":"WebFX","image":"https://media.licdn.com/dms/image/C4E0BAQEaJsLubyO-AA/company-logo_200_200/0/1630591240152/webfxinc_logo?e=2147483647&v=beta&t=mkc8r0aeeGBHIC7BLKk7r18oCDh3xnykU31_6dhVPdQ","description":"<div>WebFX is a proud Google Premier Partner with 5 offices in the US as well as one in Guatemala and another in Cape Town, South Africa! We are continuing to expand worldwide and would love for you to be a part of that! In fact, we doubled in size in the past 5 years and are projecting to once again double in size and be a global, publicly traded tech company by the year 2030 - operating in every continent, servicing clients globally. We currently have talented team members across the globe (representing 18+ Countries) who work full time and have done so for 10+ years.</div><div><br></div><div><span style=\"font-size: 11pt\">No matter where you’re located, we’d love to have you join our mission of providing world-class digital marketing solutions to mid-size businesses on a global scale. We thrive on driving business growth for our clients and are looking for people who take pride in their marketing efforts and enjoy having fun at the same time. Sound like you? Great! Keep reading:</span></div><div><br></div><div><span style=\"font-size: 24px\">Why Choose WebFX</span></div><div><br></div><div>We've been named the #1 best place to work in our headquarter's home state of Pennsylvania for 8 years in a row and offer the same culture and benefits to our global team members. Along with a very competitive base pay, we offer company profit sharing, performance bonuses, On-going learning bonuses (yes, you get paid to learn!) and time zone differential pay. World class digital marketing training (Organic SEO, Local SEO, PPC, Google analytics + Studio, etc), long term career track, Health Insurance (including dental, vision, remote doctor, etc), and there's seriously a ton of other benefits! To name just a few:</div><div><br></div><div>- If you’re located in one of our operating countries (Guatemala or South Africa), this is a Full-time (non-contract based) position. Either way, WebFX offers long term stability to all of our FXFamily members. In fact, many of our global team members have been with WebFX for 9+ years and we’re hopeful you can be too!&nbsp;</div><div>- We put our people first, it’s as simple as that. You’re never on your own - when you run into inevitable challenges, we’re there to support you along the way!</div><div>- Long-lasting relationships with both clients and team members due to consistently low turnover rates that are simply unheard of in our industry, because again, we put our people first.</div><div>- Fully equipped in-home office setup including computer, dual large monitors, headset, seriously fast internet, generator and more! 🖥️</div><div>- Multiple schedule options from which to choose. Depending on the hours you select, you will receive additional pay for overlapping our hours!&nbsp;<span style=\"font-size: medium\">💰</span></div><div>- Be part of a rapidly growing company that at the same time only partners with clients who share our values🌱📈</div><div>- Unrestricted access to our dozens of proprietary softwares/platforms our internal R&amp;D team has developed for our team’s exclusive use, in addition to access to the many 3rd party tools and softwares we utilize internally in order to WOW our clients.<a class=\"postings-link\" href=\"https://www.webfx.com/marketingcloudfx/\">&nbsp;You can learn more about just some of our proprietary tools here</a>!</div><div>- Merit-based promotional structure</div><div>-&nbsp;<span style=\"font-size: 11pt\">We have a very strong commitment to giving back globally - in fact, it’s one of our values here at WebFX. As a member of our FXFamily, you get to be a large part of that simply by achieving your goals - since 2014, we’ve committed to donating globally through our FXBuilds program.&nbsp;</span><a class=\"postings-link\" style=\"font-size: 11pt\" href=\"https://www.webfx.com/about/fxbuilds/\">You can learn more about that here</a><span style=\"font-size: 11pt\">!</span></div><div><br></div><div><span style=\"font-size: 16pt\">What We’re Looking For</span></div><div><b style=\"font-size: 11pt\">Desired Skills</b></div><div><span style=\"font-size: 11pt\">Seasoned with animation and the design of motion graphics and visual effects</span></div><div><span style=\"font-size: 14.6667px\">Knowledgeable</span><span style=\"font-size: 11pt\"> of production and post-production processes</span></div><div><span style=\"font-size: 11pt\">Cultivates a current understanding of social media platforms, particularly with video content</span></div><div><span style=\"font-size: 11pt\">Experience crafting and interpreting storyboards and scripts</span></div><div><span style=\"font-size: 11pt\">Capable of utilizing video tools such as Vyond &amp; Adobe Creative Suite to animate, design and edit visual content. </span></div><div><span style=\"font-size: 11pt\">Other useful applications include Photoshop, After Effects and Vyond.</span></div><div><span style=\"font-size: 11pt\">Effective at adjusting lighting, audio and color in the editing stage</span></div><div><span style=\"font-size: 11pt\">Proficient with video formatting, compression, aspect ratios and frame rates</span></div><div><br></div><div><b style=\"font-size: 11pt\">Qualities</b></div><div><span style=\"font-size: 11pt\">Spirited interest in creative storytelling, design and animation</span></div><div><span style=\"font-size: 11pt\">Sense of color, composition and visual style</span></div><div><span style=\"font-size: 11pt\">Sharp eye for detail</span></div><div><span style=\"font-size: 11pt\">Curiosity to experiment and push boundaries</span></div><div><br></div><div><br></div><div><span style=\"font-size: 16pt\">What You’ll Do</span></div><div><br></div><div><b style=\"font-size: 11pt\">Responsibilities</b></div><div><span style=\"font-size: 11pt\">Draft and build digital storyboards</span></div><div><span style=\"font-size: 11pt\">Translate storyboards into engaging and creative visuals</span></div><div><span style=\"font-size: 11pt\">Develop and design high-quality animations and 3D motion graphics</span></div><div><span style=\"font-size: 11pt\">Match striking visuals with voice-over scripts&nbsp;</span></div><div><span style=\"font-size: 11pt\">Execute ideas through Adobe Suite and other editing applications</span></div><div><span style=\"font-size: 11pt\">Color-correct and color-grade content</span></div><div><span style=\"font-size: 11pt\">Enhance sound quality in post-production editing processes&nbsp;&nbsp;</span></div><div><span style=\"font-size: 11pt\">Collaborate with various team members to deliver captivating and informative visual content</span></div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">What You'll Get</span></div><div><br></div><div><span style=\"font-size: 24px\">World-Class Training and Ongoing Career Development</span></div><div><br></div><div>- No matter your level of experience, our “Bootcamp” web marketing training program is provided for all new WebFX “family members” to learn, grow and develop in and out of the office with the hard skills necessary to be successful in their position.&nbsp;</div><div>- From training with our Sr Digital Marketers to access to countless industry-leading online training resources/courses/tutorials to getting experience with nearly 1,500+ different clients with various platforms, digital services and in every industry you can think of (and then some), our training program is simply unrivaled!</div><div>- Training doesn’t stop after your initial training period, we offer career development training and monthly Lunch-and-Learns with our state-of-the-art training amenities to facilitate departmental trainings, industry-related updates, and more!</div><div>- FXLearns program – where you get incentives for taking advantage of our countless industry training resources</div><div>- After 1,500+ clients, we’ve been able to truly master our processes and procedures – you will be trained on all of those - no need to develop how to do things (unless you want to help us continually improve that process!) – because we refuse to ever stagnate, we are always pushing the envelope to make those processes 1% better too!&nbsp;</div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">Opportunities for Growth</span></div><div><br></div><div>WebFX grew 250%+ over the past 3 years both locally and globally, and merit-based promotional opportunities are abundant if you're meeting or exceeding position performance metrics. We believe in growing and promoting our internal team first and foremost. In fact, 95% of our promotions are internal! All team members have a very clearly defined progression path, so you know exactly what is expected of you so you can put your career in your own hands. And what’s more, you’re not expected to know it all - we believe in continually striving to be an expert in your subject matter of expertise – so while we will purposely challenge you to grow in SEO/PPC/Google Analytics, we are a full service agency that has experts in other departments that handle everything else - from link building, social media, web design and web development. So you can truly master your trade.</div><div><br></div><div>Our goal is to hire on 50+ team members over the next 36 months in South Africa, and we've recently opened our office in Cape Town to help us achieve this goal.</div><div><br></div><div><br></div><div><br></div><div><br></div><div><br></div><div><br></div><div>WebFX is a proud Google Premier Partner with 5 offices in the US as well as one in Guatemala and another in Cape Town, South Africa! We are continuing to expand worldwide and would love for you to be a part of that! In fact, we doubled in size in the past 5 years and are projecting to once again double in size and be a global, publicly traded tech company by the year 2030 - operating in every continent, servicing clients globally. We currently have talented team members across the globe (representing 18+ Countries) who work full time and have done so for 10+ years.</div><div><br></div><div><span style=\"font-size: 11pt\">No matter where you’re located, we’d love to have you join our mission of providing world-class digital marketing solutions to mid-size businesses on a global scale. We thrive on driving business growth for our clients and are looking for people who take pride in their marketing efforts and enjoy having fun at the same time. Sound like you? Great! Keep reading:</span></div><div><br></div><div><span style=\"font-size: 24px\">Why Choose WebFX</span></div><div><br></div><div>We've been named the #1 best place to work in our headquarter's home state of Pennsylvania for 8 years in a row and offer the same culture and benefits to our global team members. Along with a very competitive base pay, we offer company profit sharing, performance bonuses, On-going learning bonuses (yes, you get paid to learn!) and time zone differential pay. World class digital marketing training (Organic SEO, Local SEO, PPC, Google analytics + Studio, etc), long term career track, Health Insurance (including dental, vision, remote doctor, etc), and there's seriously a ton of other benefits! To name just a few:</div><div><br></div><div>- If you’re located in one of our operating countries (Guatemala or South Africa), this is a Full-time (non-contract based) position. Either way, WebFX offers long term stability to all of our FXFamily members. In fact, many of our global team members have been with WebFX for 9+ years and we’re hopeful you can be too!&nbsp;</div><div>- We put our people first, it’s as simple as that. You’re never on your own - when you run into inevitable challenges, we’re there to support you along the way!</div><div>- Long-lasting relationships with both clients and team members due to consistently low turnover rates that are simply unheard of in our industry, because again, we put our people first.</div><div>- Fully equipped in-home office setup including computer, dual large monitors, headset, seriously fast internet, generator and more! 🖥️</div><div>- Multiple schedule options from which to choose. Depending on the hours you select, you will receive additional pay for overlapping our hours!&nbsp;<span style=\"font-size: medium\">💰</span></div><div>- Be part of a rapidly growing company that at the same time only partners with clients who share our values🌱📈</div><div>- Unrestricted access to our dozens of proprietary softwares/platforms our internal R&amp;D team has developed for our team’s exclusive use, in addition to access to the many 3rd party tools and softwares we utilize internally in order to WOW our clients.<a href=\"https://www.webfx.com/marketingcloudfx/\" class=\"postings-link\">&nbsp;You can learn more about just some of our proprietary tools here</a>!</div><div>- Merit-based promotional structure</div><div>-&nbsp;<span style=\"font-size: 11pt\">We have a very strong commitment to giving back globally - in fact, it’s one of our values here at WebFX. As a member of our FXFamily, you get to be a large part of that simply by achieving your goals - since 2014, we’ve committed to donating globally through our FXBuilds program.&nbsp;</span><a href=\"https://www.webfx.com/about/fxbuilds/\" style=\"font-size: 11pt\" class=\"postings-link\">You can learn more about that here</a><span style=\"font-size: 11pt\">!</span></div><div><br></div><div><span style=\"font-size: 16pt\">What We’re Looking For</span></div><div><b style=\"font-size: 11pt\">Desired Skills</b></div><div><span style=\"font-size: 11pt\">Seasoned with animation and the design of motion graphics and visual effects</span></div><div><span style=\"font-size: 14.6667px\">Knowledgeable</span><span style=\"font-size: 11pt\"> of production and post-production processes</span></div><div><span style=\"font-size: 11pt\">Cultivates a current understanding of social media platforms, particularly with video content</span></div><div><span style=\"font-size: 11pt\">Experience crafting and interpreting storyboards and scripts</span></div><div><span style=\"font-size: 11pt\">Capable of utilizing video tools such as Vyond &amp; Adobe Creative Suite to animate, design and edit visual content. </span></div><div><span style=\"font-size: 11pt\">Other useful applications include Photoshop, After Effects and Vyond.</span></div><div><span style=\"font-size: 11pt\">Effective at adjusting lighting, audio and color in the editing stage</span></div><div><span style=\"font-size: 11pt\">Proficient with video formatting, compression, aspect ratios and frame rates</span></div><div><br></div><div><b style=\"font-size: 11pt\">Qualities</b></div><div><span style=\"font-size: 11pt\">Spirited interest in creative storytelling, design and animation</span></div><div><span style=\"font-size: 11pt\">Sense of color, composition and visual style</span></div><div><span style=\"font-size: 11pt\">Sharp eye for detail</span></div><div><span style=\"font-size: 11pt\">Curiosity to experiment and push boundaries</span></div><div><br></div><div><br></div><div><span style=\"font-size: 16pt\">What You’ll Do</span></div><div><br></div><div><b style=\"font-size: 11pt\">Responsibilities</b></div><div><span style=\"font-size: 11pt\">Draft and build digital storyboards</span></div><div><span style=\"font-size: 11pt\">Translate storyboards into engaging and creative visuals</span></div><div><span style=\"font-size: 11pt\">Develop and design high-quality animations and 3D motion graphics</span></div><div><span style=\"font-size: 11pt\">Match striking visuals with voice-over scripts&nbsp;</span></div><div><span style=\"font-size: 11pt\">Execute ideas through Adobe Suite and other editing applications</span></div><div><span style=\"font-size: 11pt\">Color-correct and color-grade content</span></div><div><span style=\"font-size: 11pt\">Enhance sound quality in post-production editing processes&nbsp;&nbsp;</span></div><div><span style=\"font-size: 11pt\">Collaborate with various team members to deliver captivating and informative visual content</span></div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">What You'll Get</span></div><div><br></div><div><span style=\"font-size: 24px\">World-Class Training and Ongoing Career Development</span></div><div><br></div><div>- No matter your level of experience, our “Bootcamp” web marketing training program is provided for all new WebFX “family members” to learn, grow and develop in and out of the office with the hard skills necessary to be successful in their position.&nbsp;</div><div>- From training with our Sr Digital Marketers to access to countless industry-leading online training resources/courses/tutorials to getting experience with nearly 1,500+ different clients with various platforms, digital services and in every industry you can think of (and then some), our training program is simply unrivaled!</div><div>- Training doesn’t stop after your initial training period, we offer career development training and monthly Lunch-and-Learns with our state-of-the-art training amenities to facilitate departmental trainings, industry-related updates, and more!</div><div>- FXLearns program – where you get incentives for taking advantage of our countless industry training resources</div><div>- After 1,500+ clients, we’ve been able to truly master our processes and procedures – you will be trained on all of those - no need to develop how to do things (unless you want to help us continually improve that process!) – because we refuse to ever stagnate, we are always pushing the envelope to make those processes 1% better too!&nbsp;</div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">Opportunities for Growth</span></div><div><br></div><div>WebFX grew 250%+ over the past 3 years both locally and globally, and merit-based promotional opportunities are abundant if you're meeting or exceeding position performance metrics. We believe in growing and promoting our internal team first and foremost. In fact, 95% of our promotions are internal! All team members have a very clearly defined progression path, so you know exactly what is expected of you so you can put your career in your own hands. And what’s more, you’re not expected to know it all - we believe in continually striving to be an expert in your subject matter of expertise – so while we will purposely challenge you to grow in SEO/PPC/Google Analytics, we are a full service agency that has experts in other departments that handle everything else - from link building, social media, web design and web development. So you can truly master your trade.</div><div><br></div><div>Our goal is to hire on 50+ team members over the next 36 months in South Africa, and we've recently opened our office in Cape Town to help us achieve this goal.</div><div><br></div><div><br></div><div><br></div><div><br></div><div><br></div><div><br></div>","tags":"[]","pubDate":"2024-10-28 16:12:09.598","link":"https://jobs.lever.co/webfx/e531f941-3b8b-4f5f-9d65-21227fc0621c","savedDate":"2024-11-05 04:22:33.315","slug":"motion-graphics-designer-webfx-7578"},{"id":4056609008,"title":"GIS Full Stack Engineer (Problem Solver)","company":"Xcellent Technology Solutions","image":"https://remotive.com/job/1946971/logo","description":"<p>Looking for the person who loves to generate solutions, combining GIS, Software Engineering, and AWS Cloud knowledge to provide complex code solutions for our client in Denver Colorado. The position is one of high importance and has traditionally been held as a career-building block for GIS-strong software engineers with exceptional critical thinking skills and the ability to solve complex coding problems in all 3 areas mentioned above. Xcellent Technology Solutions (XTS) is seeking a productive engineer with these skills to fit into a team of 8 supporting multiple innovation products at USGS with The National Map. The innovative pipeline includes user-derived solutions for their geospatial product needs. This is an ideal position for a creative problem solver who, while not needing to engage with customers, does need to solve the concerns presented by customers to the product owner.<br><br><br><strong>Requirements:</strong><br><br></p>\n<ul style=\"\">\n<li style=\"\">At a minimum, 4-6 years API design and implementation</li>\n<li style=\"\">Proficiency with AWS CodePipline and/or AWS Code Deploy or similar stack to automate, visualize, integrate, customize, and scale the software development within a CI/CD process</li>\n<li style=\"\">Python heavy Software Engineering is a major requirement, along with ability to work with Powershell and React</li>\n<li style=\"\">Understanding of the concepts of IaC (Infrastructure as Code) leveraging Terraform, AWS CloudFromation  or CDK; CAC (Configuration as Code) with Chef, Ansible, Puppet, or Powershell</li>\n<li style=\"\">As with most GIS Engineers needs to be highly fluent with ESRI suite of tools for developers and engineers</li>\n</ul>\n<p><br>Please be prepared to provide documented strong solution engineering and GIS experience or knowledge of GIS based on some prior life experience (not a dabbler, need to have coded GIS solutions).  Xcellent Technology Solutions is an employer of choice in the field of Geospatial solutions, we support both NGA and USGS with the absolute finest engineers and have a strong employee education program, work benefits , and this position has a great work/life balance. Please apply directly to this ad. This position can be full-time remote especially for the right candidate. </p>\n<img src=\"https://remotive.com/job/track/1946971/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"api\",\"AWS\",\"cloud\",\"fullstack\",\"python\",\"react\",\"CI/CD\",\"product owner\",\"terraform\",\"ansible\",\"infrastructure\"]","pubDate":"2024-10-28 06:51:41.000","link":"https://remotive.com/remote-jobs/software-dev/gis-full-stack-engineer-problem-solver-1946971","savedDate":"2024-11-05 04:22:33.303","slug":"gis-full-stack-engineer-problem-solver-xcellent-technology-solutions-8070"},{"id":3734987200,"title":"Full-Stack Developer with Work-Life Balance (JavaScript, Node.js, React)","company":"Spidergap","image":"https://remotive.com/job/1946972/logo","description":"<p>We’re recruiting a full-stack developer to join our product team at Spidergap/AirManual.</p>\n<p> </p>\n<p>This is a rare opportunity to join a small, 100% remote, profitable and ambitious company that also appreciates that there’s more to work than revenue (!).</p>\n<p> </p>\n<p>At Spidergap/AirManual, we’re:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Fueled by the passion and exceptional talent of a successful start-up</li>\n<li style=\"\">Hungry to amaze our customers and grow the business</li>\n<li style=\"\">Always looking to grow as individuals and a team</li>\n<li style=\"\">AND Focused on doing it all without unnecessary stress, and with a healthy work-life balance</li>\n</ul>\n<p> </p>\n<p>If you’re a software developer who moves quickly and values code quality, wants to grow by working in a small and experienced team, and loves helping real customers to achieve their goals… then read on!</p>\n<p> </p>\n<p>What we do</p>\n<p>We’re a SaaS business with two products: Spidergap and AirManual. You’ll be working primarily on Spidergap, with opportunities to contribute to both products.</p>\n<p> </p>\n<p>Spidergap</p>\n<p>With Spidergap, our goal is to make it easy for organizations to support the personal development of their employees. We do this by providing a platform for employees to get feedback, plan personal development, and take action.</p>\n<p> </p>\n<p>We’ve been the <a href=\"https://www.capterra.com/360-degree-feedback-software/\" rel=\"nofollow\">top-rated 360° Feedback tool since 2017</a>, and are used in 134+ countries by thousands of organizations including Samsung, 3M, Sony, the NHS, the European Commission, Breville, Konica Minolta and Philips.</p>\n<p> </p>\n<p>We’ve recently kicked off an ambitious plan to expand our product offering, as we look to support employees with all aspects of personal development. This includes a revamp of our product working in the latest technologies.</p>\n<p> </p>\n<p>AirManual</p>\n<p>We created AirManual in 2020 with the goal of helping other businesses to scale up, without constant stress. We provide tools for documenting and automating processes, working together in teams, and reviewing the health of the entire business.</p>\n<p> </p>\n<p>We’re now supporting over 100 businesses, including big names such as Asahi Beer and with particular traction in the Accountancy market. As with Spidergap, we consistently get <a href=\"https://www.capterra.com/p/235723/AirManual/\" rel=\"nofollow\">exceptionally positive reviews</a>.</p>\n<p> </p>\n<p>We’re currently expanding the AirManual product to support teams with wider challenges that cause stress in small businesses, such as managing the day-to-day issues that occur in teams.</p>\n<p><br><br><strong>Requirements</strong><br><br></p>\n<p>We’re looking for something who’s a great fit for our company values, and who can bring the technical talent needed in this specific role.</p>\n<p> </p>\n<p>Do you share our values?</p>\n<p>We're looking for people who share our values:</p>\n<p> </p>\n<ol style=\"\">\n<li style=\"\"><strong>Focus on impact: </strong>We know our growth is dependent on increasing the value we deliver to customers. We focus our energy on improvements that will make a real difference, with a desired outcome made clear up-front. We expect everyone to understand <em>why</em> they are working on a particular activity or objective, being clear on how it will benefit the business and our customers.</li>\n<li style=\"\"><strong>Be proactive and dependable: </strong>Everyone can solve problems and remove barriers to growth — both personally and for the company. We are quick to raise issues and ideas, and to recommend next steps. We make it easier for others to feel they can depend on us by being proactive in our communication and action.</li>\n<li style=\"\"><strong>Pay attention to detail: </strong>We believe the quality of everything we do is a competitive advantage. We expect high attention-to-detail, whether it's in how we write an email, review our analytics, or design the site. We delight in getting the details right, even in internal documents. High attention to detail isn’t something you turn on and off — it’s an attitude. </li>\n<li style=\"\"><strong>Always look to improve:</strong> We survive and grow by constantly looking for opportunities to improve our solutions, our processes and ourselves. We own our mistakes, using them as an opportunity to learn what changes we should make to processes and tools. We expect our people to proactively look for opportunities to develop and improve our own performance.</li>\n<li style=\"\"><strong>Enjoy the journey: </strong>We consider our health and families to be more important than work. We ensure no-one feels that they are frequently required to work excessive hours. We support each other in overcoming problems and achieving work and life goals. We’re positive and enthusiastic — helping everyone feel energized to take us to the next level. We don’t pin our happiness on the attainment of a particular end goal — we delight in each step along the way.</li>\n</ol>\n<p> </p>\n<p>We don’t just ‘say’ these are our values. We use them all the time — to recruit the right people, manage individual performance, recognize good practice, and make decisions. </p>\n<p> </p>\n<p>Is the role right for you?</p>\n<p>A large part of the work will be developing and supporting new functionality using TypeScript/NodeJS/React.</p>\n<p> </p>\n<p>We follow “clean\" code principles, agile processes and continuous integration tools to efficiently take features from concept to roll-out, and to continuously optimize our processes. Your attention to detail will help us to amaze our customers, and to grow our services and codebase in a robust and maintainable way.</p>\n<p> </p>\n<p><strong>Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Collaborate to deliver solutions from design to release</li>\n<li style=\"\">Write reliable, modular, well-tested and “clean” code</li>\n<li style=\"\">Proactively raise ideas and issues, contributing to designs with feedback and suggestions for improvement</li>\n<li style=\"\">Support other team members through peer review</li>\n<li style=\"\">Help to optimize our development processes and build tools</li>\n<li style=\"\">Ensure progress, issues and ideas are communicated clearly to the right people</li>\n<li style=\"\">Help us to deliver outstanding customer support.</li>\n</ul>\n<p> </p>\n<p><strong>Tech stack (Spidergap):</strong></p>\n<ul style=\"\">\n<li style=\"\">TypeScript</li>\n<li style=\"\">Node.js (NestJS)</li>\n<li style=\"\">Remix (React)</li>\n<li style=\"\">MySQL</li>\n<li style=\"\">Google Cloud</li>\n</ul>\n<p> </p>\n<p>AirManual uses a similar tech stack, using PostgresSQL rather than MySQL and currently reviewing whether to adopt Remix + TypeScript.</p>\n<p>You may be occasionally asked asked to support legacy solutions developed with Express, Create React App, AngularJS, Loopback, and PHP.</p>\n<p> </p>\n<p><strong>Tools:</strong></p>\n<ul style=\"\">\n<li style=\"\">GitHub</li>\n<li style=\"\">Slack</li>\n<li style=\"\">Codeship</li>\n<li style=\"\">Dropbox Paper</li>\n<li style=\"\">GMail</li>\n<li style=\"\">Hubspot</li>\n<li style=\"\">Sentry</li>\n<li style=\"\">(And many more!)</li>\n</ul>\n<p> </p>\n<p><strong>Requirements:</strong></p>\n<ul style=\"\">\n<li style=\"\">Passionate and driven — about software development, and about life outside work</li>\n<li style=\"\">Excellent attention to detail, including a focus on delivering high-quality code that is easy to maintain and scale</li>\n<li style=\"\">2+ years of JavaScript experience, working on production code</li>\n<li style=\"\">Experience with front-end libraries in production such as React or Vue</li>\n<li style=\"\">Experience with React, SQL, HTML, CSS and automated testing</li>\n<li style=\"\">Happy to work remotely</li>\n<li style=\"\">Loves 'going the extra mile' to deliver outstanding work</li>\n<li style=\"\">Believes in and practices self-improvement / personal development</li>\n<li style=\"\">Keen and able to learn</li>\n<li style=\"\">Loves technology and figuring out how things work and helping others to do the same</li>\n<li style=\"\">Communicates clearly, in a friendly way</li>\n</ul>\n<p> </p>\n<p><strong>Location:</strong></p>\n<ul style=\"\">\n<li style=\"\">This is a 100% remote job — you are responsible for having an effective work environment</li>\n<li style=\"\">You must be a location that overlaps the working hours of our existing team members — we will only accept applications in timezones from UTC -4 (New York) to UTC +6 (Dhaka)</li>\n<li style=\"\">Due to local employment and/or international laws, we cannot currently employ people based in Brazil, France, or UAE.</li>\n</ul>\n<p><br><br><strong>Benefits</strong><br><br></p>\n<p>We strive to make Spidergap <em>the</em> best place to work.</p>\n<p> </p>\n<p>We are doing this by creating the best products in our markets, building a great diverse team, encouraging great work-life balance (including taking lots of annual leave), being family-friendly, having fun, and maintaining a strong culture of continuous improvement (business and personally).</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\"><em>“Working at Spidergap has been a huge quality of life upgrade”</em></li>\n<li style=\"\"><em>“This company truly works as a TEAM. The co-founders have brought together a top-notch group of A players who work together seamlessly.”</em></li>\n<li style=\"\"><em>“This is the best work-week I have ever had. I love it here.”</em></li>\n</ul>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Benefits:</p>\n<ul style=\"\">\n<li style=\"\"><strong>Competitive salary. </strong>We calculate a competitive salary that represents the typical salary (50th percentile) for your role, experience and location. This is typically in the range of GBP £45k–£70k / USD $45k–$90k.</li>\n<li style=\"\"><strong>Profit share bonus</strong>, paid annually. Based on company profit and individual performance (reviewed throughout the year, not just at the end!).</li>\n<li style=\"\"><strong>40 days paid vacation</strong> inclusive of public holidays. We’ll make sure you take them!</li>\n<li style=\"\"><strong>Work remotely.</strong> As long as your internet connection is excellent and you’re able to collaborate when needed, you’re free to work from any location you wish.</li>\n<li style=\"\"><strong>Flexible working. </strong>You’ll need some set hours in which to collaborate with the team, but we’ll do our best to be flexible so you can support your family, friends and/or hobbies!</li>\n<li style=\"\"><strong>Annual all-staff meet-up. </strong>Previous locations: Iceland, Barcelona, Berlin, Athens, Edinburgh, Budapest.</li>\n<li style=\"\"><strong>4 months paid maternity/paternity</strong> <strong>leave.</strong></li>\n<li style=\"\"><strong>Family-friendly work environment.</strong> Both co-founders work from home and have young children so we understand the challenges and what helps!</li>\n<li style=\"\"><strong>Health membership contribution — </strong>you can use this to pay for the gym or an equivalent activity.</li>\n<li style=\"\"><strong>Bring your own device contribution. </strong>We’ll make sure you have the equipment you need to work efficiently.</li>\n<li style=\"\"><strong>Pension contribution. </strong>Typically 10%, depending on country laws.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1946972/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"cloud\",\"CSS\",\"fullstack\",\"html\",\"javascript\",\"node.js\",\"php\",\"react\",\"saas\",\"sql\",\"agile\",\"analytics\",\"Typescript \",\"google cloud\",\"MySQL\",\"hubspot\",\"testing\",\"github\"]","pubDate":"2024-10-28 06:49:38.000","link":"https://remotive.com/remote-jobs/software-dev/full-stack-developer-with-work-life-balance-javascript-node-js-react-1946972","savedDate":"2024-11-05 04:22:33.303","slug":"full-stack-developer-with-work-life-balance-javascript-node-js-react-spidergap-4095"},{"id":4348292329,"title":"Principal Content Manager, UX","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt;\">As a </span><b style=\"font-size: 11pt;\">Principal Content Manager, User Experience</b><span style=\"font-size: 11pt;\"> at Airalo, your role involves close collaboration with the User Experience, Brand, and Regional divisions. You'll apply best practices to scale blog and social content, implementing SEO and ASO strategies. Your responsibilities extend to developing and monitoring various content channels, utilizing analytic tracking tools. Your strategic mindset will be crucial in identifying opportunities to enhance Airalo's brand awareness, boost conversion rates, and improve organic visibility across channels. You’ll support the shaping of a compelling content strategy that resonates and drives impactful results.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">You'll collaborate with multiple Regional Content Managers, spearheading the outsourcing of content translations across a wide range of markets. Your responsibility will extend to overseeing the seamless rollout of multiple languages. As the key driver, you'll take ownership of the entire content process for all assigned countries / languages, guiding it from the creative stage through testing and reporting. Your role is integral to ensuring a robust and effective content strategy, with a direct impact on stakeholders and the successful expansion of our global presence.</span></div><h3>Responsibilities include but aren't limited to </h3><li>Collaborate directly with the <b>Director of Growth, User Experience</b> to develop content strategies, operating procedures, and standards aligning with Airalo's objectives.</li><li>Maintain an editorial calendar in coordination with the Global and Regional teams.</li><li>Work with Airalo Growth divisions to publish and modify blogs and other content, ensuring optimized styles and layouts.</li><li>Optimize content for SEO and ASO, aligning with search engine and app store optimization goals.</li><li>Analyze website traffic and user engagement metrics, providing recommendations and establishing Global benchmarks, goals and KPIs</li><li>Collaborate with cross-functional teams to ensure content aligns with business objectives, brand identity, and user requirements.</li><li>Manage content distribution across online channels and social media platforms, enhancing volumes of Organic traffic.</li><li>Stay updated on company-wide developments, generating new ideas and utilizing multimedia for rich content to position Airalo as a thought leader.</li><li>Steer voice and tone standards documentation with Brand team, ensuring all content is the right mix of engaging, informative and entertaining.</li>,<h3>Must Haves:</h3><li>Bachelor’s degree with 9+ years of demonstrated success in Content, SEO, and ASO within the realm of a large B2C and B2B2C audience</li><li>Proven experience in managing content across diverse markets, overseeing multiple languages, with effective outsourcing strategies</li><li>Experience in creating multimedia content, including blog, podcast, social, and video production</li><li>Exceptional expertise in SEO and ASO channel management, encompassing best practicesStrong grasp of web/mobile app campaign measurement and attribution</li><li>Proficiency in keyword research with excellent analytical skills, including experience in crafting app descriptions and titles using researched keywords to enhance performance</li><li>Proven ability to implement comprehensive operational procedures and standards to drive organizational objectives effectively.</li><li>Analytical mindset with the ability to spot patterns and trends using the latest app analytics tools, including experience with analytics tools and/or other market research tools, e.g., SEMrush, Ahrefs.</li><li>Proficient in using AI-driven tools to optimize content creation, distribution, and performance through automated insights and recommendations.</li><li>Fluency in English, with impeccable verbal and written communication skills</li>,<h3>Nice to haves:</h3><li>Understanding of UX copywriting and technical content</li><li>Ability to assess campaign performance, identify consumer behavior and creative opportunities, and manage cost-per-acquisition targets</li><li>Experience working on international brands</li><li>Experience working on cross-functional teams in an agile environment</li><li>Experience in the travel industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>Proficiency in multiple languages is a big asset, including but not limited to French, Arabic, Spanish, Mandarin or other.</li><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-10-22 17:12:17.147","link":"https://jobs.lever.co/airalo/2aef3950-7ad0-4aab-83d0-0af98a547fa4","savedDate":"2024-11-05 04:22:33.311","slug":"principal-content-manager-ux-airalo-1977"},{"id":9393444737,"title":"Senior General Ledger Specialist","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt;\">Airalo is seeking a GL pro to join our Finance team. Our finance team plays the huge role of ensuring the accurate and timely recording of finance information to assist the company in making strategic decisions.&nbsp; As Senior General Ledger Specialist at Airalo, you will be responsible for managing and overseeing all aspects of the general ledger accounting process, ensuring the accurate and timely recording of financial transactions and seeking ways to drive improvements and efficiencies to make your mark.&nbsp; </span></div><h3>Responsibilities include but are not limited to:</h3><li>Maintain and reconcile the general ledger accounts on a timely basis as well as, the preparation and posting of journal entries, accruals, and prepayments.</li><li>Manage the month-end and year-end close processes, ensuring deadlines are met and identify areas for improvement and efficiencies.</li><li>Generate and analyze financial reports, providing insights to support decision-making.</li><li>Reconcile balance sheet accounts, including bank reconciliations.</li><li>Investigate and resolve discrepancies, collaborating with other departments as needed.</li><li>Ensure compliance with accounting policies, procedures, and regulatory requirements.</li><li>Stay informed about changes in accounting standards and implement updates as necessary.</li><li>Collaborate with other departments to obtain necessary information and support financial reporting and management of statutory and internal audits.</li><li>Provide assistance to other finance team members as needed, including accounts receivable and accounts payable functions and, Mentor and provide guidance to junior accounting staff as needed.</li>,<h3>Must Haves</h3><li>Bachelor's degree in Accounting, Finance, or related field (with an accounting qualification (ACA, ACCA, etc)</li><li>5+ years of experience in general ledger accounting or a similar role.</li><li>Strong knowledge of accounting principles (GAAP/IFRS) and financial reporting.</li><li>Excellent analytical and problem-solving skills with high attention to detail.</li><li>Ability to collaborate effectively with cross-functional teams and manage multiple priorities.</li><li>Strong communication skills and the ability to meet tight deadlines.</li><div><span style=\"font-size: 11pt;\">If you are interested in this position, please apply via the link.</span></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-10-07 08:58:34.177","link":"https://jobs.lever.co/airalo/15a72ba6-cfa0-498c-aad9-9737bb48a14d","savedDate":"2024-11-05 04:22:33.311","slug":"senior-general-ledger-specialist-airalo-5266"}]