[{"id":9698819870,"title":"Implementation Specialist (6-Month Contract, Potential for Extension)","company":"OneLocal","image":"https://photos.wellfound.com/startups/i/257661-3abe9f68928f2e0407dca967aca86e67-medium_jpg.jpg","description":"&lt;p&gt;OneLocal is a leading provider of AI-powered digital marketing solutions for small and medium-sized businesses (SMBs). Our cloud-based platform offers a suite of interconnected tools - covering websites, SEO, reviews, advertising, social media, and more - to help SMBs streamline operations and enhance customer communication. By leveraging structured and unstructured data, we automate client interactions, generate engaging content, and optimize information workflows.&lt;/p&gt;\n&lt;p&gt;We’re looking for an &lt;strong&gt;Implementation Specialist&lt;/strong&gt; to join our team on a &lt;strong&gt;6-month contract, with the possibility of extension&lt;/strong&gt;. The ideal candidate is customer-centric, proactive, and eager to contribute to a fast-growing technology company. If you&#39;re seeking a role that’s both challenging and rewarding, this opportunity is for you.&lt;/p&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;&lt;strong&gt;What You’ll Be Doing&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensure seamless onboarding for new clients, providing guidance from contract signing to platform adoption.&lt;/li&gt;\n&lt;li&gt;Gather client requirements to support website development and digital marketing setup.&lt;/li&gt;\n&lt;li&gt;Assist clients in accessing their social media platforms and setting up necessary credentials.&lt;/li&gt;\n&lt;li&gt;Independently manage multiple client activation projects, ensuring smooth execution.&lt;/li&gt;\n&lt;li&gt;Proactively identify and address potential roadblocks to optimize the client experience.&lt;/li&gt;\n&lt;li&gt;Educate clients on our full suite of marketing tools to maximize their platform usage.&lt;/li&gt;\n&lt;li&gt;Maintain ongoing client communication, reporting updates to internal and external stakeholders.&lt;/li&gt;\n&lt;li&gt;Mitigate project risks to ensure timely, on-budget execution.&lt;/li&gt;\n&lt;li&gt;Prepare training materials and project documentation to support client success.&lt;/li&gt;\n&lt;li&gt;Contribute to best practices, methodologies, and process improvements.&lt;/li&gt;\n&lt;li&gt;Troubleshoot and resolve client issues, collaborating with internal teams and occasionally providing after-hours support when necessary.&lt;/li&gt;\n&lt;li&gt;Encourage clients to think strategically about their marketing goals, handling objections that may hinder project completion.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;&lt;strong&gt;Essential Qualifications &amp;amp; Experience&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;2+ years of experience as an Implementation or Onboarding Specialist in a customer-facing role.&lt;/li&gt;\n&lt;li&gt;Strong verbal and written communication skills.&lt;/li&gt;\n&lt;li&gt;Ability to manage multiple projects in a fast-paced environment with shifting priorities.&lt;/li&gt;\n&lt;li&gt;Experience in customer success, project management, or client onboarding.&lt;/li&gt;\n&lt;li&gt;Ability to assess customer needs and align them with our product offerings.&lt;/li&gt;\n&lt;li&gt;Strong relationship-building skills, fostering long-term client partnerships.&lt;/li&gt;\n&lt;li&gt;Demonstrated professionalism, integrity, and problem-solving skills.&lt;/li&gt;\n&lt;li&gt;Highly organized with strong follow-up abilities.&lt;/li&gt;\n&lt;li&gt;Understanding of digital marketing principles, including SEO, social media, and online advertising.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;&lt;strong&gt;Desirable Skills &amp;amp; Experience&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience working with small and medium-sized businesses.&lt;/li&gt;\n&lt;li&gt;Background in SaaS, marketing agencies, or tech startups.&lt;/li&gt;\n&lt;li&gt;Proficiency in SEO, Google Analytics, and Google Business Profile.&lt;/li&gt;\n&lt;li&gt;Knowledge of Google Ads and Facebook Ads.&lt;/li&gt;\n&lt;li&gt;Experience with website platforms such as Duda, WordPress, or Shopify.&lt;/li&gt;\n&lt;li&gt;Familiarity with CRM platforms (preferably Salesforce).&lt;/li&gt;\n&lt;li&gt;Proficiency in project management tools (e.g., Jira).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;&lt;strong&gt;Why You’ll Love Working Here&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Make a real impact at a growing company that helps SMBs enhance their digital presence.&lt;/li&gt;\n&lt;li&gt;Remote-first culture with the option to access co-working spaces.&lt;/li&gt;\n&lt;li&gt;Engaging virtual social events, including coffee chats and weekly happy hours.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;At OneLocal, we are committed to building and fostering an environment where our employees feel included, valued, and heard. Our belief is that a strong commitment to diversity and inclusion enables us to truly create the best company culture possible. We strongly encourage applications from candidates of all backgrounds, experience, and perspectives regardless of race, gender, sexual orientation, marital status, age, citizenship, disability, and national origin.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;","tags":"[\"management\"]","pubDate":"2025-03-07T21:17:51.000Z","link":"https://boards.greenhouse.io/onelocal/jobs/4018835004","slug":"implementation-specialist-6-month-contract-potential-for-extension-onelocal-8050"},{"id":4535015661,"title":"Senior Full-stack Engineer (CRM)","company":"Circle","image":"https://media.licdn.com/dms/image/v2/D4E0BAQGsuyBYT8Wy1A/company-logo_200_200/company-logo_200_200/0/1709246393415/circleco_logo?e=1746662400&v=beta&t=KH2t1NJ7bcXknchnvYTCh2X0_q0BdXf-vERJqIz2p1k","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;About Us&lt;/h2&gt;\n&lt;p&gt;Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.&lt;/p&gt;\n&lt;p&gt;We’re proud to be a fully remote company of around 180 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don&#39;t track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.&lt;/p&gt;\n&lt;p&gt;Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, Italy, Ireland, and more, with still more to come!&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;In October 2024, our team released an exciting new extension of Circle: Marketing Hub. We&#39;re now looking to expand the Marketing Hub team with a new Senior Full-stack engineer as we aim to make Circle the top choice for creator/brand-led communities. You&#39;ll be working on features related to CRM, marketing, member sign-up/authentication, and workflows.&lt;/p&gt;\n&lt;p&gt;In this role, you will partake in all stages of the development lifecycle, from initial task definition to final deployment. As a senior engineer, you&#39;ll break down large epics into actionable tasks, follow through with development and testing, review PRs, push updates to production, and gradually release behind feature flags. Your responsibilities will also include bug-fixing and continuous improvement of the codebase. This role requires a high level of technical proficiency and a strong understanding of software development best practices.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Note, we have a strong preference for candidates in North/South America time zones.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;h2&gt;What you&#39;ll be doing&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work autonomously on a product built in Ruby on Rails backend and React front-end.&lt;/li&gt;\n&lt;li&gt;Build critical features and improvements for our web app and APIs with a product-first mindset.&lt;/li&gt;\n&lt;li&gt;Work closely with Circle&#39;s leaders throughout the feature design process.&lt;/li&gt;\n&lt;li&gt;Work closely with our designers to create a world-class user experience.&lt;/li&gt;\n&lt;li&gt;Foster a bias for action, prioritizing speed of iteration without compromising on the quality of code or user experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What you&#39;ll need to be successful&lt;/h2&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong alignment with our values, &lt;a href=&quot;https://circle.so/careers&quot;&gt;find our values on our career page&lt;/a&gt; if you haven’t read up on them yet&lt;/li&gt;\n&lt;li&gt;You are proficient in English (spoken, written, and reading) at a &lt;a href=&quot;https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/&quot;&gt;CEFR Level C2&lt;/a&gt; / &lt;a href=&quot;https://www.govtilr.org/&quot;&gt;ILR Level 5&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;6+ years experience working as a full-stack engineer on complex web applications.&lt;/li&gt;\n&lt;li&gt;Strong proficiency in &lt;strong&gt;Ruby on Rails, MySQL/Postgresql, ReactJS, TypeScript, CSS&lt;/strong&gt; and &lt;strong&gt;TailwindCSS.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Familiarity with both frontend and backend is necessary, but high degree of proficiency on the front-end is not a requirement. You should be able to individually build most small to medium features end-to-end across the stack, but you excel in working with Ruby on Rails.&lt;/li&gt;\n&lt;li&gt;A desire to work in an environment which values speed of iteration and individual autonomy, while also embracing personal accountability and the ability to collaborate effectively as part of a dynamic team.&lt;/li&gt;\n&lt;li&gt;Motivation to understand the business, our users, their requirements, and to deliver results.&lt;/li&gt;\n&lt;li&gt;Comfortable in a fast-paced environment with a certain level of ambiguity.&lt;/li&gt;\n&lt;li&gt;Adaptable with the ability to change direction quickly if necessary.&lt;/li&gt;\n&lt;li&gt;Familiar with agile software development principles.&lt;/li&gt;\n&lt;li&gt;Should be able to lead a complex project end to end with judgment and an attention to detail when it comes to architectural, product, design, and process decisions, your judgment should inspire a high level of trust within the team.&lt;/li&gt;\n&lt;li&gt;Experience working on a fully distributed remote team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Bonus points&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience with Elastic Search / Clickhouse / Sidekiq / Kafka / AI APIs.&lt;/li&gt;\n&lt;li&gt;Previous experience working with community platforms.&lt;/li&gt;\n&lt;li&gt;Experience working on CRM tools, workflow automation solutions, authentication providers or in the creator space.&lt;/li&gt;\n&lt;li&gt;Experience at a fast-growing start-up.&lt;/li&gt;\n&lt;li&gt;A track record of picking up new technologies and skills as you ship high-quality code.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;$130,000 - $140,000 USD per year&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;The fun stuff&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully remote:&amp;nbsp;work from anywhere in the world!&lt;/li&gt;\n&lt;li&gt;Autonomy and trust to do your job:&amp;nbsp;we care about outcomes over everything else.&lt;/li&gt;\n&lt;li&gt;Paid time away:&amp;nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.&lt;/li&gt;\n&lt;li&gt;Generous U.S. benchmarked compensation&amp;nbsp;and startup equity no matter where you are in the world.*&lt;/li&gt;\n&lt;li&gt;Awesome medical coverage&amp;nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*&lt;/li&gt;\n&lt;li&gt;Parental leave&amp;nbsp;for parents expanding their family, or just starting one.&lt;/li&gt;\n&lt;li&gt;Home office stipend&amp;nbsp;to help you get up and running.&lt;/li&gt;\n&lt;li&gt;Learning &amp;amp; development stipend&amp;nbsp;to help you level up your professional skills.&lt;/li&gt;\n&lt;li&gt;Annual bonus potential&amp;nbsp;for roles that don&#39;t already receive variable income or commission.&lt;/li&gt;\n&lt;li&gt;Company retreats:&amp;nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.&lt;/li&gt;\n&lt;li&gt;Check out our&amp;nbsp;&lt;a href=&quot;https://careers.circle.so/&quot;&gt;Careers&lt;/a&gt;&amp;nbsp;page for more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;*&lt;em&gt;Your role, location and unique circumstance may affect this.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Diversity, Equity &amp;amp; Inclusion&lt;/h3&gt;\n&lt;p&gt;As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&amp;nbsp;U.S. benchmarked&amp;nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.&lt;/p&gt;\n&lt;h3&gt;Equal Employment Opportunity&lt;/h3&gt;\n&lt;p&gt;Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.&amp;nbsp;If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.&lt;/p&gt;\n&lt;div class=&quot;&quot;&gt;\n&lt;h3 class=&quot;&quot;&gt;How We Use Candidate Data&lt;/h3&gt;\n&lt;p&gt;At Circle, we are committed to protecting your personal information. As a job applicant, the personal data you provide to us is collected and processed in accordance with the&amp;nbsp;&lt;strong&gt;General Data Protection Regulation (GDPR)&lt;/strong&gt; in the EU and the &lt;strong&gt;California Consumer Privacy Act (CCPA)&lt;/strong&gt;. This notice outlines the types of personal information we collect, the purpose for collecting it, and your rights.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information We Collect:&lt;/strong&gt; We collect the following categories of personal information from job applicants:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contact information (such as name, email address, phone number)&lt;/li&gt;\n&lt;li&gt;Employment history and qualifications&lt;/li&gt;\n&lt;li&gt;Education history&lt;/li&gt;\n&lt;li&gt;References and any other information you choose to share with us during the application process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Purpose of Collection:&lt;/strong&gt; We collect this information for the following purposes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assess your qualifications and suitability for the position&lt;/li&gt;\n&lt;li&gt;To communicate with you during the recruitment process&lt;/li&gt;\n&lt;li&gt;To comply with legal and regulatory obligations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Rights Under GDPR and CCPA:&lt;/strong&gt; You have the following rights regarding your personal information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The right to request access to the personal information we hold about you.&lt;/li&gt;\n&lt;li&gt;The right to request the deletion of your personal information, subject to certain legal exceptions.&lt;/li&gt;\n&lt;li&gt;The right to opt out of the sale of your personal information (Note: We do not sell personal information).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information about how we handle your personal data or to exercise your rights, please refer to our full &lt;a href=&quot;https://circle.so/privacy&quot; target=&quot;_blank&quot;&gt;Privacy Policy&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;By submitting your application, you acknowledge that you have read and understood this privacy notice.&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;","tags":"[\"postgres\",\"typescript\",\"legal\",\"mysql\",\"aws\"]","pubDate":"2025-03-07T20:54:46.000Z","link":"https://job-boards.greenhouse.io/circleso/jobs/4572831008","slug":"senior-full-stack-engineer-crm-circle-3419"},{"id":8990823542,"title":"Freelance Social Media and Content Manager","company":"OneLocal","image":"https://photos.wellfound.com/startups/i/257661-3abe9f68928f2e0407dca967aca86e67-medium_jpg.jpg","description":"&lt;p&gt;We are seeking a dynamic Social Media &amp;amp; Content Manager (Freelance) to join our expanding marketing team. You will play a pivotal role in enhancing our brand presence across various social media platforms by developing strategic content and managing our social media channels.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Coordinate our social media strategy to align with business goals and key performance metrics.&lt;/li&gt;\n&lt;li&gt;Plan engaging and shareable content and copy tailored for platforms such as LinkedIn, Instagram, Facebook, Twitter/X, and Threads.&lt;/li&gt;\n&lt;li&gt;Engage with our audience by promptly responding to comments, messages, and fostering a positive community around our brand.&lt;/li&gt;\n&lt;li&gt;Monitor and analyze social media performance metrics to refine strategies and boost key performance metrics with regular reports on social media activities, insights, and growth.&lt;/li&gt;\n&lt;li&gt;Utilize tools like Canva for content creation and Publer to plan and publish content.&lt;/li&gt;\n&lt;li&gt;Actively network on LinkedIn and Instagram to connect with our target market, industry influencers, professionals, and relevant communities, increasing brand awareness and engagement.&lt;/li&gt;\n&lt;li&gt;Plan video and UGC content.&lt;/li&gt;\n&lt;li&gt;Perform competitor and industry research to inform content topics, optimize posting schedules, and leverage the latest engagement features on each platform.&lt;/li&gt;\n&lt;li&gt;Stay up-to-date with emerging platforms, latest social media trends, and new features to continually optimize our online presence.&lt;/li&gt;\n&lt;li&gt;Collaborate with the marketing team to ensure cohesive messaging across all channels and to diversify content.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Qualifications:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;2-4 years of experience in social media management and content creation.&lt;/li&gt;\n&lt;li&gt;Proficiency with design tools like Canva and social media scheduling tools (e.g., Publer).&lt;/li&gt;\n&lt;li&gt;Demonstrated experience creating video content and working with UGC initiatives.&lt;/li&gt;\n&lt;li&gt;Comprehensive understanding of features and strategies across LinkedIn, Instagram, Facebook, Twitter/X, and Threads.&lt;/li&gt;\n&lt;li&gt;Excellent written and verbal communication skills.&lt;/li&gt;\n&lt;li&gt;Demonstrated ability to collaborate effectively with cross-functional teams.&lt;/li&gt;\n&lt;li&gt;Bachelor’s degree in Marketing, Communications, or related field preferred.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Preferred Qualifications:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Certifications in social media management.&lt;/li&gt;\n&lt;li&gt;Experience with analytics tools to track and report on key social media performance metrics.&lt;/li&gt;\n&lt;li&gt;Creative mindset with strong problem-solving capabilities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Why Join Us:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You’ll play a pivotal role in shaping our brand’s digital presence by leveraging your deep expertise in social media platforms. If you’re passionate about community building, video and UGC content, and translating social interactions into tangible business results, we’d love to hear from you!&lt;/p&gt;\n&lt;p&gt;We will be paying at a rate of USD $5.50 per hour.&lt;/p&gt;\n&lt;p&gt;Note: OneLocal pays freelancers using Direct Deposit. Please only apply for this position if you can get paid via Direct Deposit. Thank you!&lt;/p&gt;","tags":"[\"management\"]","pubDate":"2025-03-07T19:10:35.000Z","link":"https://boards.greenhouse.io/onelocal/jobs/5453282004","slug":"freelance-social-media-and-content-manager-onelocal-8201"},{"id":9455518026,"title":"Security Analyst","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $145M from world-class investors, including Andreessen Horowitz, Activant, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we maintain a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated individuals with extreme ownership and high growth orientation. </p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, friends get-together, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">Sardine is looking for a Security Analyst to join our IT and Security Team. Reporting directly to the CISCO, this role offers a unique opportunity to work across Security Operations (SOC) and Governance, Risk, and Compliance (GRC), blending hands-on threat detection with strategic risk management. You will be responsible for monitoring, analyzing, and responding to security incidents, ensuring the confidentiality, integrity, and availability of our critical systems and data. By proactively identifying vulnerabilities and implementing security controls, you will play a key role in protecting Sardine from evolving cyber threats.</p><p style=\"min-height:1.5em\">In addition to security operations, you will collaborate closely with auditors, regulators, and internal teams to support compliance efforts and security reviews. Your ability to communicate effectively and build strong partnerships will be essential in reducing risk and ensuring alignment across multiple domains.</p><p style=\"min-height:1.5em\">If you're passionate about both technical security operations and strategic risk management and thrive in a collaborative environment, we'd love to hear from you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll be doing</strong></p><h3><strong>Governance, Risk, and Compliance (GRC):</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop, implement, and maintain security policies, standards, and procedures in line with regulatory requirements (e.g., NIST, ISO 27001, HIPAA, PCI DSS, GDPR).</p></li><li><p style=\"min-height:1.5em\">Conduct risk assessments to identify and mitigate threats to information assets.</p></li><li><p style=\"min-height:1.5em\">Monitor and report on compliance, tracking the effectiveness of security controls.</p></li><li><p style=\"min-height:1.5em\">Manage security audits, coordinate with external auditors, and address findings.</p></li><li><p style=\"min-height:1.5em\">Maintain security documentation and ensure alignment with evolving regulations.</p></li><li><p style=\"min-height:1.5em\">Provide security awareness training and support incident response planning.</p></li></ul><p style=\"min-height:1.5em\"></p><h3><strong>Security Operations Center (SOC):</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Monitor SIEM systems and security tools for threats and vulnerabilities.</p></li><li><p style=\"min-height:1.5em\">Investigate and respond to security incidents, documenting analysis and remediation steps.</p></li><li><p style=\"min-height:1.5em\">Perform vulnerability scanning, penetration testing, and security assessments.</p></li><li><p style=\"min-height:1.5em\">Collaborate with IT teams to implement security controls and remediate risks.</p></li><li><p style=\"min-height:1.5em\">Stay informed on emerging threats and contribute to threat intelligence initiatives.</p></li><li><p style=\"min-height:1.5em\">Participate in incident response exercises and develop security reports for management.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll need </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">3+ years of experience handling security challenges in a high-growth environment</p></li><li><p style=\"min-height:1.5em\">Strong understanding of security frameworks and standards (e.g., NIST, ISO 27001, SOC 2).</p></li><li><p style=\"min-height:1.5em\">Knowledge of relevant regulations and compliance requirements (e.g., HIPAA, PCI DSS, GDPR).</p></li><li><p style=\"min-height:1.5em\">Working knowledge of MacOS.</p></li><li><p style=\"min-height:1.5em\">Familiarity with risk assessment methodologies and frameworks.</p></li><li><p style=\"min-height:1.5em\">Experience in developing and implementing security policies, standards, and procedures.</p></li><li><p style=\"min-height:1.5em\">Strong analytical, problem-solving, and incident response skills.</p></li><li><p style=\"min-height:1.5em\">Excellent communication and interpersonal skills, with the ability to effectively interact with technical and non-technical stakeholders.  </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The compensation offered for this role will depend on various factors, including the candidate's location, qualifications, work history, and interview performance, and may differ from the stated range.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-03-07T18:12:57.374Z","link":"https://jobs.ashbyhq.com/sardine/11f0689f-b25a-4ecd-9a3f-d5b3168baeb3","slug":"security-analyst-sardine-3954"},{"id":3737531658,"title":"SR Software Engineer (Node.js and React) ","company":"ília","image":"https://avatars.githubusercontent.com/u/35933823?s=200&v=4","description":"&lt;p&gt;Aqui na ília nossas vagas estão sempre abertas para todas as pessoas e não se restringem quanto a gênero, etnia, orientação sexual, fatores sociais, condições físicas ou intelectuais (PCD) etc. Incentivamos a candidatura de integrantes de todos os grupos minoritários!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a ília&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Somos especialistas em tecnologia, dados e design, impulsionando a transformação digital de grandes players do mercado há mais de 10 anos, nos setores financeiro, seguros e mobilidade. Com mais de 450 profissionais, estamos presentes no Brasil e Europa, atendendo aos mercados da América Latina, Europa e América do Norte, desenvolvendo produtos digitais de alta qualidade e com foco em resultados de negócios. Somos uma equipe inovadora, criativa e apaixonada por tecnologia.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Certificada pelo 5° ano consecutivo como Great Place to work aqui na ília acreditamos que pessoas mudam o mundo, e investimos nelas. Nossas awesome deliveries são feitas de pessoas para pessoas, afinal awesome people make awesome deliveries!&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;#Vempraília!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a vaga:&lt;br&gt;&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Como FullStack, você será um membro fundamental de uma equipe de engenharia fullstack e multifuncional. Você colaborará com líderes de Engenharia, Design, Produto, QA e equipes de negócios para desenvolver e entregar soluções de software de alta qualidade, escaláveis e flexíveis. Além disso, terá a oportunidade de orientar engenheiros de nível júnior a pleno.&lt;/p&gt;\n&lt;p&gt;Nosso objetivo é fomentar uma cultura de Engenharia que valoriza equipes de desenvolvimento full stack, capacitando-as a tomar o máximo de decisões possível sobre sua direção técnica e processos.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Requisitos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Disponibilidade para trabalhar no horário EST&lt;/li&gt;\n&lt;li&gt;Inglês Avançado para conversação, leitura e escrita.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Experiência profissional trabalhando em equipes de engenharia de software&lt;/li&gt;\n&lt;li&gt;5+ anos de experiência relevante em desenvolvimento web full-stack em produção, utilizando NodeJS/Typescript e React&lt;/li&gt;\n&lt;li&gt;Histórico de sucesso na execução de projetos&lt;/li&gt;\n&lt;li&gt;Experiência em dividir requisitos de produto em tarefas de engenharia gerenciáveis e trabalhar com a equipe para concluí-las&lt;/li&gt;\n&lt;li&gt;Disposição para transformar necessidades e problemas de negócios abstratos em tarefas concretas, em colaboração com os times de produto e engenharia&lt;/li&gt;\n&lt;li&gt;Disposição para defender as necessidades da equipe e se envolver em decisões estratégicas&lt;/li&gt;\n&lt;li&gt;Experiência sólida com tecnologias de API&lt;/li&gt;\n&lt;li&gt;Experiência sólida com tecnologias RDBMS&lt;/li&gt;\n&lt;li&gt;Experiência trabalhando com AWS&lt;/li&gt;\n&lt;li&gt;Experiência com aplicações web de alto tráfego&lt;/li&gt;\n&lt;li&gt;Compreensão de design de sistemas, estruturas de dados e algoritmos, além de experiência na criação e avaliação de documentos técnicos de design&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Diferenciais:&amp;nbsp;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experiência trabalhando com equipes full-stack que suportam uma fatia vertical do produto&lt;/li&gt;\n&lt;li&gt;Experiência na construção de APIs REST backend usando Golang&lt;/li&gt;\n&lt;li&gt;Familiaridade com as melhores práticas de SRE (como SLOs, KPIs, post-mortems, gerenciamento de incidentes, redução de toil, etc.)&lt;/li&gt;\n&lt;li&gt;Compreensão de metodologias ágeis (preferencialmente Scrum) e disposição para adaptar e definir processos de desenvolvimento de software&lt;/li&gt;\n&lt;li&gt;Experiência na definição de roadmaps técnicos e iniciativas, além de liderança em guildas entre equipes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Benefícios e Incentivos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Nossa contratação é CLT- 40h semanais com jornada flexível, sendo executada 100% de forma remota. Os benefícios da ília são pensados para proporcionar uma experiência AWESOME para cada ílian, abaixo você encontra os benefícios de forma resumida. #vempraília&lt;/p&gt;\n&lt;p&gt;Para Saúde e bem-estar:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde e Odontológico SulAmérica extensivo a dependentes;&lt;/li&gt;\n&lt;li&gt;Vale Alimentação/Refeição em cartão fléxivel Picpay benefícios&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Seguro de Vida;&lt;/li&gt;\n&lt;li&gt;Auxílio Home-Office em cartão fléxivel Picpay benefícios;&lt;/li&gt;\n&lt;li&gt;Wellhub (Gympass)&lt;/li&gt;\n&lt;li&gt;TotalPass&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Para o seu Desenvolvimento:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;ília University: Universidade Corporativa com mais de 20 mil cursos disponíveis para desenvolvimento pessoal e profissional;&lt;/li&gt;\n&lt;li&gt;Language Academy: Escola de idiomas para ílians;&lt;/li&gt;\n&lt;li&gt;í-talks e Chapter: Momentos e cerimônias em que o time compartilha práticas, estudos, projetos e ideias. Nas chapters ainda se reúnem pessoas com skills similares para compartilhamento de ideias, práticas e experiências;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Gostamos de ir além no cuidado com as nossas pessoas, então dispomos também de alguns benefícios não convencionais:&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde PET- Guapeco&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;BYOD- Alugamos o seu notebook pessoal te pagando um valor mensal para que você o use, mas disponibilizamos também máquinas de trabalho para ílians. Você quem decide!&lt;/li&gt;\n&lt;li&gt;Seu Niver, seu bolo!&lt;/li&gt;\n&lt;li&gt;Seu Networking Vale Prêmio- Programa de premiação a indicação de novos funcionários.&lt;/li&gt;\n&lt;/ul&gt;","tags":"[\"typescript\",\"finance\",\"aws\"]","pubDate":"2025-03-07T17:52:29.000Z","link":"https://job-boards.greenhouse.io/ilia/jobs/5470717004","slug":"sr-software-engineer-node-js-and-react-lia-4653"},{"id":6737417348,"title":"Senior Marketing Manager, APAC","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 16px;\">This is an exciting opportunity for a dynamic marketing professional to shape Airalo’s presence and growth in the APAC region. As a Marketing Manager, you will play a pivotal role in building brand awareness, driving customer engagement, and contributing to the rapid expansion of an emerging category that is transforming the way travelers stay connected. You’ll be part of a highly collaborative, fully remote global team, working in a fast-paced environment where innovation and impact go hand in hand.</span></div><h3>Responsibilities include but are not limited to</h3><li>Develop and execute go-to-market strategies to drive user acquisition and new customer revenue.</li><li>Plan and manage multi-channel marketing campaigns across TOFU, MOFU, and BOFU.</li><li>Optimize paid media strategy in collaboration with Performance Marketing and/or media agencies.</li><li>Identify and grow strategic brand and commercial partnerships for cross-promotional initiatives.</li><li>Work with internal and external teams to execute marketing plans effectively.</li><li>Monitor and optimize campaign performance based on data-driven insights and KPIs.</li><li>Ensure budget efficiency and maximize revenue opportunities across marketing spend.</li><li>Track and measure campaign effectiveness, implementing improvements as needed.</li><li>Oversee marketing operations, including invoicing, billing, and partner evaluations.</li><li>Coordinate with internal teams and external partners to execute campaigns smoothly.</li><li>Conduct post-campaign analysis to refine future strategies.</li>,<h3>Requirements</h3><li>A full-stack marketer with experience managing fully integrated communications and is comfortable working with an agency to deliver both always-on content and campaigns.</li><li>7+ years of experience in a digital-first environment, working either in an in-country/multi-market role or a regional remit covering APAC/SEAExperience in the travel, telco, e-commerce industry is preferred but not essential</li><li>Possess an innovation mindset, which embraces “test-and-learn” and is able to apply this to identify key projects and champion identified projects outside of campaign planning&nbsp;</li><li>Must be fluent in English and one or more Asian Languages</li><div><b>#APAC</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\"]","pubDate":"2025-03-07T17:19:25.263Z","link":"https://jobs.lever.co/airalo/ad98fd2b-09e2-40b7-8f26-d5c3348102db","slug":"senior-marketing-manager-apac-airalo-1022"},{"id":4392201976,"title":"Senior Business Development (Web3 Security)","company":"Nethermind","image":"https://avatars.githubusercontent.com/u/43478154?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;What are we all about?&lt;/h2&gt;\n&lt;p&gt;We are a team of builders and researchers on a mission to empower enterprises and developers worldwide to access and build on decentralized systems.&lt;/p&gt;\n&lt;p&gt;Our expertise covers several domains: Ethereum and Starknet protocol engineering, layer-2, AI, cryptography research, protocol research, decentralized finance (DeFi), security auditing, formal verification, real-time monitoring, smart contract development, and dapps and enterprise engineering.&lt;/p&gt;\n&lt;p&gt;Working to solve some of the most challenging problems in the blockchain space, we frequently collaborate with renowned companies, such as Ethereum Foundation, Starknet Foundation, Gnosis Chain, Flashbots, Forta Protocol, Lido, EigenLayer, Open Zeppelin, RISCZero, Aleph Zero, and many more.&lt;/p&gt;\n&lt;p&gt;Today, we are a 350+ strong team working remotely across 66+ countries.&lt;/p&gt;\n&lt;p&gt;View all our open positions here: &lt;a href=&quot;https://www.nethermind.io/open-roles&quot;&gt;https://www.nethermind.io/open-roles&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The &lt;strong data-stringify-type=&quot;bold&quot;&gt;Senior Business Development&lt;/strong&gt; role will utilize Nethermind Security’s engineering talent to accelerate the adoption &amp;amp; development of permissionless, open &amp;amp; decentralized systems. You will have the opportunity to be at the forefront of a pivotal time in Web3.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a member of the Business Development team, you will focus on the growth of Nethermind Security’s Business Unit.&lt;/p&gt;\n&lt;p&gt;Your responsibilities will be&amp;nbsp;multifaceted and&amp;nbsp;require you to be proactive and motivated. You will attract new clients, build relationships, generate leads, negotiate, and close deals. Other duties will include market research, developing business strategies and pitches, and identifying new business opportunities. You will focus on working with Security Audits, formal verification, and real-time monitoring.&lt;/p&gt;\n&lt;p&gt;This is an enormous opportunity to utilize your problem-solving ability and pave the path for the future of Blockchain technology.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A Day in the Life&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Identifying and evaluating new business opportunities&lt;/li&gt;\n&lt;li&gt;Generating leads&lt;/li&gt;\n&lt;li&gt;Negotiating and closing deals&lt;/li&gt;\n&lt;li&gt;Conducting market research and identifying potential clients&lt;/li&gt;\n&lt;li&gt;Building strong relationships with new clients while maintaining existing client relationships&lt;/li&gt;\n&lt;li&gt;Engaging with projects across ecosystems&lt;/li&gt;\n&lt;li&gt;Identify and invent new value propositions&lt;/li&gt;\n&lt;li&gt;Assisting with drafting business plans, sales pitches, presentations, reference material, etc&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Must Haves:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;5+ years of work experience in sales&lt;/li&gt;\n&lt;li&gt;Experience in Web3 is&amp;nbsp;&lt;strong&gt;required&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Previous experience selling security services and products is &lt;strong&gt;preferred&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Proven experience in sales and leads generation (provide measurable results)&lt;/li&gt;\n&lt;li&gt;Strong negotiation skills&lt;/li&gt;\n&lt;li&gt;Strong written/verbal communication &amp;amp; presentation skills&lt;/li&gt;\n&lt;li&gt;Ability to generate and acquire new leads&lt;/li&gt;\n&lt;li&gt;Strong network in Web3 space (Ethereum, Starknet, other L2s)&lt;/li&gt;\n&lt;li&gt;Experience in working with marketing on lead-generation campaigns&lt;/li&gt;\n&lt;li&gt;Comfort in making decisions autonomously and explaining your ideas concisely&lt;/li&gt;\n&lt;li&gt;Self Driven / Entrepreneurial mindset. Ability to work fast and autonomously&lt;/li&gt;\n&lt;li&gt;Good knowledge of Blockchain technology &amp;amp; the crypto space&lt;/li&gt;\n&lt;li&gt;Great at building &amp;amp; leveraging relationships while maintaining existing ones&lt;/li&gt;\n&lt;li&gt;Data-savvy, understand basic metrics of sales, marketing, and operations&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;div&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/span&gt;: I hereby consent to my personal information being stored and processed by Demerzel Solutions Limited (t/a Nethermind) (the “Company”) for recruitment purposes in relation to both the selected job role and any other role the Company considers me a qualified candidate for. All data storing and processing by the Company takes place in accordance with the UK GDPR. Kindly refer to our privacy policy for more details.&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;Your consent to share personal information is entirely voluntary, and you may withdraw your consent at any time. Should you have any questions about this process, or wish to withdraw your consent please contact: legalnotices@nethermind.io&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;br&gt;Keep up to date on what we are working on by following&amp;nbsp;&lt;span class=&quot;il&quot;&gt;us&lt;/span&gt;&amp;nbsp;on &lt;strong&gt;our social channels&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;&lt;a href=&quot;https://twitter.com/nethermindeth&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn4.iconfinder.com/data/icons/social-media-icons-the-circle-set/48/twitter_circle-512.png&quot; alt=&quot;&quot; width=&quot;50&quot; height=&quot;50&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://discord.com/invite/PaCMRFdvWT&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn3.iconfinder.com/data/icons/popular-services-brands-vol-2/512/discord-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://www.linkedin.com/company/nethermind/mycompany/&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn1.iconfinder.com/data/icons/logotypes/32/circle-linkedin-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt;&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;&lt;a href=&quot;https://www.nethermind.io/legal&quot; target=&quot;_blank&quot;&gt;&lt;em&gt;Click here to view our Privacy Policy.&lt;/em&gt;&lt;/a&gt;&lt;/strong&gt;&lt;/div&gt;&lt;/div&gt;","tags":"[\"finance\",\"engineering\",\"legal\"]","pubDate":"2025-03-07T09:01:06.000Z","link":"https://job-boards.eu.greenhouse.io/nethermind/jobs/4553097101","slug":"senior-business-development-web3-security-nethermind-9744"},{"id":4182597551,"title":"Head of Marketing","company":"Qevlar AI","image":"https://remotive.com/job/1970338/logo","description":"<div class=\"h1\">What will you do?</div><p>We are seeking a head of marketing who can be both strategic and operational. As agentic AI is a budding field, we are looking for a marketing leader with hands-on <span style=\"font-weight: 600; color: rgb(0, 0, 0); letter-spacing: 0.75px;\">product marketing experience</span>. The ideal candidate will possess a deep understanding of the B2B landscape and have a proven track position in technical products. This role requires a strategic thinker who can drive growth, enhance brand visibility, and position Qevlar AI as a future market leader in a new category.</p><ul style=\"\"><li style=\"\"><span style=\"font-weight: 600; color: rgb(0, 0, 0); letter-spacing: 0.75px;\">Strategic Marketing Leadership</span>: Manage Qevlar’s marketing efforts including overall strategy, content marketing, and demand generation.</li><li style=\"\"><span style=\"font-weight: 600; color: rgb(0, 0, 0); letter-spacing: 0.75px;\">Product Marketing</span>: Effectively communicate our product’s value to cultivate and strengthen our position in a new category in the Cybersecurity space.</li><li style=\"\"><span style=\"font-weight: 600; color: rgb(0, 0, 0); letter-spacing: 0.75px;\">Team Leadership</span>: Build, mentor, and manage a high-performing marketing team, fostering a culture of innovation, accountability, and continuous improvement.</li><li style=\"\"><span style=\"font-weight: 600; color: rgb(0, 0, 0); letter-spacing: 0.75px;\">Market Analysis</span>: Conduct thorough market research to identify trends, customer needs, and competitive landscape, informing strategic decisions.</li><li style=\"\"><span style=\"font-weight: 600; color: rgb(0, 0, 0); letter-spacing: 0.75px;\">Demand Generation</span>: Lead initiatives to generate qualified inbound leads through multi-channel campaigns, including digital marketing, content marketing, events, partnerships, and community.</li><li style=\"\"><span style=\"font-weight: 600; color: rgb(0, 0, 0); letter-spacing: 0.75px;\">Performance Metrics</span>: Establish and monitor key performance indicators (KPIs) to assess the effectiveness of marketing initiatives and adjust strategies as needed.</li></ul><p><span style=\"color: var(--remotive-chocolate);\"><br></span></p><div class=\"h1\"><span style=\"color: var(--remotive-chocolate);\">Qualifications</span></div><ul style=\"\"><li style=\"\"><span style=\"font-weight: 600; color: rgb(0, 0, 0); letter-spacing: 0.75px;\">5-10 years of experience in B2B SaaS</span> marketing; experience in cybersecurity is a strong plus.</li><li style=\"\">Proven track record of positioning a company as a market leader through a <span style=\"font-weight: 600; color: rgb(0, 0, 0); letter-spacing: 0.75px;\">product marketing strategy</span>.</li><li style=\"\">Experience in building, structuring, and scaling marketing teams is a plus.</li><li style=\"\"><span style=\"font-weight: 600; color: rgb(0, 0, 0); letter-spacing: 0.75px;\">Results-focused</span> with a strong orientation toward data-driven, KPI-centric decision-making.</li><li style=\"\">Native or bilingual English level.</li></ul><p><br></p><div class=\"h1\" style=\"color: rgb(83, 42, 33);\">What's in it for you?</div><p><span style=\"color: var(--remotive-chocolate);\"></span></p><ul style=\"\"><li style=\"\">Competitive compensation aligned with your experience and the value we expect you to bring.</li><li style=\"\">A high-impact role where your contributions directly shape the product and its success, in a culture that values autonomy and creativity.</li><li style=\"\">Work where you want: A vibrant office location in Paris, with easy access to public transportation and flexible work arrangements, with a hybrid in-office and remote work setup, or fully remote.</li><li style=\"\">Opportunity to work with a talented and passionate team in the high-growth areas of Cybersecurity and AI.</li><li style=\"\">Stock in a rapidly growing company.</li></ul>\n<img src=\"https://remotive.com/job/track/1970338/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"saas\",\"AI/ML\",\"product marketing\",\"research\",\"market research\",\"content marketing\",\"digital marketing\",\"marketing strategy\",\"demand generation\",\"partnerships\",\"cybersecurity\",\"technical products\"]","pubDate":"2025-03-06T10:45:43.000Z","link":"https://remotive.com/remote-jobs/marketing/head-of-marketing-1970338","slug":"head-of-marketing-qevlar-ai-1028"}]