[{"id":7721664866,"title":"Account Executive (English & Punjabi)","company":"Bobtail","image":"https://media.licdn.com/dms/image/D4E0BAQGvUyfPVBWDyg/company-logo_200_200/0/1657595552015?e=2147483647&v=beta&t=EecsDCOy3Fh_26M1noQDDIYw8-JuGKz_d1JDvcBZ-yI","description":"\n    \n\n    <h2><strong>About Bobtail</strong></h2>\n<p><strong>About Bobtail</strong></p>\n<p>Bobtail is dedicated to increasing happiness by eliminating inefficiencies in the supply chain. We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.</p>\n<p>We work in a unique way at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve. Teams are given flexibility in working towards a shared purpose, and given the freedom to decide how they will accomplish their goals.</p>\n<p>If you are an out-of-the-box thinker that takes a proactive approach to collaborate with others to solve problems and achieve your goals - we would love to talk to you.</p>\n<p>The things we value:</p>\n<ul>\n<li>&nbsp;Mission</li>\n<li>Teams over individuals</li>\n<li>Collaboration</li>\n<li>Communication</li>\n<li>Iteration</li>\n<li>Experimentation and failing fast</li>\n<li>Initiative and solutions-oriented approach</li>\n<li>Documentation</li>\n<li>Data</li>\n<li>Mental health and work-life balance</li>\n<li>Diversity</li>\n<li>Transparency</li>\n</ul>\n<p><strong>You should apply if you have:</strong></p>\n<ul>\n<li>3–5 years of B2B cold calling &amp; outbound sales experience</li>\n<li>Software as a Service (SaaS) experience is a must</li>\n<li>US Trucking Industry knowledge is a plus</li>\n<li>CRM usage experience is preferred (Salesforce is a plus)</li>\n<li>Start-up experience is a plus</li>\n<li>Ability to quickly learn in a fast-paced environment,</li>\n<li>Bilingual is preferred (English &amp; Punjabi)</li>\n<li>Consistent track record of achievement and hitting quotas</li>\n<li>Confidence, as well as strong verbal &amp; written communication skills when interacting with clients</li>\n<li>Ability to discover and understand customer needs and propose solutions</li>\n<li>Dependable team player</li>\n<li>A motivated, driven, self-starter… We love those with grit and accountability!</li>\n<li>Must own a modern - not older than 3 years old laptop with a working camera.</li>\n<li>Internet Speed of 50 Mbps is required</li>\n</ul>\n<p><strong>You will be responsible for:</strong></p>\n<ul>\n<li>Making cold calls &amp; send emails/text to connect with prospects</li>\n<li>Convert prospects &amp; leads into Bobtail clients</li>\n<li>Collaborate as a team to accomplish individual, team, and company-wide goals</li>\n<li>Maintain a pipeline of leads and opportunities using our CRM (Salesforce)</li>\n<li>Effectively use other sales tools to track progress and improve your performance</li>\n<li>Learn about each client’s needs, industry, and competitors.</li>\n<li>Build long-lasting, mutually beneficial relationships with prospects and clients to create a better customer experience.</li>\n<li>Follow up with prospects throughout the sales cycle to continue nurturing them.</li>\n<li>Present the value of Bobtail products and services to prospects</li>\n<li>Stay current on company offerings and industry trends.</li>\n</ul>\n<p><strong>Educational background:</strong></p>\n<ul>\n<li>Bachelor’s degree preferred<br>Sales or business education/certification preferred</li>\n<li>Completed studies preferred<br><br><br></li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>Monthly Mental Break Day</li>\n<li>Paid Time Off</li>\n<li>Work from home (or wherever)</li>\n<li>Parental leave</li>\n</ul>\n<p><br>Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colours, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities, and perspectives.</p>\n\n    \n\n    \n","tags":"[\"B2B\"]","pubDate":"2024-07-10 12:55:08.957","link":"https://boards.greenhouse.io/bobtail/jobs/4053480005","savedDate":"2024-07-10 12:55:08.957","slug":"account-executive-english-punjabi-bobtail-7790"},{"id":9559870855,"title":"Software Engineer - Cody Core [IC2]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that <a href=\"https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4\">everyone can code</a>, not just ~0.1% of the population. We're building the code intelligence platform that powers the world's best code search and the most popular open-source code AI tool. It’s an exciting time to join Sourcegraph—AI has taken over the world, and we aim to automate 99% of the toil in software engineering with our code understanding and code AI tools, leaving the remaining 1% to the irreplicable creative spark from humans.&nbsp;</p>\n<p>Our customers range from startups to the Fortune 500, 4/5 FAANG companies, government organizations, Uber, Plaid, and more. We’ve raised $225M at a $2.625B valuation from <a href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\">a16z</a>,<a href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\"> Sequoia</a>, <a href=\"https://www.redpoint.com/companies/sourcegraph/\">Redpoint</a>, <a href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\">Craft</a> and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Location</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire <a href=\"https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4\">almost anywhere</a> in the world, we have a preference for someone to reside in the following locations for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap with PST for at least 30 hours/week.</p>\n<p><strong>Preferred locations:</strong></p>\n<ul>\n<li>Remote - San Francisco</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>Imagine being part of a team where your work will redefine the coding experience for developers around the world. As a Software Engineer on the Cody Core team, you will work on Cody, an AI coding assistant that lives in your editor. You will work at the forefront of integrating advanced AI technologies into everyday coding practices. This role offers a unique opportunity to innovate and push the boundaries of what an AI coding assistant can achieve, all while working with a talented and passionate team. You'll have the chance to see your contributions directly impact developers, enhancing their productivity and transforming how they interact with their code.</p>\n<p>📅 Within one month, you will…</p>\n<ul>\n<li>Familiarize yourself with Cody, understanding the architecture and the problems it solves for our users.</li>\n<li>Start contributing to our current focus areas by working on tasks related to the end-to-end user experience.</li>\n<li>Engage with your team members, learning from their experiences and sharing your insights to contribute to the project's direction.</li>\n</ul>\n<p>📅 Within three months, you will…</p>\n<ul>\n<li>Be contributing actively to the world’s best coding assistant.</li>\n<li>Take ownership of smaller features and implement them, with a focus on improving user engagement and satisfaction.</li>\n<li>Begin to influence the project's future direction by providing insights based on your work and user feedback, collaborating closely with product management and design teams.</li>\n</ul>\n<p>📅 Within six months, you will…</p>\n<ul>\n<li>Be fully ramped up and able to anticipate the needs of Cody users.</li>\n<li>Establish yourself as a key contributor to the team, known for your expertise in both the technical and product aspects of our work.</li>\n<li>Participate in initiatives that push the boundaries of what Cody can do, making coding more accessible and enjoyable for developers everywhere.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>About you</strong></span></h2>\n<p>You are a full-stack software engineer with at least 2 years of industry experience. You are comfortable with frontend and backend work as needed, can pick up frameworks quickly, and can deliver high-quality work.&nbsp;</p>\n<p>Beyond your technical proficiency, you are a forward-thinking and adaptive contributor, ready to navigate a complex project. Your vision extends beyond code: you are passionate about the broader impact of your work on making coding accessible and enjoyable for a diverse global community. You actively seek out opportunities to challenge the status quo, drive meaningful change, and foster an inclusive, high-performing team culture. You are an experienced remote/async worker.</p>\n<ul>\n<li>2–5 years experience as a full-stack engineer</li>\n<li>Experience with Typescript or Go is required (both preferred)</li>\n<li>Familiarity with code intelligence tools and AI-assisted development platforms such as Sourcegraph Cody, GitHub Copilot, or similar</li>\n<li>Alignment with our values</li>\n<li>Growth mindset</li>\n</ul>\n<p>Nice to haves:</p>\n<ul>\n<li>Experience writing extensions for one or more of the following: Visual Studio Code, JetBrains IDEs, Visual Studio, or Eclipse</li>\n<li>Familiarity with compilers, language server protocols, code intelligence, or related technologies</li>\n<li>Experience working closely with Product and Design teams</li>\n<li>Previous role in a startup environment, comfortable with rapid iteration and adaptable to shifting priorities</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC2. You can read more about <a href=\"https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values <a href=\"https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4\">competitive compensation</a>, our compensation ranges are visible to every single Sourcegraph teammate.</p>\n<p>To determine your salary, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The starting salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that these salary ranges may be adjusted in the future.</p>\n<p>💰The target compensation for this role is $145,000 USD base.</p>\n<p>Please speak with a recruiter for additional information regarding zone locations.📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5.5 hours in total.</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13\">Recruiter Screen</a></li>\n<li>[15m] Hiring Manager Intro - Erika</li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[60m] Pairing Exercise</li>\n<li>[45m] Code Walkthrough</li>\n<li>[60m] Resume Deep Dive</li>\n<li>[60m] Cross-functional Team Collaboration Interview</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd\">Values</a></li>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c\">Leadership</a> with co-founder&nbsp;</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Not sure if this is you?</span></strong></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://sourcegraph.notion.site/All-remote-guidelines-4d1270d806294bf4ae6db7ab02911957\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://www.notion.so/sourcegraph/7ed54d4ec4624475a4b45619901236d7?v=e06d936c673f46ca8c313a557bd4410f\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"typescript\",\"management\",\"engineering\"]","pubDate":"2024-07-10 12:55:08.956","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5206969004","savedDate":"2024-07-10 12:55:08.956","slug":"software-engineer-cody-core-ic2-sourcegraph-9420"},{"id":5424101464,"title":"Auth Engineer","company":"Supabase","image":"https://pbs.twimg.com/profile_images/1651226564728700928/h0tz5UT1_400x400.jpg","description":"\n    <div class=\"content-intro\"><p><img src=\"https://pbs.twimg.com/media/FIdU8GJWQAUGWRA?format=jpg&amp;name=small\" alt=\"Join Supabase\" width=\"680\" height=\"453\"></p></div>\n\n    <p>Supabase is an open-source Firebase alternative that provides all the backend services you need to build a scalable and robust application. Our mission is to empower developers to create extraordinary products with simplicity and speed. We are a fully remote company.</p>\n<p><a href=\"https://supabase.com/auth\">Auth</a>, written in <a href=\"https://github.com/supabase/auth\">Go</a> (server) and with client libraries for <a href=\"https://github.com/supabase/auth-js\">TypeScript</a>, <a href=\"https://github.com/supabase/ssr\">SSR</a> and for other frameworks and technologies, is one of the most popular products in the Supabase stack. We are seeking someone to help us build new and maintain existing Auth features.</p>\n<h4>You have:</h4>\n<ul>\n<li>3+ years of Software Development experience</li>\n<li>Strong knowledge of web technology fundamentals (cookies, sessions, JWT, HTTP, browser APIs)</li>\n<li>Good knowledge of and deep interest in authentication security (passwords, protocols such as OAuth, OIDC or SAML, cryptography fundamentals such as hash functions, signatures and ciphers)</li>\n<li>Experience working with multiple web frameworks like Next.js (or other SSR alternatives in the JavaScript space) and traditional web frameworks like Ruby on Rails, Django, Laravel or equivalent (in any language)</li>\n<li>Strong knowledge of Go and TypeScript (languages used daily) and Postgres</li>\n<li>Good technical writing skills (RFC process is an important part of making changes to the Auth product)</li>\n</ul>\n<h4><strong>We offer:</strong></h4>\n<ul>\n<li>100% remote work from anywhere in the world. No location-based adjustment to your salary.</li>\n<li>ESOP (equity ownership in the company)</li>\n<li>Autonomous work. We work collaboratively on projects, but you set your own pace.</li>\n<li>Health, Vision and Dental benefits. Supabase covers 100% of the cost for employees and 80% for dependents</li>\n<li>Generous Tech Allowance for any office setup you need</li>\n<li>Annual Education Allowance</li>\n<li>Annually run off-sites.</li>\n</ul>\n<p></p>\n\n    \n\n    <div class=\"content-conclusion\"><h3>BUILD IN A WEEKEND. SCALE TO BILLIONS</h3>\n<p>Supabase adds auth, realtime, and restful APIs to Postgres without a single line of code.</p>\n<p>Each project within Supabase is an isolated&nbsp;Postgres cluster, allowing customers to scale independently, while still providing the features that you need to build: instant database setup, auth, row level security, realtime data streams, auto-generating APIs, and a simple to use web interface.</p>\n<p>We are a fully remote company.</p>\n<p>Key Tech: Javascript, Typescript, Go, Elixir, PostgREST (haskell), Postgres, Pulumi.</p>\n<h3><a id=\"about-the-team\" class=\"anchor\"></a>About the team</h3>\n<ul>\n<li>We're a startup. It's unstructured.</li>\n<li>Collectively founded more than a dozen venture-backed companies.</li>\n<li>More than 10 different nationalities.</li>\n<li>We deeply believe in <a href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\" target=\"_blank\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</li>\n<li>We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</li>\n</ul>\n<h2><a id=\"process\" class=\"anchor\"></a>Process</h2>\n<ul>\n<li>The entire process is fully remote and all communication will happen over email or via video chat.</li>\n<li>Once you've submitted your application, the team will review your submission, and may reach out for a short screening interview over video call.</li>\n<li>If you pass the screen you will be invited to up to four follow up interviews. The calls:\n<ul>\n<li>usually take between 20-45 minutes each depending on the interviewer.</li>\n<li>are all 1:1.</li>\n<li>will be with both founders, a member of either the growth or engineering team (depending on the role), and usually one other person from your immediate team or function.</li>\n</ul>\n</li>\n<li>Once the interviews are over, the team will meet to discuss several roles and candidates and may:\n<ul>\n<li>ask one or two follow-up questions over email or a quick call.</li>\n<li>go directly to making an offer.</li>\n</ul>\n</li>\n</ul>\n<h2>&nbsp;</h2></div>\n","tags":"[\"postgres\",\"pulumi\",\"javascript\",\"typescript\",\"elixir\",\"engineering\",\"database\"]","pubDate":"2024-07-10 12:55:08.954","link":"https://boards.greenhouse.io/supabase/jobs/5225004004","savedDate":"2024-07-10 12:55:08.954","slug":"auth-engineer-supabase-3518"},{"id":9774827078,"title":"IT Operations Senior Systems Engineer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 16px\">The IT Operations Senior Systems Engineer is pivotal in helping shape the future of how our Internal Users work . The Systems Engineer will have a big role in building out&nbsp; Automation within the IT Org, as well as being a POC/Escalation point for the IT Ops Team.</span></div><div><br></div><div><span style=\"font-size: 16px\">With this role being the first of its kind at Airalo, You will be responsible for helping with building out structures and processes for the team, an eye for continuous process improvement , always looking for ways to improve our internal user experience. If you enjoy working in a fast-paced environment, possess strong interpersonal skills, and have a passion for technology and telecommunications, we encourage you to explore further.</span></div><h3>Responsibilities:</h3><li>Identify and solve team, organizational, and business IT infrastructure problems</li><li>Making technical decisions on behalf of the department and organization</li><li>Joint collaboration with Compliance, IT, People, and Security team members for improving automation efficiency, security posture, and vulnerability management</li><li>Designing and developing software that improves back office automation</li><li>Participate in the Global IT planning process and ensure architectural designs and principles are incorporated in enterprise implementations</li><li>Provide senior level direction to the Information Technology team, assist with mentoring and providing technical guidance to more junior staff members</li><li>Build roadmaps for acquiring, integrating, and implementing high-value technology and processes. Oversee efforts (e.g. proof of concepts) to measure and prove new technology value</li><li>Create and manage access policies to improve security and adhere to compliance standards</li><li>Build and maintain cross-functional relationships with internal teams to drive initiatives</li><li>Work with Security, PeopleOps and IT to develop automated onboarding and offboarding processes</li>,<h3>  Must haves:</h3><li>Experience administering SaaS applications such as MDM and IDP Solutions&nbsp;</li><li>In-depth knowledge of identity and access management concepts and practices</li><li>Developing automation workflows and integrations for repetitive or manual tasks</li><li>5+ years of experience in user support in a cloud-first modern IT environment</li>,<h3>Good to haves:</h3><li>Knowledge in one of the following scripting languages - Python or Ruby</li><li>Experience with workflow automation and Saas tools that can deliver on that such as, but not limited to Okta, Jumpcloud, Zapier etc</li><li>Experience in supporting other departments with high priority projects&nbsp;</li><li>Experience with HRIS systems </li><li>Cloud computing administration experience (AWS/GCP)</li><li>Have strong fundamental knowledge of security best practices</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i style=\"font-size: 15px\">Please note that our Engineering team works in the CET timezone, so candidates will need to reside in countries with the same time zone or similar to it and will need to already have permit to work in the country where they are based.</i></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2024-07-10 12:02:31.342","link":"https://jobs.lever.co/airalo/9b15730a-5406-494b-9ef6-e80fa710b4e7","savedDate":"2024-07-10 12:55:08.962","slug":"it-operations-senior-systems-engineer-airalo-2765"},{"id":6489767750,"title":"Internet Marketing Account Strategist (Local SEO)","company":"WebFX","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/3f4a1490-d8b2-4b84-8e68-ca668c886eae-1582815376935.png","description":"<div>WebFX is a proud Google Premier Partner with 6 offices in the US as well as an office in Guatemala and another in Cape Town, South Africa, where we are a registered employee as WebFX South Africa! We are continuing to expand worldwide and would love for you to be a part of that! In fact, we doubled in size in the past 5 years and are projecting to once again double in size and be a global, publicly traded tech company by the year 2030 - operating in every continent, servicing clients globally. We currently have talented team members across the globe (representing 18+ Countries) who work remotely full time and have done so for 10+ years.</div><div><br></div><div><span style=\"font-size: 11pt\">No matter where you’re located, we’d love to have you join our mission of providing world-class digital marketing solutions to mid-size businesses on a global scale. We thrive on driving business growth for our clients and are looking for people who take pride in their marketing efforts and enjoy having fun at the same time. Sound like you? Great! Keep reading:</span></div><div><br></div><div><span style=\"font-size: 24px\">Why Choose WebFX</span></div><div><br></div><div>We've been named the #1 best place to work in our headquarter's home state of Pennsylvania for 9 years in a row and offer the same culture and benefits to our global, remote team members. Along with a very competitive base pay, we offer company profit sharing, performance bonuses, On-going learning bonuses (yes, you get paid to learn!) and time zone differential pay. World class digital marketing training (Organic SEO, Local SEO, PPC, Google analytics + Studio, etc), long term career track, Health Insurance (including dental, vision, remote doctor, etc), and there's seriously a ton of other benefits! To name just a few:</div><div><br></div><div>- If you’re located in one of our operating countries (Guatemala  or South Africa), this is a Full-time (non-contract based) position. Either way, WebFX offers long term stability to all of our FXFamily members. In fact, many of our global/remote team members have been with WebFX for 9+ years and we’re hopeful you can be too!&nbsp;</div><div>- We put our people first, it’s as simple as that. You’re never on your own - when you run into inevitable challenges, we’re there to support you along the way!</div><div>- Long-lasting relationships with both clients and team members due to consistently low turnover rates that are simply unheard of in our industry, because again, we put our people first.</div><div>- Fully Remote or hybrid/in-office options if you prefer and are within commuting distance of one of our international locations (Antigua, Guatemala and Cape Town, South Africa). <span style=\"font-size: medium\">🏡</span></div><div>- Fully equipped in-home office setup including computer, dual large monitors, headset, seriously fast internet, generator and more! 🖥️</div><div>- Multiple schedule options from which to choose. Depending on the hours you select, you will receive additional pay for overlapping our hours! <span style=\"font-size: medium\">💰</span></div><div>- Be part of a rapidly growing company that at the same time only partners with clients who share our values🌱📈</div><div>- Unrestricted access to our dozens of proprietary softwares/platforms our internal R&amp;D team has developed for our team’s exclusive use, in addition to access to the many 3rd party tools and softwares we utilize internally in order to WOW our clients.<a href=\"https://www.webfx.com/marketingcloudfx/\" class=\"postings-link\"> You can learn more about just some of our proprietary tools here</a>!</div><div>- Merit-based promotional structure</div><div>- <span style=\"font-size: 11pt\">We have a very strong commitment to giving back globally - in fact, it’s one of our values here at WebFX. As a member of our FXFamily, you get to be a large part of that simply by achieving your goals - since 2014, we’ve committed to donating globally through our FXBuilds program. </span><a href=\"https://www.webfx.com/about/fxbuilds/\" style=\"font-size: 11pt\" class=\"postings-link\">You can learn more about that here</a><span style=\"font-size: 11pt\">!</span></div><div><br></div><div><span style=\"font-size: 24px\">What You'll Get</span></div><div><br></div><div><span style=\"font-size: 24px\">World-Class Training and Ongoing Career Development</span></div><div><br></div><div>- No matter your level of experience, our “Bootcamp” web marketing training program is provided for all new WebFX “family members” to learn, grow and develop in and out of the office with the hard skills necessary to be successful in their position.&nbsp;</div><div>- From training with our Sr Digital Marketers to access to countless industry leading online training resources/courses/tutorials to getting experience with nearly 1,500+ different clients with various platforms, digital services and in every industry you can think of (and then some), our training program is simply unrivaled!</div><div>- Training doesn’t stop after your initial training period, we offer career development training and monthly Lunch-and-Learns with our state-of-the-art training amenities to facilitate departmental trainings, industry-related updates, and more!</div><div>- FXLearns program – where you get incentives for taking advantage of our countless industry training resources</div><div>- After 1,500+ clients, we’ve been able to truly master our processes and procedures – you will be trained on all of those - no need to develop how to do things (unless you want to help us continually improve that process!) – because we refuse to ever stagnate, we are always pushing the envelope to make those processes 1% better too!&nbsp;</div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">Opportunities for Growth</span></div><div><br></div><div>WebFX grew 250%+ over the past 3 years both locally and globally, and merit-based promotional opportunities are abundant if you're meeting or exceeding position performance metrics. We believe in growing and promoting our internal team first and foremost. In fact, 95% of our promotions are internal! All team members have a very clearly defined progression path, so you know exactly what is expected of you so you can put your career in your own hands. And what’s more, you’re not expected to know it all - we believe in continually striving to be an expert in your subject matter of expertise – so while we will purposely challenge you to grow in SEO/PPC/Google Analytics, we are a full service agency that has experts in other departments that handle everything else - from link building, social media, web design and web development. So you can truly master your trade.</div><div><br></div><div><br></div><div><br></div><div><br></div><h3>Who We're Looking For</h3><li><b>Desired Education</b></li><li>Bachelor's Degree in Marketing, Advertising, Business, Journalism, Communications, Information Systems or Statistics </li><div><br></div><li><b>General Knowledge</b></li><li>Solid understanding of the Internet</li><li>Solid understanding of basic copywriting</li><li>Solid web copywriting skills</li><div><br></div><li><b>Experience</b></li><li>1-2 years of Local/Maps/general SEO experience</li><li>Basic HTML experience (a plus)</li><li>Advertising agency experience (a plus)</li><li>Any digital marketing experience (a plus)</li><li>Experience with Google Analytics (a plus)</li><div><br></div><li><b>Qualities</b></li><li>Fluent in English (written and verbal). Resume must be in English to be considered.</li><li>Stays up to date on new changes to the web and actively reads several blogs</li><li>Professional, dependable, solid work ethic</li><li>Detail-oriented</li><li>Self-motivated</li><li>An eye for detail</li><li>Dedication to quality and high level of follow through</li><li>Approaches problem solving proactively and in a professional manner</li><li>Excellent time/project management skills</li><li>Solid analytical skills and ability to make decisions based on data</li><li>Creative problem solving abilities</li><li>Ability to meet deadlines</li><li>Outstanding written communication skills</li><h3>What You'll Do</h3><li><b>Responsibilities</b></li><li>Local SEO</li><li>Maps/Google Business Optimization</li><li>Need to be able to solve basic business problems </li><li>Working under senior digital marketers and supporting them on some of our largest campaigns and client accounts</li><li>Creating digital marketing campaign reports</li><li>Analyzing competitors’ websites and online marketing initiatives</li><li>Correcting technical issues on the backend of websites</li><li>Performing A/B, website usability, and website conversion rate testing</li><li>Driving client success on the web</li><li><b><i>Note: The Internet Marketing Specialist- Strategy Track is not a client-facing position</i></b></li><div><br></div><div><br></div><div><span style=\"font-size: 24px\">Compensation</span></div><div>Negotiable, based on experience</div><div><span style=\"font-size: 11pt\">Annual merit-based increases</span></div><div><br></div><div><span style=\"font-size: 24px\">Working Hours</span></div><div><br></div><div><b>Asia (Philippines / Indonesia)</b></div><div>This position requires overlapping hours from 3:30 AM EST - 12:00 PM EST (New York Time Zone) Monday - Friday. </div><div><br></div><div><b>Africa / Europe (Ghana, UK, Ireland, Kenya, etc) </b></div><div>This position requires overlapping hours from 6:00 AM EST - 2:30 PM EST, Monday - Friday. The 40 hours of work doesn’t include any lunch or breaks.&nbsp;&nbsp;</div><div><br></div><div>*** This excludes South Africa. South Africa has additional hours options. </div><div><br></div><div><b>North America &amp; South America</b></div><div>This position requires overlapping hours from 8:00 AM EST - 4:30 PM EST, Monday - Friday. The 40 hours of work doesn’t include any lunch or breaks.&nbsp;&nbsp;</div><div><br></div><div><span style=\"font-size: 18px\">Check out our culture on social media:</span></div><div><a href=\"https://www.instagram.com/webfx\" class=\"postings-link\">Instagram</a></div><div><a href=\"https://twitter.com/webfx\" class=\"postings-link\">Twitter</a></div><div><a href=\"https://www.facebook.com/webfxinc/\" class=\"postings-link\">Facebook</a></div><div><br></div><div>Please submit a resume or CV (in English) to be considered for this opportunity.</div><div><br></div><div><i style=\"font-size: 11pt\">*You don't need to apply more than once, even if you're interested in multiple positions - you can simply let us know! We consider all open roles when reviewing resumes and applications!&nbsp;</i></div><div><br></div><div>WebFX is an Equal Opportunity Employer, committed to providing and fostering an inclusive environment where all people, including women, minorities, LGBTQ+, and other underrepresented groups, are supported, respected, and encouraged to excel within STEM careers. Our goal as an organization is to empower our team to achieve their personal best, bring people together, and provide equal opportunity to do so regardless of race, age, gender, sexual orientation, religion, physical ability or disability, or political affiliation. <a href=\"https://equality.webfx.com/\" class=\"postings-link\">You can learn more on our website here</a>!</div><div><br></div><div>WebFX is a proud Google Premier Partner with 6 offices in the US as well as an office in Guatemala and another in Cape Town, South Africa, where we are a registered employee as WebFX South Africa! We are continuing to expand worldwide and would love for you to be a part of that! In fact, we doubled in size in the past 5 years and are projecting to once again double in size and be a global, publicly traded tech company by the year 2030 - operating in every continent, servicing clients globally. We currently have talented team members across the globe (representing 18+ Countries) who work remotely full time and have done so for 10+ years.</div><div><br></div><div><span style=\"font-size: 11pt;\">No matter where you’re located, we’d love to have you join our mission of providing world-class digital marketing solutions to mid-size businesses on a global scale. We thrive on driving business growth for our clients and are looking for people who take pride in their marketing efforts and enjoy having fun at the same time. Sound like you? Great! Keep reading:</span></div><div><br></div><div><span style=\"font-size: 24px;\">Why Choose WebFX</span></div><div><br></div><div>We've been named the #1 best place to work in our headquarter's home state of Pennsylvania for 9 years in a row and offer the same culture and benefits to our global, remote team members. Along with a very competitive base pay, we offer company profit sharing, performance bonuses, On-going learning bonuses (yes, you get paid to learn!) and time zone differential pay. World class digital marketing training (Organic SEO, Local SEO, PPC, Google analytics + Studio, etc), long term career track, Health Insurance (including dental, vision, remote doctor, etc), and there's seriously a ton of other benefits! To name just a few:</div><div><br></div><div>- If you’re located in one of our operating countries (Guatemala  or South Africa), this is a Full-time (non-contract based) position. Either way, WebFX offers long term stability to all of our FXFamily members. In fact, many of our global/remote team members have been with WebFX for 9+ years and we’re hopeful you can be too!&nbsp;</div><div>- We put our people first, it’s as simple as that. You’re never on your own - when you run into inevitable challenges, we’re there to support you along the way!</div><div>- Long-lasting relationships with both clients and team members due to consistently low turnover rates that are simply unheard of in our industry, because again, we put our people first.</div><div>- Fully Remote or hybrid/in-office options if you prefer and are within commuting distance of one of our international locations (Antigua, Guatemala and Cape Town, South Africa). <span style=\"font-size: medium;\">🏡</span></div><div>- Fully equipped in-home office setup including computer, dual large monitors, headset, seriously fast internet, generator and more! 🖥️</div><div>- Multiple schedule options from which to choose. Depending on the hours you select, you will receive additional pay for overlapping our hours! <span style=\"font-size: medium;\">💰</span></div><div>- Be part of a rapidly growing company that at the same time only partners with clients who share our values🌱📈</div><div>- Unrestricted access to our dozens of proprietary softwares/platforms our internal R&amp;D team has developed for our team’s exclusive use, in addition to access to the many 3rd party tools and softwares we utilize internally in order to WOW our clients.<a href=\"https://www.webfx.com/marketingcloudfx/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\"> You can learn more about just some of our proprietary tools here</a>!</div><div>- Merit-based promotional structure</div><div>- <span style=\"font-size: 11pt;\">We have a very strong commitment to giving back globally - in fact, it’s one of our values here at WebFX. As a member of our FXFamily, you get to be a large part of that simply by achieving your goals - since 2014, we’ve committed to donating globally through our FXBuilds program. </span><a href=\"https://www.webfx.com/about/fxbuilds/\" style=\"font-size: 11pt;\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">You can learn more about that here</a><span style=\"font-size: 11pt;\">!</span></div><div><br></div><div><span style=\"font-size: 24px;\">What You'll Get</span></div><div><br></div><div><span style=\"font-size: 24px;\">World-Class Training and Ongoing Career Development</span></div><div><br></div><div>- No matter your level of experience, our “Bootcamp” web marketing training program is provided for all new WebFX “family members” to learn, grow and develop in and out of the office with the hard skills necessary to be successful in their position.&nbsp;</div><div>- From training with our Sr Digital Marketers to access to countless industry leading online training resources/courses/tutorials to getting experience with nearly 1,500+ different clients with various platforms, digital services and in every industry you can think of (and then some), our training program is simply unrivaled!</div><div>- Training doesn’t stop after your initial training period, we offer career development training and monthly Lunch-and-Learns with our state-of-the-art training amenities to facilitate departmental trainings, industry-related updates, and more!</div><div>- FXLearns program – where you get incentives for taking advantage of our countless industry training resources</div><div>- After 1,500+ clients, we’ve been able to truly master our processes and procedures – you will be trained on all of those - no need to develop how to do things (unless you want to help us continually improve that process!) – because we refuse to ever stagnate, we are always pushing the envelope to make those processes 1% better too!&nbsp;</div><div><br></div><div><br></div><div><span style=\"font-size: 24px;\">Opportunities for Growth</span></div><div><br></div><div>WebFX grew 250%+ over the past 3 years both locally and globally, and merit-based promotional opportunities are abundant if you're meeting or exceeding position performance metrics. We believe in growing and promoting our internal team first and foremost. In fact, 95% of our promotions are internal! All team members have a very clearly defined progression path, so you know exactly what is expected of you so you can put your career in your own hands. And what’s more, you’re not expected to know it all - we believe in continually striving to be an expert in your subject matter of expertise – so while we will purposely challenge you to grow in SEO/PPC/Google Analytics, we are a full service agency that has experts in other departments that handle everything else - from link building, social media, web design and web development. So you can truly master your trade.</div><div><br></div>","tags":"[\"management\"]","pubDate":"2024-07-10 09:34:18.169","link":"https://jobs.lever.co/webfx/af7ba25a-78a5-41ed-84ef-1d37a2f4c8a5","savedDate":"2024-07-10 12:55:08.964","slug":"internet-marketing-account-strategist-local-seo-webfx-5102"},{"id":3073940309,"title":"Accounts Receivable Specialist, Bi-Lingual (English/Portuguese)","company":"Circle","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3b00b20d-12c8-4ed9-ae9e-97d8601567b2-1706111761671.png","description":"<div><b style=\"font-size: 18px\">About Us</b></div><div>Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.</div><div><br></div><div>We’re proud to be a fully remote company of around 150 (and growing!) team members from 30+ countries around the world. We strive to find exceptional talent, empower them to do their best work, and in turn, have a meaningful impact in their own lives. We don’t track hours, but we manage for outcomes in an a-synchronous culture.</div><div><br></div><div>Twice a year, we bring the whole company together for incredible company retreats in beautiful places around the world!</div><div><br></div><div><b style=\"font-size: 18px\">About the role</b></div><div>Circle is laying the groundwork to move aggressively up-market. These new mid-market and enterprise accounts (”MM”) will require more payment flexibility and dedicated care from Circle’s finance team. As the Accounts Receivable (AR) Specialist, you will connect with and nurture customer relationships to ensure our order-to-cash process goes as smoothly as possible.</div><div><br></div><div>Since this is a brand-new role, you will have the unique opportunity to design and implement all accounts receivable processes from scratch. This means you will be able to set the foundation and establish best practices that will shape how AR functions within the organization. But don't worry; you will have the rest of our small but mighty finance team to support you every step of the way.</div><div><br></div><div><b>We have a strong preference for candidates in AMER time zones (North or South America).</b></div><div><br></div><div><b>This role requires bi-lingual fluency in both English and Portuguese.</b></div><div><span style=\"font-size: 13.3333px\">The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.</span></div><h3>What you’ll be doing</h3><li>Build the Accounts Receivable function from scratch.</li><li>Monitor billing process automated by Stripe for small business (SMB) accounts.</li><li>Process billing for mid-market (MM) accounts.</li><li>Maintain accounts receivable records to ensure customer accounts are up-to-date.</li><li>Monitor and act on aged balances and delinquencies, working with customer support to solve delinquent accounts for our SMB customers, and monitoring and collecting accounts receivable for our MM customers directly (proactive &amp; reactive).</li><li>Monitor renewals for MM accounts.</li><li>Monitor and act on fraud prevention tactics.</li><li>Monitor and solve customer disputes.</li><li>Report on AR metrics.</li><li>Identify uncollectible accounts for write-off.</li><li>Support financial month-end closing.</li><li>Collaborate with cross-function teams, including Sales, Customer Support, and Customer Success.</li>,<h3>What you’ll need to be successful</h3><li>Strong alignment with our values.&nbsp;<a href=\"https://www.notion.so/Circle-Careers-223a15ea312c4922b793593d07add7fe?pvs=21\" class=\"postings-link\">Find our values on our career page</a>&nbsp;if you haven’t read up on them yet.</li><li>You are proficient in English (spoken, written, and reading) at a&nbsp;<a href=\"https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/\" class=\"postings-link\">CEFR Level C1</a>&nbsp;/&nbsp;<a href=\"https://www.govtilr.org/\" class=\"postings-link\">ILR Level 5</a>, as well as Portuguese (bi-lingual).</li><li>You are able to work in a fast-paced environment, manage multiple projects simultaneously, and meet deadlines.</li><li>You have strong spreadsheet skills (eg. Google Sheets, MS Excel, etc.)</li><li>You have at least 2 years of experience working in a SaaS Accounts Receivable role.</li><li>You are customer-focused and enjoy nurturing relationships with customers.</li><li>You have excellent written and verbal communication skills and can clearly and concisely communicate with clients.</li><li>You are analytical, have strong attention to detail and thrive as a problem-solver.</li><li>You are a team player with a positive attitude, a strong work ethic, and a commitment to continuous improvement.</li><li>You are able to work independently and collaborate effectively in a team environment.</li><li>You thrive with autonomy and are self-motivated. We’re a fully remote team. We take care of each other and like having fun, but we’ll never be in an office together.</li>,<h3>Bonus points</h3><li>You have experience working with Stripe.</li><li>You have experience working with CPQ tools.</li><div><span style=\"font-size: 18px\"><b>The fun stuff</b></span></div><div>Fully remote:&nbsp;work from anywhere in the world!</div><div>Autonomy and trust to do your job:&nbsp;we care about outcomes over everything else.</div><div>Paid time away:&nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.</div><div>Generous U.S. benchmarked compensation&nbsp;and startup equity no matter where you are in the world.*</div><div>Awesome medical coverage&nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*</div><div>Parental leave&nbsp;for parents expanding their family, or just starting one.</div><div>Home office stipend&nbsp;to help you get up and running.</div><div>Learning &amp; development stipend&nbsp;to help you level up your professional skills.</div><div>Annual bonus potential&nbsp;for roles that don't already receive variable income or commission.</div><div>Company retreats:&nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.</div><div>Check out our&nbsp;<a href=\"https://careers.circle.so/\">Careers</a>&nbsp;page for more.</div><div><span style=\"font-size: 10px\">*</span><i style=\"font-size: 10px\">Your role, location and unique circumstance may affect this.</i></div><div><br></div><div><span style=\"font-size: 18px\"><b>Diversity, Equity &amp; Inclusion</b></span></div><div>As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&nbsp;U.S. benchmarked&nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.</div><div><br></div><div><span style=\"font-size: 18px\"><b>Equal Employment Opportunity</b></span></div><div>Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.</div><div>If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.</div>","tags":"[\"Finance\",\"aws\"]","pubDate":"2024-07-09 21:00:53.908","link":"https://jobs.lever.co/circleco/10e70043-cf9d-4711-a163-30c8705c2427","savedDate":"2024-07-10 12:55:08.961","slug":"accounts-receivable-specialist-bi-lingual-english-portuguese-circle-3881"},{"id":9422395415,"title":"HRBP Lead","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;About the job:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Human Resources Business Partner Lead (HRBP) at Scroll, you will play a crucial role in aligning our ambitious business objectives with the needs of our diverse and rapidly growing workforce. You&#39;ll serve as a strategic advisor to business unit leaders, providing guidance on HR-related issues and initiatives that drive organizational success and innovation. Your proactive approach will help foster a dynamic and inclusive work environment where talent thrives and contributes to our pioneering efforts in blockchain technology.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Partner closely with team leaders to develop and implement HR strategies that support our fast-paced and agile operating environment and growth objectives.&lt;/li&gt;\n&lt;li&gt;Act as a trusted advisor and advocate for employees and managers, ensuring their needs are met while aligning with Scroll’s overall goals.&lt;/li&gt;\n&lt;li&gt;Proactively assess and diagnose organisation issues; recommend and implement solutions.&lt;/li&gt;\n&lt;li&gt;Lead people programs initiatives in end to end employee lifecycle from onboarding to off-boarding, and retention strategies tailored to the unique challenges and opportunities of a startup in the blockchain industry.&lt;/li&gt;\n&lt;li&gt;Work closely with managers and employees to improve work relationships, build morale, and increase productivity and retention.&lt;/li&gt;\n&lt;li&gt;Drive performance management processes and coach managers on effective feedback and development practices to support continuous growth and excellence.&lt;/li&gt;\n&lt;li&gt;Collaborate with cross-functional teams to design and implement innovative employee growth programs, and initiatives that reflect our values and promote a culture of innovation and transparency.&lt;/li&gt;\n&lt;li&gt;Provide expertise in organizational design, change management, and workforce planning to support scalability and operational efficiency.&lt;/li&gt;\n&lt;li&gt;Handle employee relations issues and conduct thorough investigations with a solutions-oriented approach, maintaining fairness and compliance with Scroll policies and legal regulations.&lt;/li&gt;\n&lt;li&gt;Stay current with industry trends and best practices in blockchain technology and startup culture to ensure our HR strategies remain cutting-edge and competitive.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Qualifications:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;7+ years of HRBP / People Partnering experience, with strong background as HR Business Partner, Talent Development/Talent Management, ideally within a high-growth blockchain/crypto, or scaling Tech company.&lt;/li&gt;\n&lt;li&gt;Proven experience in managing highly impactful people programs, talent management, and employee development initiatives in a rapidly growing and changing web3 environment.&lt;/li&gt;\n&lt;li&gt;Possess strong problem-solving skills, the ability to think strategically, and the capacity to drive impactful change with extreme ownership and persuasive communication skills.&lt;/li&gt;\n&lt;li&gt;A meticulous and professional approach to managing tasks and supporting team growth and scalability.&lt;/li&gt;\n&lt;li&gt;A positive attitude, strong ownership mentality, and adaptability in a rapidly changing business climate.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;/strong&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A mission-led, collaborative culture&lt;/li&gt;\n&lt;li&gt;Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum&lt;/li&gt;\n&lt;li&gt;Competitive salary package / generous paid time off / annual growth budget&lt;/li&gt;\n&lt;li&gt;100% remote from any location with flexible hours&lt;/li&gt;\n&lt;li&gt;Home office set up / co-working membership allowance&lt;/li&gt;\n&lt;li&gt;Private healthcare in selected countries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"Finance\",\"management\",\"legal\"]","pubDate":"2024-07-09 05:41:49.000","link":"https://boards.eu.greenhouse.io/scrollio/jobs/4363288101","savedDate":"2024-07-10 12:55:08.959","slug":"hrbp-lead-scroll-8732"},{"id":7088009082,"title":"Product Designer (UI/UX)","company":"Yassir","image":"https://remotive.com/job/1922445/logo","description":"<div><strong><span style=\"\">Yassir</span></strong><span style=\"\"> is the leading super App in the Maghreb region set to changing the way daily services are provided. It currently operates in </span><strong><span style=\"\">45 cities across Algeria, Morocco and Tunisia with recent expansions into France, Canada and Sub-Saharan Africa</span></strong><span style=\"\">. It is backed (~</span><strong><span style=\"\">$200M in funding</span></strong><span style=\"\">) by VCs from Silicon Valley, Europe and other parts of the world. </span></div>\n<div><span style=\"\">We offer on-demand services such as ride-hailing and last-mile delivery. Building on this infrastructure, we are now introducing financial services to help our users pay, save and borrow digitally. </span></div>\n<div><span style=\"\">Helping usher the continent into a digital economy era. We’re not just about serving people - we’re about creating a marketplace to bring people what they need while infusing social values.</span></div>\n<div> </div>\n<div><span style=\"\">ABOUT THE ROLE</span></div>\n<div> </div>\n<div>We are in search of a talented and motivated individual to join our team and start working on all sorts of interesting products.</div>\n<div> </div>\n<div>‍As a Product designer at Yassir, you will be responsible for driving product design initiatives from inception through execution. In this role, you will collaborate closely with product managers, engineers, analysts, and other cross-functional team members within the organization to ensure that our products amaze and delight our users.</div>\n<div> </div>\n<div>We are looking for an experienced product designer to contribute to the effort in revamping our service. At Yassir, we put our users and data first. So we need Product Designers with smart UI/UX skills who are continuously adapting and excited to work on products that make the life of our people easier by the day. In this role, you will work cross-functionally to design and guide products from conception to launch by connecting the technical and business worlds and designing the product workflow from beginning to end.</div>\n<p><br><br></p>\n<div class=\"h3\">TASKS</div>\n<ul style=\"\">\n<li style=\"\">Be responsible for creating end-to-end experiences, from start to finish.</li>\n<li style=\"\">Partner up with Product Managers to define design solutions.</li>\n<li style=\"\">Create and deliver high-quality user interfaces that help improve the overall design language of our products.</li>\n<li style=\"\">Have a 360º view of the area you're working on and the business in general.</li>\n<li style=\"\">Collaborate, assist and review junior designers.</li>\n<li style=\"\">Lead and participate in brainstorming sessions.</li>\n<li style=\"\">Present design projects to stakeholders and gather feedback.</li>\n<li style=\"\">Develop exhaustive design handoffs, and follow design implementations with developers.</li>\n<li style=\"\">Conduct design and usability tests.</li>\n<li style=\"\">Actively build and maintain internal design system.</li>\n<li style=\"\">Suggest improvements that contribute to the overall direction of our products and strategy.</li>\n<li style=\"\">Participate in shaping the design culture at YASSIR.</li>\n<li style=\"\">Help maintain and improve the internal design process.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">REQUIREMENTS</div>\n<ul style=\"\">\n<li style=\"\">4+ years experience designing digital experiences, in a professional environment.</li>\n<li style=\"\">Portfolio showcasing your work and great visual skills and attention to detail.</li>\n<li style=\"\">Experience designing for iOS, Android, and Web.</li>\n<li style=\"\">Ability to dissect and simplify complex problems.</li>\n<li style=\"\">High understanding of iOS and Android design language and system behavior and platform standards in general.</li>\n<li style=\"\">Advanced design tools mastery, such as Sketch or Figma.</li>\n<li style=\"\">High proficiency in producing high-fidelity prototypes using tools such as Principle, ProtoPie, Origami... etc.</li>\n<li style=\"\">Complete mastery of design principles.</li>\n<li style=\"\">Strong knowledge of product development process.</li>\n<li style=\"\">Always up to date with design industry news and best practices.</li>\n<li style=\"\">Large knowledge of design patterns.</li>\n<li style=\"\">Great written and verbal communication skills.</li>\n<li style=\"\">Team player, you enjoy working in teams and sharing your experience and knowledge with others.</li>\n<li style=\"\">Ability and willingness to learn and develop strong design leadership skills.</li>\n<li style=\"\">Experience working and building Design Systems.</li>\n<li style=\"\">A computer science graduate, relevant degree, or equivalent.</li>\n<li style=\"\">Experience in a rapidly growing company in the food delivery or on-demand service space is a plus.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">BENEFITS</div>\n<ul style=\"\">\n<li style=\"\">🚀 Perfect timing with renowned investors to build something great</li>\n<li style=\"\">🎯Outstanding mentors who will support you in your growth</li>\n<li style=\"\">💸 Attractive salary and you even get a stake in the company</li>\n<li style=\"\">📈 Extremely steep learning curve with own responsibility and intensive support</li>\n<li style=\"\">📣 Learn to be pragmatic and make quick and sustainable decisions</li>\n<li style=\"\">⏱️ Flexible working hours, because we care about your outcome and not output</li>\n</ul>\n<div> </div>\n<p><br><br></p>\n<div class=\"h3\">WHY YOU SHOULD JOIN YASSIR</div>\n<ul style=\"\">\n<li style=\"\">Join one of the fastest-growing tech companies in North Africa.</li>\n<li style=\"\">Make a real impact on the world by helping us bring affordable financial and on-demand services to millions of Africans.</li>\n<li style=\"\">Work on some really hard technical challenges from identity infrastructure for Africans, digital payment networks to complex mapping and routing systems across the continent.</li>\n<li style=\"\">We are the first Algerian startup to go through Y Combinator program and we’re backed by top investors.</li>\n</ul>\n<div> </div>\n<div> </div>\n<div> </div>\n<div>At Yassir, we believe in the power of diversity and the importance of an inclusive culture. So, if you're ready to bring your unique perspective and experiences to the table, then we're excited to listen.</div>\n<div> </div>\n<div>Don't just apply for a job, come and be a part of our journey. Let's create a better tomorrow together.</div>\n<div> </div>\n<div>We look forward to receiving your application!</div>\n<div> </div>\n<div>Best of luck,</div>\n<div>Your Yassir TA Team</div>\n<div> </div>\n<div> </div>\n<img src=\"https://remotive.com/job/track/1922445/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"prototyping\"]","pubDate":"2024-07-09 05:21:20.000","link":"https://remotive.com/remote-jobs/design/product-designer-ui-ux-1922445","savedDate":"2024-07-10 12:55:08.953","slug":"product-designer-ui-ux-yassir-7721"},{"id":5063572192,"title":"User Retention Campaigns Specialist, UX","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt\">We are currently looking for a full-time</span><b style=\"font-size: 11pt\"> User Retention Campaigns Specialist, User Experience </b><span style=\"font-size: 11pt\">to join our Airalo Growth department. Being one of the members of a lean team, you will have an opportunity to impact the overall growth of the organization. Your role will involve creating and implementing successful retention campaigns to improve the number of returning users and revenue from existing users on a monthly and quarterly basis, thereby improving customer retention and customer lifetime value. The ideal candidate should possess a thorough understanding of customer behavior, excellent analytical skills, and proven experience in executing effective retention campaigns. This region-agnostic position supports Regional Teams by serving as the primary contact for administering our MarTech platforms, assisting in the development and execution of campaigns, providing precise and actionable reporting and insights.</span></div><h3>Responsibilities include but are not limited to:</h3><li>Developing and managing campaign calendars and schedules to ensure timely execution, using various channels such as push notifications, email and automated journeys</li><li>Collaborating with cross-functional teams to optimize retention campaigns</li><li>Working closely with our Product, Engineers and Creative Designers to elevate communications</li><li>Monitoring campaign performance and reporting on key metrics, including customer retention, engagement, and revenue</li><li>Continuously test (A/B testing) and optimize campaigns to improve results</li><li>Stay up-to-date on industry trends and best practices in retention marketing; Constantly learning new ways to utilize common industry tools of choice (e.g. CleverTap or Braze)</li><li>Taking part in the whole growth experimentation cycle - from ideation through implementation and analysis</li><li>Doing data analysis, user segmentation, and reporting as needed</li><li>Working closely with our Growth, Product and Support teams to gather insights from our users and suggest improvements</li>,<h3>Must-haves:</h3><li>A minimum of 2-3 years experience in planning and executing marketing campaigns with proficiency in CRM tools such as Clevertrap/Moengage/Braze/etc.</li><li><a href=\"http://etc.Strong\">Strong</a> analytical skills, hands on experience with Excel and data visualization</li><li>Experience creating audience segmentation, visual reports, and ad hoc analysis</li><li>Experience in mobile analytics on different platforms (e.g. GA4, Firebase, Adjust)Perfect verbal and written communication skills in English</li>,<h3>Good to have:</h3><li>Prior experience and training in neuromarketing</li><li>Prior experience in mobile app marketing</li><li>Certificates and courses in data &amp; analytics, digital marketing and research methods</li><li>Understanding of technical languages (e.g. SQL, HTML, CSS, etc.)</li><li>Prior work experience in telecommunications or travel industryKnowledge of eSIM and GSMA related technologies and services</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\"]","pubDate":"2024-07-08 17:27:27.298","link":"https://jobs.lever.co/airalo/34144d58-f528-43a9-bcc0-2f1dea36a053","savedDate":"2024-07-10 12:55:08.962","slug":"user-retention-campaigns-specialist-ux-airalo-275"},{"id":5751664508,"title":"Head of Business Development","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;About the job:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Head of BD will lead and drive Scroll’s global sales and partnership strategies. This senior role is pivotal in expanding our ecosystem, establishing long-term relationships, and achieving revenue growth. The successful candidate will manage a team of partnership managers and collaborate with cross-functional teams to align sales strategies with the company’s vision. This role will report into the Head of Growth.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;Key Responsibilities:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Strategic Leadership:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and execute comprehensive sales and partnership strategies to drive revenue growth and ecosystem expansion.&lt;/li&gt;\n&lt;li&gt;Identify and pursue new business opportunities, strategic alliances, and partnerships.&lt;/li&gt;\n&lt;li&gt;Lead, mentor, and manage a team of partnership managers and sales professionals.&lt;/li&gt;\n&lt;li&gt;Create and execute a long-term vision for sales and partnerships to ensure sustainable growth and alignment with Scroll’s strategic objectives.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Partnership and Revenue Development:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Cultivate and enhance relationships with key partners, including dApps, liquidity providers, and other stakeholders in the Web3 ecosystem.&lt;/li&gt;\n&lt;li&gt;Support the integration and onboarding of new partners, collaborating with the International Markets team.&lt;/li&gt;\n&lt;li&gt;Represent Scroll at industry events and conferences to build and maintain a robust network.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Market Analysis and Strategy Execution:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Analyze market trends, competitor activities, and customer feedback to identify growth opportunities and areas for improvement.&lt;/li&gt;\n&lt;li&gt;Work closely with product, marketing, and development teams to ensure alignment of sales strategies with product offerings and market needs.&lt;/li&gt;\n&lt;li&gt;Develop sales materials, presentations, and other collateral to support business development efforts.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Performance Management:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Set and monitor key performance indicators (KPIs) for the sales and partnerships team. TVL, volume and projects.&lt;/li&gt;\n&lt;li&gt;Manage and prioritize a diverse portfolio of projects and partnerships, ensuring alignment with Scroll’s vision.&lt;/li&gt;\n&lt;li&gt;Provide regular reports and updates to the executive team on sales performance, market trends, and strategic initiatives.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;hr&gt;\n&lt;p&gt;&lt;strong&gt;Requirements:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven experience in a senior sales or partnerships role within the blockchain, DeFi, or technology sectors.&lt;/li&gt;\n&lt;li&gt;Excellent leadership and team management skills, with the ability to inspire and motivate a remote team.&lt;/li&gt;\n&lt;li&gt;Exceptional communication and negotiation skills, with the ability to articulate complex issues clearly and persuasively.&lt;/li&gt;\n&lt;li&gt;Ability to analyze and interpret market data, trading performance, and emerging trends.&lt;/li&gt;\n&lt;li&gt;Willingness to travel for community events and business meetings.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to haves:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience working in startups or high-growth environments.&lt;/li&gt;\n&lt;li&gt;Deep engagement and awareness of the latest crypto trends&lt;/li&gt;\n&lt;li&gt;Active on platforms like Twitter/X, Linkedin, Medium and Discord.&lt;/li&gt;\n&lt;li&gt;Public speaking experience and the ability to represent Scroll at industry events.&lt;/li&gt;\n&lt;li&gt;Bachelor’s or Master’s degree in Business, Marketing, or a related field.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A mission-led, collaborative culture&lt;/li&gt;\n&lt;li&gt;Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum&lt;/li&gt;\n&lt;li&gt;Competitive salary package / generous paid time off / annual growth budget&lt;/li&gt;\n&lt;li&gt;100% remote from any location with flexible hours&lt;/li&gt;\n&lt;li&gt;Home office set up / co-working membership allowance&lt;/li&gt;\n&lt;li&gt;Private healthcare in selected countries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"Finance\",\"management\"]","pubDate":"2024-07-08 14:57:23.000","link":"https://boards.eu.greenhouse.io/scrollio/jobs/4363082101","savedDate":"2024-07-10 12:55:08.959","slug":"head-of-business-development-scroll-9104"},{"id":9648664533,"title":"Community Manager - Turkey","company":"Manta Network","image":"https://manta.network/assets/img/logo.svg","description":"<div><span style=\"font-size: 32px\">About p0x labs</span></div><div><br></div><div>p0x labs, a group developing technologies behind projects including Manta Network, delivers privacy for web3 applications and decentralized assets through use of zero-knowledge proofs. The project is built in accordance with first principles, <span style=\"font-size: 11pt\">by applying cutting-edge cryptographic constructions such as zkSNARKs to design and deploy protocols with high performance and strong privacy/security guarantees. </span></div><div><br></div><div><span style=\"font-size: 11pt\">Manta Network is supported by leading investors including Polychain and Binance Labs. The founding team has extensive experience in the blockchain space and come from educational institutions including Harvard and MIT, and leading web3 projects such as Algorand. If you are excited about building privacy-preserving solutions using zero-knowledge proofs, building blockchain applications, or learning about Polkadot ecosystems, then we want to hear from you.</span></div><div><br></div><div><span style=\"font-size: 16px\">We are looking for a Community Manager to join the Manta Network team and help build awareness and traction for the project on a global scale. The ideal candidate is an experienced crypto community manager or marketer that has a track record of building and engaging with crypto and web3 developer communities. You must speak Turkish fluently; you do not have to reside in </span>Türkiye.</div><div><span style=\"font-size: 16px\">We are looking for a Community Manager to join the Manta Network team and help build awareness and traction for the project on a global scale. The ideal candidate is an experienced crypto community manager or marketer that has a track record of building and engaging with crypto and web3 developer communities. You must speak Turkish fluently; you do not have to reside in </span>Türkiye.</div><h3>Responsibilities</h3><li>Translate Manta Network content into Turkish across social media platforms and blogs</li><li>Communicate with the Turkish-speaking community to provide announcements, news, and updates</li><li>Design local campaigns for the Turkish-speaking community to drive engagement and achieve KPIs</li><li>Track and analyze the growth of the Turkish-speaking community to identify new opportunities for engagement</li><li>Build and maintain relationships with Turkish-speaking influencers and KOLs</li><li>Accurately represent the Manta Network brand</li><li>Identify key events and speaking opportunities</li><h3>Qualifications</h3><li>A strong passion for web3 and privacy</li><li>Excellent communication skills with high EQ</li><li>Proven experience building crypto and developer communities</li><li>Experience managing others</li><li>Excellent writing skills in your local language</li><li>The ability to simplify complex concepts in a clear and accessible way</li><li>Experience launching events (both virtual and physical)</li><li>Familiar with crypto and blockchain concepts</li><li>Experience with digital marketing and social media</li><div><span style=\"font-size: 24px\">Life at p0x labs</span></div><div><br></div><div>p0x labs is comprised of a diverse and global group of core contributors. We offer a friendly, flexible work environment that provides full-remote opportunities. Our team is full of bright and motivated minds. Despite our geographical diversity, we host events both virtual and physical to promote a strong culture. We also pride ourselves on our ability to move fast as a cohesive team.</div><div><br></div><div><span style=\"font-size: 18px\">Additional Benefits with p0x labs</span></div><div>- Competitive compensation</div><div>- Unlimited PTO</div><div>- Token allocation</div><div>- Remote-first</div><div>- Inclusive team</div><div>- Education opportunites</div><div>- Conference travel</div><div>- Many other benefits! </div><div><span style=\"font-size: 32px;\">About p0x labs</span></div><div><br></div><div>p0x labs, a group developing technologies behind projects including Manta Network, delivers privacy for web3 applications and decentralized assets through use of zero-knowledge proofs. The project is built in accordance with first principles, <span style=\"font-size: 11pt;\">by applying cutting-edge cryptographic constructions such as zkSNARKs to design and deploy protocols with high performance and strong privacy/security guarantees. </span></div><div><br></div><div><span style=\"font-size: 11pt;\">Manta Network is supported by leading investors including Polychain and Binance Labs. The founding team has extensive experience in the blockchain space and come from educational institutions including Harvard and MIT, and leading web3 projects such as Algorand. If you are excited about building privacy-preserving solutions using zero-knowledge proofs, building blockchain applications, or learning about Polkadot ecosystems, then we want to hear from you.</span></div>","tags":"[]","pubDate":"2024-07-08 10:20:41.751","link":"https://jobs.lever.co/MantaNetwork/ec011ea4-445f-48f7-b6c2-2914c82cf9f6","savedDate":"2024-07-10 12:55:08.965","slug":"community-manager-turkey-manta-network-8293"},{"id":1567252432,"title":"Senior Software Engineer (Payments)","company":"Pluto Card","image":"https://pbs.twimg.com/profile_images/1520019984780513281/qnVtutKu_400x400.jpg","description":"<p>Pluto is a modern financial operating system for global businesses. We combine our global payments infrastructure with intelligent workflow automation to provide businesses with unparalleled insights, control, and automation over their payments.</p><p>Pluto is a venture-capital funded company backed by top-tier Silicon Valley investors and built by folks from some of the best technology institutions in the world -- Google, Shopify, Square, PayPal, Cash App, Uber, Y Combinator, and more</p><p>We are reinventing corporate finance for the modern age and are solving challenging problems in the B2B payments space. With a stronghold in Dubai (UAE) and sights set on expansion, we're now looking for a seasoned&nbsp;<strong>Senior Software Engineer</strong> to help shape our next chapter.<br></p><h3>What You’ll Do</h3><ul> <li>Design and develop Pluto’s flagship products and build complex, resilient payments infrastructure</li> <li>Play a pivotal role in architecting and building critical payment processing, ledgering, and financial reconciliation systems</li> <li>Architect and implement robust integrations with various payment rails and financial APIs</li> <li>Lead the development lifecycle of features and work streams from design to deployment</li> <li>Become a voracious problem solver who can tackle difficult issues on tight timelines, manage cross-functional dependencies and set an exemplary bar for engineering within the organization</li> <li>Write and maintain clean, maintainable and testable code, leveraging design patterns and architecture where appropriate</li> <li>Participate in code reviews, pair-programming sessions and provide constructive feedback to peers</li> <li>Develop a strong understanding of the domain and bring a deep product and design mindset while building solutions</li> </ul><h3>Bonus Points</h3><ul> <li>Previous work experience in the banking or fintech</li> <li>Familiarity with financial industry frameworks and technologies such as payment gateways, transaction processing systems, or financial messaging protocols (e.g ISO 20022, ISO8583, SWIFT, SEPA, or Open Banking APIs)</li> <li>Familiarity with cloud platforms such as AWS or Azure and experienced in deploying and managing applications in a cloud environment.</li> <li>Experience with Kubernetes or other container orchestration platforms</li> <li>Experience with JVM tuning, configuration &amp; metrics</li> </ul><h3><strong>Our Tech Stack</strong></h3><ul> <li> <strong>Frontend:</strong>&nbsp;React, TypeScript</li> <li> <strong>Backend:</strong>&nbsp;Kotlin, GraphQL, Temporal</li> <li> <strong>Database:</strong>&nbsp;Postgres, AWS Aurora</li> <li> <strong>Infrastructure:</strong>&nbsp;AWS, Kubernetes, Terraform</li> <li> <strong>Observability:</strong>&nbsp;Datadog, Cloudwatch, Lightstep</li> </ul><h3>Requirements: </h3><h3><strong>Who We're Looking For</strong></h3><ul> <li>5+ years of professional experience as a software engineer (with a focus on payments/fintech)</li> <li>Extensive experience in developing and integrating with banking and card scheme protocols</li> <li>Experience in working with third-party APIs and integrating external financial services into backend systems</li> <li>Mastery in at least one programming language (e.g Kotlin, Java, Go, Scala, Rust)</li> <li>Deep understanding of relational and non-relational databases and distributed systems</li> <li>Strong grasp of SQL and relational data modelling</li> <li>Experienced with API design and development (e.g GraphQL, REST, RPC)</li> <li>Experience in designing and developing scalable, secure and reliable backend systems.</li> <li>Strong understanding of SDLC, software design principles, architectural and integration patterns</li> <li>Strong problem-solving skills and ability to analyze and debug complex software systems</li> <li>Excellent communication and collaboration skills, with the ability to work effectively in cross-functional teams.<br> </li> </ul><h3><strong>Our Values</strong></h3><p>At Pluto, we live by the following core values:</p><ul> <li> <a href=\"https://handbook.gitlab.com/handbook/people-group/directly-responsible-individuals/\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Directly Responsible Individuals (DRI)</strong></a>: We empower team members with autonomy to own their projects and outcomes fully, fostering a culture of accountability, clarity and outsized impact. As the DRI you are the driver of success for your projects — proactively identifying, communicating and mitigating risks and resolving blockers to ensure success.</li> <li> <strong>Clear Communication</strong>: At Pluto, we emphasize clear, transparent communication as fundamental to our success. We strive for clarity, succinctness and transparency in all interactions, ensuring that every message is articulated clearly and understood universally across our teams. This commitment to clarity reduces misunderstandings and fosters a more productive environment especially for distributed teams.</li> <li> <strong>Systems Thinking &amp; First Principles Reasoning</strong>: We love to deconstruct problems and innovate from the ground up. By understanding complex systems and questioning assumptions, we are able to develop creative solutions to difficult problems.</li> <li> <strong>Fact-centric</strong>: We are intentional about questioning our assumptions, and bringing the facts to focus by diving into the data, quick-fire experimentation &amp; swift prototyping. We make room for varied perspectives &amp; calibrate our goals with metrics that track our progress, and accurately reflect reality.</li> </ul><h3>Benefits: </h3><ul> <li>Competitive compensation &amp; stock options so you have skin in the game</li> <li>Remote-first work environment</li> <li>We'll ship you a new MacBook</li> <li>Monthly fitness benefit up to $100 USD</li> <li>Home-office budget up to $1000 USD</li> <li>Discretionary learning budget</li> </ul>","tags":"[\"postgres\",\"typescript\",\"Finance\",\"engineering\",\"B2B\",\"database\",\"aws\"]","pubDate":"2024-07-07 00:00:00.000","link":"https://apply.workable.com/pluto-card/j/C6B14A470C","savedDate":"2024-07-10 12:55:08.957","slug":"senior-software-engineer-payments-pluto-card-8575"},{"id":8467345681,"title":"MARKETING ASSISTANT at PERSISTIQ (Work from anywhere in the world)","company":"Wishpond","image":"https://scontent.fcmb4-2.fna.fbcdn.net/v/t39.30808-6/273499217_5218973671480777_3308731762242867065_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=efb6e6&_nc_ohc=YDi_Wd17RD8AX9wXcyR&_nc_zt=23&_nc_ht=scontent.fcmb4-2.fna&oh=00_AfB4sOOYpj6VyDSuvvuqhVnZbH22m89SqG99HwaOa-uslw&oe=65BE4336","description":"<div><b style=\"font-size: 13.5pt\">PersistIQ currently has the position of Marketing Assistant available and we’re excited to tell you about it!</b></div><div><br></div><div><span style=\"font-size: 10.5pt\">&nbsp;</span><b style=\"font-size: 18pt\">ABOUT PERSISTIQ BY WISHPOND</b></div><div><span style=\"font-size: 12pt\">PersistIQ is a fast-growing, innovative tech company specializing in outbound sales solutions. We work with businesses of all sizes to create and execute outbound campaigns that leverage the power of email.&nbsp;PersistIQ is a subsidiary of Wishpond Technologies. Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses. Wishpond serves over 3,000 customers in various industries and sizes, from startups to large Fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company. </span></div><div><br></div><div><b style=\"font-size: 24px\">OVERVIEW</b></div><div><span style=\"font-size: 16px\">Are you a content wizard with a knack for compelling storytelling that captures hearts and minds? Do you dream in blog posts, live for the perfect video script, and have a sixth sense for optimizing conversion funnels? PersistIQ is on the hunt for a Marketing Assistant who can weave magic into our marketing strategies, working closely with our Head of Growth. This is your stage to shine, showcase your creativity, and be part of a dynamic team that’s redefining the marketing landscape.</span></div><div><span style=\"font-size: 10.5pt\">&nbsp;</span></div><div><b style=\"font-size: 24px\">RESPONSIBILITIES</b></div><div><span style=\"font-size: 10.5pt\">• </span><span style=\"font-size: 12pt\">Collaborate with the General Manager to craft and execute innovative content strategies that drive engagement and conversions.</span></div><div><span style=\"font-size: 10.5pt\">• </span><span style=\"font-size: 12pt\">Produce spellbinding content for our website, ensuring each word aligns with our brand voice and SEO goals.</span></div><div><span style=\"font-size: 10.5pt\">• </span><span style=\"font-size: 12pt\">Create blog content that not only ranks but resonates, turning readers into loyal followers and customers.</span></div><div><span style=\"font-size: 10.5pt\">• </span><span style=\"font-size: 12pt\">Script and develop video content that tells our story in a way that captivates and converts.</span></div><div><span style=\"font-size: 10.5pt\">• </span><span style=\"font-size: 12pt\">Dive deep into conversion funnel analytics, identifying opportunities for optimization and implementing strategies that enhance performance.</span></div><div><span style=\"font-size: 12pt\">• Other duties as assigned.</span></div><div><span style=\"font-size: 18pt\">&nbsp;</span></div><div><b style=\"font-size: 24px\">QUALIFICATIONS</b></div><div><span style=\"font-size: 10.5pt\">•</span><span style=\"font-size: 12pt\"> A creative soul with 1-2 years of experience in content creation, marketing, or a related field.</span></div><div><span style=\"font-size: 10.5pt\">• </span><span style=\"font-size: 12pt\">Exceptional writing and storytelling skills, with a portfolio that showcases your prowess across various mediums.</span></div><div><span style=\"font-size: 10.5pt\">• </span><span style=\"font-size: 12pt\">A keen understanding of SEO principles and how they intertwine with content creation to boost visibility and engagement.</span></div><div><span style=\"font-size: 10.5pt\">• </span><span style=\"font-size: 12pt\">Proficiency in content management systems and tools that bring your ideas to life.</span></div><div><span style=\"font-size: 10.5pt\">• </span><span style=\"font-size: 12pt\">Analytical agility, with an ability to glean insights from data and translate them into actionable growth strategies.</span></div><div><span style=\"font-size: 10.5pt\">• </span><span style=\"font-size: 12pt\">A team player who thrives in collaborative environments but can also steer the ship solo when needed.</span></div><div><br></div><div><b style=\"font-size: 24px\">WORK ENVIRONMENT</b></div><div><span style=\"font-size: 16px\">• Given the nature of this role, it is expected that the successful candidate will provide their own workstation, computer, headset, and have a fast and reliable internet connection. Certain roles will be required to utilize and or download company-approved software.</span></div><div><span style=\"font-size: 16px\">• This position is expected to work European time zones.</span></div><div><span style=\"font-size: 16px\">• Due to the nature of this role, we may verify backgrounds, including conducting employment references, criminal records, and credit checks.</span></div><div><span style=\"font-size: 16px\">• Once hired, the successful candidate must provide valid governmental photo ID and proof of residential address.</span></div><div>&nbsp;</div><div><b style=\"font-size: 24px\">GREAT REASONS TO APPLY FOR THIS ROLE</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">• Fully remote position allowing you to </span><b style=\"font-size: 16px\">work from your home anywhere in the world!</b></div><div><span style=\"font-size: 16px\">• Exciting and dynamic environment with a great leadership team&nbsp;</span></div><div><span style=\"font-size: 16px\">•&nbsp;Comprehensive training program and regular performance reviews to facilitate your success</span></div><div><span style=\"font-size: 16px\">•&nbsp;Competitive compensation based on experience and proven abilities</span></div><div><span style=\"font-size: 16px\">• Great referral programs with incentives and bonuses</span></div><div><span style=\"font-size: 16px\">•&nbsp;Unbelievable product discounts when you use our products for your own business</span></div><div><span style=\"font-size: 16px\">•&nbsp;A global workforce of multi-cultural and talented colleagues&nbsp;</span></div><div><span style=\"font-size: 16px\">• A close-knit operation with amazing growth opportunities for your personal development</span></div><div><span style=\"font-size: 16px\">• A high-growth SaaS technology company publicly traded on the TSX Venture Exchange</span></div><div><span style=\"font-size: 16px\">• Corporate headquarters in beautiful Vancouver, British Columbia, Canada</span></div><div><span style=\"font-size: 16px\">• Access to our education credits program and so much more!</span></div><div>&nbsp;</div><div><b style=\"font-size: 24px\">ABOUT US</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses.&nbsp; The cloud-based platform includes landing pages, social promotions, website pop-ups, online forms, and lead activity tracking. Wishpond has a dedicated team of professional project managers, designers, copywriters, and developers who provide marketing services tailored to our individual clients.</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">Wishpond serves over 3,000 customers in various industries and sizes, from startups to large fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company.</span></div><div><br></div><div><span style=\"font-size: 16px\"> To learn more about Wishpond Technologies, please visit our website or any of our social media platforms:</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">• Website: </span><a href=\"http://www.wishpond.com/\" style=\"font-size: 16px\" class=\"postings-link\">www.wishpond.com</a></div><div><span style=\"font-size: 16px\">• Instagram: @wishpondofficial</span></div><div><span style=\"font-size: 16px\">• Twitter: Wishpond</span></div><div><span style=\"font-size: 16px\">•  Youtube: Thewishpond</span></div><div><span style=\"font-size: 16px\">•&nbsp;LinkedIn : Wishpond</span></div><div>&nbsp;</div><div><b style=\"font-size: 24px\">APPLICATION PROCESS</b></div><div><b style=\"font-size: 16px\">If you are interested in applying for this exciting opportunity, please provide an updated resume in English (PDF or Word formats only), quoting the position title in the subject line of your cover letter.</b></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">Wishpond Technologies is an equal-opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture that does not discriminate on the basis of disability, status or any other basis protected under legislation.</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">We thank all applicants in advance for their interest in this position however, due to the volume of applications we receive, we are unable to respond to phone, email or agency inquiries.</span></div>","tags":"[\"management\"]","pubDate":"2024-07-05 22:46:24.578","link":"https://jobs.lever.co/wishpond/2f8101da-1a3d-477f-a65b-87048ac44903","savedDate":"2024-07-10 12:55:08.957","slug":"marketing-assistant-at-persistiq-work-from-anywhere-in-the-world-wishpond-5831"},{"id":9059231708,"title":"Freelance Writer","company":"IAPWE","image":"https://remotive.com/job/1185979/logo","description":"<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\">Our organization is seeking content writers to create articles and blog posts on a variety of topics.</p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\">The rate of pay is $20 per 100 words (this comes out to approximately $100 per article or $50 per hour).</p>\n<p> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\">Some topics you may be asked to write about include the following (you can always turn down a topic if you do not feel comfortable writing about it, however if you have experience or expertise in a specific area, please let us know):</p>\n<p> </p>\n<ul class=\"ul1\" style=\"\">\n<li class=\"li1\" style=\"\">Health &amp; beauty</li>\n<li class=\"li1\" style=\"\">Fitness</li>\n<li class=\"li1\" style=\"\">Home Decor</li>\n<li class=\"li1\" style=\"\">Fashion</li>\n<li class=\"li1\" style=\"\">Sports</li>\n<li class=\"li1\" style=\"\">Do it yourself</li>\n<li class=\"li1\" style=\"\">Finance</li>\n<li class=\"li1\" style=\"\">Legal</li>\n<li class=\"li1\" style=\"\">Medical</li>\n<li class=\"li1\" style=\"\">Family/Parenting</li>\n<li class=\"li1\" style=\"\">Relationships</li>\n<li class=\"li1\" style=\"\">Real Estate</li>\n<li class=\"li1\" style=\"\">Restaurants</li>\n<li class=\"li1\" style=\"\">Contracting (plumbing, pool building, remodeling, etc.)</li>\n</ul>\n<p> </p>\n<p><span style=\"color: #000000;\">These are just some of the more general industries and topics that we cover.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">Requirements</span><span style=\"color: #000000;\">:</span></p>\n<ul style=\"\">\n<li style=\"\">We ask that all work be completed using a word processor such as Microsoft Word or Open Office</li>\n<li style=\"\">A reliable internet connection and the ability to meet deadlines</li>\n<li style=\"\">Good communication skills and respond in a timely manner to editorial staff when they ask for updates on tasks, etc</li>\n<li style=\"\">Work well as a team member with the rest of our content management and editorial staff</li>\n</ul>\n<p><br><br><em><strong>Note</strong>: Applicants to this job signaled that accessing some writing tasks may require payment.</em></p>\n<img src=\"https://remotive.com/job/track/1185979/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"REST\"]","pubDate":"2024-07-04 11:30:55.000","link":"https://remotive.com/remote-jobs/writing/freelance-writer-1185979","savedDate":"2024-07-10 12:55:08.954","slug":"freelance-writer-iapwe-9093"},{"id":4176949554,"title":"Community Manager LATAM (2 months contract) ","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;We are hiring the Community Manager for LATAM (2 months contract) to build and support a next-level community. We are looking for a talented Community Manager who excels in engaging and growing our community. You will be managing the social channels of Scroll en Español such as Twitter, Scroll LATAM Telegram and Discord with coordination of teams such as Comms, BD and DevRel. The role is ideal for an individual who thrives in a start-up environment, a self-starter that is dynamic and comfortable to take on responsibilities and can work effectively within a remote setup.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Based in Argentina&lt;/li&gt;\n&lt;li&gt;Bachelor&#39;s or Master&#39;s degree or extensive experience in this area;&lt;/li&gt;\n&lt;li&gt;Native Spanish language; proficient in English language; plus if proficient in Portuguese&lt;/li&gt;\n&lt;li&gt;Proven track record of executing community management plans in previous jobs; You come from either a ambassador background or a community manager background;&lt;/li&gt;\n&lt;li&gt;Solid knowledge in different community-building methodologies to communicate effectively with our community across various platforms.&lt;/li&gt;\n&lt;li&gt;Great writing skills on socials and great translation skills for localization; You are able to not only to craft great messages but also address the nuances in tone of the messages.&lt;/li&gt;\n&lt;li&gt;Great experience in working with cross functional teams and being able to effectively communicate with stakeholders to understand their challenges and needs, build narratives;&lt;/li&gt;\n&lt;li&gt;Excellent executing skills including leading the community to successfully deliver the end result;&lt;/li&gt;\n&lt;li&gt;Excellent English skills in both written and speaking especially is a must for this role&lt;/li&gt;\n&lt;li&gt;Experience of planning and participating in both online and offline events in the Latam crypto space&lt;/li&gt;\n&lt;li&gt;Great knowledge for L2 and Ethereum ecosystem for effective community management&lt;/li&gt;\n&lt;li&gt;Excellent onchain user knowledge to address and resolve customer concerns as part of serving the community&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A mission-led, collaborative culture&lt;/li&gt;\n&lt;li&gt;Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum&lt;/li&gt;\n&lt;li&gt;Competitive salary package / generous paid time off / annual growth budget&lt;/li&gt;\n&lt;li&gt;100% remote from any location with flexible hours&lt;/li&gt;\n&lt;li&gt;Home office set up / co-working membership allowance&lt;/li&gt;\n&lt;li&gt;Private healthcare in selected countries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"Finance\",\"management\"]","pubDate":"2024-07-03 02:03:41.000","link":"https://boards.eu.greenhouse.io/scrollio/jobs/4360758101","savedDate":"2024-07-10 12:55:08.958","slug":"community-manager-latam-2-months-contract-scroll-6744"},{"id":9773888204,"title":"Protocol Research Engineer","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;div&gt;\n&lt;p&gt;&lt;strong&gt;Protocol Researcher&lt;/strong&gt; &lt;strong&gt;Engineer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Scroll has a remote-first work culture, our staff base is globally distributed and we are location agnostic. We make hiring decisions based on talent, culture fit and role suitability. If you have the skills and experience requested by this job description then please APPLY!*&lt;/p&gt;\n&lt;p&gt;We are looking for a&amp;nbsp;Protocol Researcher Engineer&amp;nbsp;to join our growing and world class research team. Building a truly secure, scalable, and decentralized zero-knowledge rollup requires considerable research work, including solving many open problems around protocol mechanism and design.&lt;/p&gt;\n&lt;p&gt;As a Protocol Research Engineer at Scroll, your day-to-day responsibilities will revolve around transforming groundbreaking research ideas into tangible, next-generation system designs. This entails a deep dive into the latest advancements in zkRollup technology, continuously pushing the envelope of what&#39;s possible within the blockchain and Ethereum space.&lt;/p&gt;\n&lt;p&gt;Your primary focus will be on the practical implementation of new protocol designs, ensuring they are not only theoretically sound but also viable in real-world applications.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Scroll…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Scroll is building an open source, bytecode level compatible zkEVM layer 2 solution for Ethereum. Our mission is to scale Ethereum while maintaining our values of credible neutrality, openness, and execution.&lt;/p&gt;\n&lt;h3&gt;Responsibilities&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;We’re hiring a Protocol Research Engineer to serve as part of our Protocol Research team, dedicated to keeping Scroll at the very forefront of blockchain and Ethereum innovation.&lt;/li&gt;\n&lt;li&gt;This hire will own and lead research projects that ensure Scroll continues to differentiate itself, and pushes the boundaries of zkRollup technology.&lt;/li&gt;\n&lt;li&gt;The Protocol Research Engineer will design, implement, and validate new concepts and features, contributing to and having a massive impact upon the broader Ethereum ecosystem.&lt;/li&gt;\n&lt;li&gt;You will work at the forefront of the industry, tackling massively complex problems, such as decentralizing the sequencer, with a strong focus on theoretical and applied research.&lt;/li&gt;\n&lt;li&gt;You will do it alongside other deeply driven technical minds, in a culture defined by and dedicated to autonomy, ownership, and openness. You will also have the chance to collaborate externally with thinkers and researchers in academia and other leading blockchain organizations.&lt;/li&gt;\n&lt;li&gt;This is a fully remote job.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Demonstrated ability to design, implement, and validate new, production-ready, open-source blockchain protocol projects using Golang or Rust, with a good understanding of Solidity. For instance, by having contributed to Ethereum, authored and implemented EIPs, published/commented on &lt;a href=&quot;http://ethresear.ch/&quot;&gt;ethresear.ch&lt;/a&gt;, pushed PRs to nodes like geth or Lighthouse, EF fellowship, and/or written academic papers, etc.&lt;/li&gt;\n&lt;li&gt;Strong engineering background with the ability to understand research&lt;/li&gt;\n&lt;li&gt;You take ownership and operate proactively, independently, and with openness and transparency. Confident but humble and low ego, your excitement over learning complex concepts motivates and inspires others.&lt;/li&gt;\n&lt;li&gt;You enjoy collaborating with others and excel at communicating with them, asynchronously and across cultures. You speak and write (documentation and specs, as well as on Slack), clearly and concisely.&lt;/li&gt;\n&lt;li&gt;Excellent coding standards (distributed systems, open source, correct and performant code, good developer practices, effective use of Notion/GitHub, performance profiling, optimization, correct + robust + maintainable code).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Nice to Have&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Familiarity with Ethereum, EVM, L2s, Rollups, ZK&lt;/li&gt;\n&lt;li&gt;Familiarity with cryptography&lt;/li&gt;\n&lt;li&gt;Technical publications and/or articles, Twitter threads, etc.&lt;/li&gt;\n&lt;li&gt;The ability to speak Chinese&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A mission-led, collaborative culture&lt;/li&gt;\n&lt;li&gt;Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum&lt;/li&gt;\n&lt;li&gt;Competitive salary package / generous paid time off / annual growth budget&lt;/li&gt;\n&lt;li&gt;100% remote from any location with flexible hours&lt;/li&gt;\n&lt;li&gt;Home office set up / co-working membership allowance&lt;/li&gt;\n&lt;li&gt;Private healthcare in selected countries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"Finance\",\"engineering\"]","pubDate":"2024-07-02 10:24:50.000","link":"https://boards.eu.greenhouse.io/scrollio/jobs/4360304101","savedDate":"2024-07-10 12:55:08.960","slug":"protocol-research-engineer-scroll-5034"},{"id":1578902944,"title":"Partnerships Manager (Turkiye Market)","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;div class=&quot;p-rich_text_section&quot;&gt;At Scroll, we operate on the bleeding edge of a fast-moving frontier of zk technology, research and innovation. The Partnership Associate will be responsible for onboarding new dApps and and systematically grow and strengthen Scroll’s ecosystem across DeFi, Infra, and other emerging verticals in Turkiye. You will identify opportunities for fruitful partnerships, meet with potential partners (remote or at conferences), and ensure the ongoing success. This role will require strategic thinking to align external partners with the interests of the Scroll community. The role is ideal for an individual who thrives in a start-up environment, a self-starter that is dynamic and comfortable to take on responsibilities and can work effectively within a remote setup.&lt;br&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Responsibilities&lt;/strong&gt;&lt;/div&gt;\n&lt;ul class=&quot;p-rich_text_list p-rich_text_list__bullet&quot; data-stringify-type=&quot;unordered-list&quot; data-indent=&quot;0&quot; data-border=&quot;0&quot;&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Cultivate and enhance partnerships with decentralized applications (dApps) and liquidity providers, leveraging expertise in key account management to foster collaborations within Scroll and its partners’ ecosystems for Turkiye market.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Play an instrumental role in shaping and executing the strategy for resource distribution within the Scroll network.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Analyze the evolving landscape of dApps to identify emerging trends and opportunities that can augment the Scroll ecosystem.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Proactively identify and assess potential new business ventures, aligning them with Scroll’s strategic objectives.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Efficiently manage and prioritize a diverse portfolio of projects and partnerships, ensuring optimal resource allocation and alignment with Scroll’s vision.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Collaborate with the International Markets team and align cross-functional internal resources to support the integration and onboarding of new partners.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;div class=&quot;p-rich_text_section&quot;&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Requirements&lt;/strong&gt;&lt;/div&gt;\n&lt;ul class=&quot;p-rich_text_list p-rich_text_list__bullet&quot; data-stringify-type=&quot;unordered-list&quot; data-indent=&quot;0&quot; data-border=&quot;0&quot;&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Deep knowledge and a strong network in the Turkish Web3 ecosystem, including CEXs, builders, entrepreneurs, university blockchain clubs, and opinion leaders&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Deep understanding of and integration within the Ethereum and L2 community&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;2+ years of relevant work experience in web3&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Ability to analyze and interpret trading data and market performance while staying informed about the latest market trends, particularly in the DeFi, Infra, and blockchain space.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Willingness to travel for community events&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Native Turkish speaking and writing; and Excellent English skills in both written and speaking&amp;nbsp;&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Strong communication and ability to explain complex issues in clear, persuasive language&lt;/li&gt;\n&lt;/ul&gt;\n&lt;div class=&quot;p-rich_text_section&quot;&gt;Nice to Haves&lt;/div&gt;\n&lt;ul class=&quot;p-rich_text_list p-rich_text_list__bullet&quot; data-stringify-type=&quot;unordered-list&quot; data-indent=&quot;0&quot; data-border=&quot;0&quot;&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Excellent onchain user activity analysis to address potential opportunities&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Experience working in verticals including, but not limited to: RWA, Gaming, SocialFi&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Deep engagement and awareness of the latest crypto trends (alpha) on Twitter, Discord, etc.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Public speaking experience&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A mission-led, collaborative culture&lt;/li&gt;\n&lt;li&gt;Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum&lt;/li&gt;\n&lt;li&gt;Competitive salary package / generous paid time off / annual growth budget&lt;/li&gt;\n&lt;li&gt;100% remote from any location with flexible hours&lt;/li&gt;\n&lt;li&gt;Home office set up / co-working membership allowance&lt;/li&gt;\n&lt;li&gt;Private healthcare in selected countries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"Finance\",\"management\"]","pubDate":"2024-06-11 14:56:59.000","link":"https://boards.eu.greenhouse.io/scrollio/jobs/4350210101","savedDate":"2024-07-10 12:55:08.959","slug":"partnerships-manager-turkiye-market-scroll-3825"},{"id":5444997578,"title":"Senior Protocol Researcher ","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;We are looking for a Protocol Researcher to join our growing and world class research team. Building a truly secure, scalable, and decentralized zero-knowledge rollup requires considerable research work, including solving many open problems around protocol mechanism and design.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;Your day-to-day work as a researcher at Scroll will involve conducting research on Ethereum and layer 2 design. This research will need to cover a very large scope including rollup economics, state growth, EVM, MEV, PBS, AA, Layer 3, etc. We are looking for somebody with a deep understanding of protocol research as well as basic coding ability, who can directly contribute to research whilst leading and building a team of other world class researchers.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;About Scroll…&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;Scroll is building an open source, bytecode level compatible zkEVM layer 2 solution for Ethereum. Our mission is to scale Ethereum while maintaining our values of credible neutrality, openness, and execution.&lt;/div&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Survey existing layer 2 and Ethereum protocols through code and papers.&lt;/li&gt;\n&lt;li&gt;Propose new designs and optimizations for our layer 2 protocol.&lt;/li&gt;\n&lt;li&gt;Propose new designs and optimizations for Ethereum (i.e. propose layer 2 related EIPs).&lt;/li&gt;\n&lt;li&gt;Explore new research directions (i.e. EVM, MEV, PBS, AA, Layer 3, etc).&lt;/li&gt;\n&lt;li&gt;Output high quality content (i.e. talk, blog post, research post).&lt;/li&gt;\n&lt;li&gt;Represent and promote Scroll at conferences and events.&lt;/li&gt;\n&lt;li&gt;Keep the engineering team up to date with the latest ideas in protocol research.&lt;/li&gt;\n&lt;li&gt;Establish collaborations with universities and external researchers to solve open problems.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Relevant PhD OR at least 1 year of experience in a crypto research role&lt;/li&gt;\n&lt;li&gt;High level of knowledge and understanding with Layer 2s and Ethereum infrastructure.&lt;/li&gt;\n&lt;li&gt;Ability to read and write academic papers, understand and propose EIPs.&lt;/li&gt;\n&lt;li&gt;Ability to present and explain cutting-edge crypto research to engineers clearly.&lt;/li&gt;\n&lt;li&gt;Experience in blockchain infrastructure development or cryptography preferred.&lt;/li&gt;\n&lt;li&gt;Fluency in Golang, Rust, C++, or similar languages. We work primarily in Golang and Rust, but prior experience is not mandatory.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A mission-led, collaborative culture&lt;/li&gt;\n&lt;li&gt;Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum&lt;/li&gt;\n&lt;li&gt;Competitive salary package / generous paid time off / annual growth budget&lt;/li&gt;\n&lt;li&gt;100% remote from any location with flexible hours&lt;/li&gt;\n&lt;li&gt;Home office set up / co-working membership allowance&lt;/li&gt;\n&lt;li&gt;Private healthcare in selected countries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"Finance\",\"engineering\"]","pubDate":"2024-06-10 09:23:32.000","link":"https://boards.eu.greenhouse.io/scrollio/jobs/4297053101","savedDate":"2024-07-10 12:55:08.960","slug":"senior-protocol-researcher-scroll-216"}]