[{"id":7710026735,"title":"VP of Marketing and Growth","company":"Fueled","image":"https://avatars.githubusercontent.com/u/3440434?s=200&v=4","description":"&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;&amp;nbsp;Remote – US (Open to applicants located in the USA)&lt;/p&gt;\n&lt;p&gt;Fueled is a leading digital strategy, design, and engineering agency. Recently united with 10up – &lt;a href=&quot;https://10up.com/blog/2025/new-fueled-brand-10up-becomes-wordpress-practice/&quot;&gt;now the brand of our WordPress practice&lt;/a&gt; – we are a 300+ person team that has designed and built hundreds of digital products and experiences for brands like Google, Apple, The New York Times, ESPN, Victoria’s Secret, MGM Resorts, Albertsons, and CLEAR.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;As a growing force in the digital services space, we’re building a brand that resonates, a growth engine that converts, and a team that scales impact. We&#39;re looking for a strategic and action-oriented &lt;strong&gt;VP, Marketing &amp;amp; Growth&lt;/strong&gt; to lead our full-funnel growth function from first impression to forming a long-term relationship.&amp;nbsp; This role is pivotal in strengthening our voice in the market, fueling demand, supporting conversion and enabling client retention and expansion.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Sitting at the intersection of marketing, brand, content, and revenue, this role partners cross-functionally with Product, Strategy, Client Services, and Executive Leadership to align messaging with motion, attention with action, and storytelling with sales. You’ll shape how we show up, what we say, and how we grow.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;With a sharp understanding of modern marketing infrastructure, a love for compelling narratives, and a metrics-driven mindset, you’ll help us grow our brand—and our business.&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;What you will do:&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Elevate the Brand:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Define and evolve our brand positioning, voice, and visual identity. Champion our story in a way that resonates with ideal customers and amplifies market presence.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Own Full-Funnel Marketing:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Lead integrated strategies across paid, earned, and owned channels, brand campaigns, performance marketing, email, events, and more, to drive awareness, engagement, and conversion.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Drive Demand and Acquisition:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Launch always-on and campaign-based programs that attract, nurture, and convert the right audiences into pipeline and revenue.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Activate GTM Collaboration:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Partner closely with business development and GTM teams to craft sequenced, personalized marketing plays that accelerate sales momentum and nurture prospects.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build Thought Leadership &amp;amp; Content:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Oversee the development of strategic content and enablement tools, from white papers to case studies that support both credibility and conversion.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Refine ICP and Messaging:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Define and continuously evolve our Ideal Customer Profile (ICP), building segment-specific messaging that speaks to value and need.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Modernize Marketing Infrastructure:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Select and optimize tools for campaign execution, data enrichment, analytics, and personalization, bringing scale and precision to every motion.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Expand Ecosystem Influence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Cultivate relationships with analysts, partners, and collaborators who amplify our brand and enhance inbound quality.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Co-Own Pipeline and Revenue Targets:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Partner with sales leadership to track performance, optimize marketing contribution, and align on accountability for bottom-line impact.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Lead and Inspire a High-Performing Team:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Guide a multidisciplinary team of marketers and business developers. Foster a culture of curiosity, experimentation, and results.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;About you:&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You bring 10+ years of marketing, business development, or growth leadership experience, ideally in digital agencies, consultancies, or productized services environments.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You have a proven track record of building integrated marketing programs that generate brand awareness, demand, and qualified pipeline.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You think across the funnel, comfortable working in brand strategy one day and performance metrics the next. Content, campaign orchestration, and digital media are in your wheelhouse.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You’re a collaborative operator who thrives in cross-functional environments. You’ve partnered closely with product, strategy, and client service teams to drive aligned growth outcomes.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You’re fluent in modern marketing stacks and tools—including AI-enhanced platforms that support personalization, automation, targeting, and reporting.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You’re a compelling communicator who understands how to craft a message, influence stakeholders, and rally a team around a shared vision.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You’re detail-oriented, metrics-focused, and excited by the opportunity to scale fast with clarity and accountability.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;Benefits &amp;amp; Salary&amp;nbsp;&lt;br&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Competitive salary and benefits. Compensation is determined based on a variety of factors including relevant experience, other job-related qualifications, geographic location, and business needs.&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Join our Team! &lt;/strong&gt;&lt;/h2&gt;\n&lt;div&gt;\n&lt;p&gt;If you are passionate about Fueled&#39;s mission and think you have what it takes to be successful in this role, even if you don&#39;t check all the boxes - please apply. We&#39;d appreciate the opportunity to personally review your application. Everyone gets a response.&lt;/p&gt;\n \n&lt;p&gt;Any data provided will be processed in accordance with applicable law and our&amp;nbsp;&lt;a href=&quot;https://fueled.com/privacy-policy/&quot; target=&quot;_blank&quot;&gt;privacy policy&lt;/a&gt;. Curious about what to expect during our talent process? Check it out&amp;nbsp;&lt;a href=&quot;https://www.notion.so/fueled/What-to-Expect-from-the-Interview-Process-at-Fueled-1d84dccd9d8b80f8a0b0d40b244f4caf?pvs=4&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;","tags":"[\"wordpress\"]","pubDate":"2025-06-04T23:21:33.000Z","link":"https://job-boards.greenhouse.io/fueledcareers/jobs/4647758008","slug":"vp-of-marketing-and-growth-fueled-4183"},{"id":3798935143,"title":"SaaS Solutions Architect (Post Sales Implementation)","company":"Zingtree","image":"https://avatars.githubusercontent.com/u/63677130?s=200&v=4","description":"<div><b style=\"font-size: 15px\">Zingtree empowers support teams with AI and automation to resolve complex issues quickly and efficiently.</b><span style=\"font-size: 15px\">&nbsp;As the next-gen intelligent process automation platform, Zingtree helps leading customer support organizations transform self-service, streamline agent workflows, and deliver exceptional customer experiences. With over 500 customers—including global enterprises like Optum, Corpay, Sony, SharkNinja, and Allianz—we make every support interaction smarter and more scalable. </span></div><div><br></div><div><span style=\"font-size: 15px\">We are seeking a&nbsp;</span><b style=\"font-size: 15px\">SaaS Solutions Architect</b><span style=\"font-size: 15px\">&nbsp;with strong project management capabilities and a passion for building conversational AI workflows. This is a hands-on, individual contributor role ideal for someone who excels at guiding clients through the technical implementation of intelligent support solutions. In this role, you’ll own the end-to-end deployment process—from systems integration to the design, build, and launch of conversational AI workflows tailored to each customer’s needs. You’ll work closely with both client stakeholders and internal teams to deliver seamless automation, configure advanced integrations, manage timelines, and ensure a successful go-live.&nbsp;</span><b style=\"font-size: 15px\">This position requires a unique blend of technical expertise, AI workflow design experience, and a customer-first mindset to drive real impact for support organizations.</b></div><div><br></div><div>The role reports into the COO and in order to best support our UK clients, we're only accepting applicants based on the East Coast of the U.S.</div><div><b style=\"font-size: 15px\">Zingtree empowers support teams with AI and automation to resolve complex issues quickly and efficiently.</b><span style=\"font-size: 15px\">&nbsp;As the next-gen intelligent process automation platform, Zingtree helps leading customer support organizations transform self-service, streamline agent workflows, and deliver exceptional customer experiences. With over 500 customers—including global enterprises like Optum, Corpay, Sony, SharkNinja, and Allianz—we make every support interaction smarter and more scalable. </span></div><div><br></div><div><span style=\"font-size: 15px\">We are seeking a&nbsp;</span><b style=\"font-size: 15px\">SaaS Solutions Architect</b><span style=\"font-size: 15px\">&nbsp;with strong project management capabilities and a passion for building conversational AI workflows. This is a hands-on, individual contributor role ideal for someone who excels at guiding clients through the technical implementation of intelligent support solutions. In this role, you’ll own the end-to-end deployment process—from systems integration to the design, build, and launch of conversational AI workflows tailored to each customer’s needs. You’ll work closely with both client stakeholders and internal teams to deliver seamless automation, configure advanced integrations, manage timelines, and ensure a successful go-live.&nbsp;</span><b style=\"font-size: 15px\">This position requires a unique blend of technical expertise, AI workflow design experience, and a customer-first mindset to drive real impact for support organizations.</b></div><div><br></div><div>The role reports into the COO and in order to best support our UK clients, we're only accepting applicants based on the East Coast of the U.S.</div><div><span style=\"font-size: 11pt\">Zingtree is committed to internal pay equity and offers a competitive compensation package, including base salary, equity, and benefits. Our benefits package includes premium medical, dental, and vision benefits, paid parental leave, a flexible paid time off policy, and monthly work from home stipends.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">For cash compensation, Zingtree sets standard ranges for all roles based on function, level, and geographic location, benchmarked against similar-stage growth companies. The US pay range&nbsp; for this role is $112,200 - $168,300 a year. Final offers are adjusted based on geographic location, candidate experience, and expertise.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Zingtree provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, gender identity, gender expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</span></div><h3>What You'll Do </h3><li><b>Solution Design &amp; Customization</b>: Design, demo and build tailored AI-driven and conversational workflows that align with customer support objectives. Leverage decision trees and natural language interfaces to streamline complex support interactions.</li><li><b>Technical Configuration &amp; Integration</b>: Collaborate with client IT teams to configure and integrate Zingtree with CRMs, APIs, and third-party platforms—ensuring reliable data exchange and conversational AI compatibility.</li><li><b>Client Onboarding &amp; Planning</b>: Lead onboarding sessions to gather business requirements, understand customer support processes, and define project goals, with a focus on identifying opportunities for conversational automation.</li><li><b>Stakeholder Collaboration</b>: Act as the primary technical point of contact for clients throughout the project lifecycle, providing regular updates and managing expectations. Operate as the technical liaison to translate requirements between client business and IT resources, as well internally with team members</li><li><b>Risk &amp; Issue Management:</b>&nbsp;Identify and mitigate project risks; resolve technical and process-related issues to prevent project delays.</li><li><b>Testing &amp; Validation</b>: Guide UAT (User Acceptance Testing) with clients, ensuring conversational workflows and integrations meet functional and experience goals.</li><li><b>Training &amp; Enablement</b>: Participate in platform and user training sessions to ensure customers are equipped to build and maintain AI-enabled conversational flows, workflows, and reporting.</li><li><b>Go-Live &amp; Post-Implementation Support</b>: Ensure successful go-live execution and provide a seamless transition to Customer Success and Support for ongoing enhancements and support.</li><li><b>Project Management</b>: Coordinate and collaborate on multiple SaaS implementation projects concurrently - balancing technical execution, AI workflow development, and client alignment within defined timelines and scopes.</li><h3>Who You Are</h3><li><b>Work Experience:</b> 4+ years in a solutions architect, customer engineering, technical project implementation roles, with at least 2+ years in enterprise B2B SaaS, preferably in customer support or contact center solutions, and with start-up experience.</li><li><b>Conversational AI &amp; Technical Expertise:</b> Proven hands-on experience with automation technologies and integration architectures, including APIs, authentication protocols, middleware, web services, and messaging patterns. Proficiency in technologies enabling conversational AI—such as large language models (LLMs), prompt engineering, AI-led agentic workflows, and real-time decisioning. Strong front-end skills (JavaScript, CSS, JSON) and familiarity with ETL/data transformation. Experience integrating with CRMs (especially Salesforce and Zendesk) is a significant plus.</li><li><b>Business Acumen: </b>Specializes in digesting complex business requirements and designing comprehensive and integrated workflow solutions that are flexible and adaptable to the client's needs.</li><li><b>Analytical Mindset:</b> Proficient in troubleshooting technical challenges and collaborating with cross-functional teams to find solutions. Ability to quickly understand operational processes and identify areas the technology can condense and/or optimize the processes.</li><li><b>Client-Facing Expertise:</b> Exceptional communication and interpersonal skills; experience interfacing with customers to manage expectations, resolve issues, and ensure project success. Ability to clearly articulate technical topics to a non-technical audience, including experience working with executives.</li><h3>What We Offer</h3><li>Competitive Compensation with opportunity for discretionary bonus</li><li>Comprehensive Health Benefits - 100% of employee premiums and 75%-80% of dependent premiums on most health, dental, and vision insurance are covered by us</li><li>401K plans - Add to your retirement planning </li><li>Paid Parental Leave - Paid time off for parents to spend time with their new child</li><li>Unlimited PTO - Take the time you need to recharge and bring your best self to work&nbsp;</li><li>Flexible Remote Work - Work from anywhere</li><li>Co-Working Reimbursement - Expense up to $200 a month on co-working space</li><li>Home Office Stipend - Receive up to $500 to create a great work environment at home, and $100 a month for Internet, phone, etc.</li><h3>Our Values</h3><li><b>Lead with action:</b> We are doers. We move fast with purpose, fearlessly blaze new trails, and fail fast and learn quickly, to achieve positive outcomes for our customers and the business.&nbsp;</li><li><b>People really matter:</b> We win as a team. We care about all humans—our customers and our employees—achieving professional greatness and making a meaningful impact on the world.</li><li><b>Ownership leads to results:</b> When we say we’ll deliver, we deliver. We act responsibly with integrity, high standards, and hold ourselves accountable to the results of our actions.</li><li><b>Expertise creates value:</b> We are learners. We continuously build and share knowledge, invest in growing ourselves, and put expertise into action to fully realize our potential and goals.</li><li><b>Transparency builds trust:</b> We respectfully tell it as it is. We are direct, honest, and open with the information that matters, and communicate in a caring way that builds stronger trusted relationships with each other.</li><div><br></div><div>#LI-Remote</div><div>#LI-EG1</div>","tags":"[\"javascript\",\"salesforce\"]","pubDate":"2025-06-04T21:48:01.740Z","link":"https://jobs.lever.co/zingtree/29d39e64-fc4d-45e5-9852-4ee61b93cbdf","slug":"saas-solutions-architect-post-sales-implementation-zingtree-1949"},{"id":7744363881,"title":"Senior SaaS Solutions Architect (Post Sales Implementation)","company":"Zingtree","image":"https://avatars.githubusercontent.com/u/63677130?s=200&v=4","description":"<div><b style=\"font-size: 15px\">Zingtree empowers support teams with AI and automation to resolve complex issues quickly and efficiently.</b><span style=\"font-size: 15px\">&nbsp;As the next-gen intelligent process automation platform, Zingtree helps leading customer support organizations transform self-service, streamline agent workflows, and deliver exceptional customer experiences. With over 500 customers—including global enterprises like Optum, Corpay, Sony, SharkNinja, and Allianz—we make every support interaction smarter and more scalable. </span></div><div><br></div><div><span style=\"font-size: 15px\">We are seeking a&nbsp;</span><b style=\"font-size: 15px\">Senior SaaS Solutions Architect</b><span style=\"font-size: 15px\">&nbsp;with strong project management capabilities and a passion for building conversational AI workflows. This is a hands-on, individual contributor role ideal for someone who excels at guiding clients through the technical implementation of intelligent support solutions. In this role, you’ll own the end-to-end deployment process—from systems integration to the design, build, and launch of conversational AI workflows tailored to each customer’s needs. You’ll work closely with both client stakeholders and internal teams to deliver seamless automation, configure advanced integrations, manage timelines, and ensure a successful go-live.&nbsp;</span><b style=\"font-size: 15px\">This position requires a unique blend of technical expertise, AI workflow design experience, and a customer-first mindset to drive real impact for support organizations.</b></div><div><br></div><div>The role reports into the COO and in order to best support our UK clients, we're only accepting applicants based on the East Coast of the U.S.</div><div><b style=\"font-size: 15px\">Zingtree empowers support teams with AI and automation to resolve complex issues quickly and efficiently.</b><span style=\"font-size: 15px\">&nbsp;As the next-gen intelligent process automation platform, Zingtree helps leading customer support organizations transform self-service, streamline agent workflows, and deliver exceptional customer experiences. With over 500 customers—including global enterprises like Optum, Corpay, Sony, SharkNinja, and Allianz—we make every support interaction smarter and more scalable. </span></div><div><br></div><div><span style=\"font-size: 15px\">We are seeking a&nbsp;</span><b style=\"font-size: 15px\">Senior SaaS Solutions Architect</b><span style=\"font-size: 15px\">&nbsp;with strong project management capabilities and a passion for building conversational AI workflows. This is a hands-on, individual contributor role ideal for someone who excels at guiding clients through the technical implementation of intelligent support solutions. In this role, you’ll own the end-to-end deployment process—from systems integration to the design, build, and launch of conversational AI workflows tailored to each customer’s needs. You’ll work closely with both client stakeholders and internal teams to deliver seamless automation, configure advanced integrations, manage timelines, and ensure a successful go-live.&nbsp;</span><b style=\"font-size: 15px\">This position requires a unique blend of technical expertise, AI workflow design experience, and a customer-first mindset to drive real impact for support organizations.</b></div><div><br></div><div>The role reports into the COO and in order to best support our UK clients, we're only accepting applicants based on the East Coast of the U.S.</div><div><span style=\"font-size: 11pt\">Zingtree is committed to internal pay equity and offers a competitive compensation package, including base salary, equity, and benefits. Our benefits package includes premium medical, dental, and vision benefits, paid parental leave, a flexible paid time off policy, and monthly work from home stipends.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">For cash compensation, Zingtree sets standard ranges for all roles based on function, level, and geographic location, benchmarked against similar-stage growth companies. The US pay range&nbsp; for this role is $150,000 - $200,000 a year. Final offers are adjusted based on geographic location, candidate experience, and expertise.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Zingtree provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, gender identity, gender expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</span></div><h3>What You'll Do </h3><li><b>Solution Design &amp; Customization</b>: Design, demo and build tailored AI-driven and conversational workflows that align with customer support objectives. Leverage decision trees and natural language interfaces to streamline complex support interactions.</li><li><b>Technical Configuration &amp; Integration</b>: Collaborate with client IT teams to configure and integrate Zingtree with CRMs, APIs, and third-party platforms—ensuring reliable data exchange and conversational AI compatibility.</li><li><b>Client Onboarding &amp; Planning</b>: Lead onboarding sessions to gather business requirements, understand customer support processes, and define project goals, with a focus on identifying opportunities for conversational automation.</li><li><b>Stakeholder Collaboration</b>: Act as the primary technical point of contact for clients throughout the project lifecycle, providing regular updates and managing expectations. Operate as the technical liaison to translate requirements between client business and IT resources, as well internally with team members</li><li><b>Risk &amp; Issue Management:</b>&nbsp;Identify and mitigate project risks; resolve technical and process-related issues to prevent project delays.</li><li><b>Testing &amp; Validation</b>: Guide UAT (User Acceptance Testing) with clients, ensuring conversational workflows and integrations meet functional and experience goals.</li><li><b>Training &amp; Enablement</b>: Participate in platform and user training sessions to ensure customers are equipped to build and maintain AI-enabled conversational flows, workflows, and reporting.</li><li><b>Go-Live &amp; Post-Implementation Support</b>: Ensure successful go-live execution and provide a seamless transition to Customer Success and Support for ongoing enhancements and support.</li><li><b>Project Management</b>: Coordinate and collaborate on multiple SaaS implementation projects concurrently - balancing technical execution, AI workflow development, and client alignment within defined timelines and scopes.</li><h3>Who You Are</h3><li><b>Work Experience:</b> 7+ years in a solutions architect, customer engineering, technical project implementation roles, with at least 4+ years in enterprise B2B SaaS, preferably in customer support or contact center solutions, and with start-up experience.</li><li><b>Conversational AI &amp; Technical Expertise:</b> Proven hands-on experience with automation technologies and integration architectures, including APIs, authentication protocols, middleware, web services, and messaging patterns. Proficiency in technologies enabling conversational AI—such as large language models (LLMs), prompt engineering, AI-led agentic workflows, and real-time decisioning. Strong front-end skills (JavaScript, CSS, JSON) and familiarity with ETL/data transformation. Experience integrating with CRMs (especially Salesforce and Zendesk) is a significant plus.</li><li><b>Business Acumen: </b>Specializes in digesting complex business requirements and designing comprehensive and integrated workflow solutions that are flexible and adaptable to the client's needs.</li><li><b>Analytical Mindset:</b> Proficient in troubleshooting technical challenges and collaborating with cross-functional teams to find solutions. Ability to quickly understand operational processes and identify areas the technology can condense and/or optimize the processes.</li><li><b>Client-Facing Expertise:</b> Exceptional communication and interpersonal skills; experience interfacing with customers to manage expectations, resolve issues, and ensure project success. Ability to clearly articulate technical topics to a non-technical audience, including experience working with executives.</li><h3>What We Offer</h3><li>Competitive Compensation with opportunity for discretionary bonus</li><li>Comprehensive Health Benefits - 100% of employee premiums and 75%-80% of dependent premiums on most health, dental, and vision insurance are covered by us</li><li>401K plans - Add to your retirement planning </li><li>Paid Parental Leave - Paid time off for parents to spend time with their new child</li><li>Unlimited PTO - Take the time you need to recharge and bring your best self to work&nbsp;</li><li>Flexible Remote Work - Work from anywhere</li><li>Co-Working Reimbursement - Expense up to $200 a month on co-working space</li><li>Home Office Stipend - Receive up to $500 to create a great work environment at home, and $100 a month for Internet, phone, etc.</li><h3>Our Values</h3><li><b>Lead with action:</b> We are doers. We move fast with purpose, fearlessly blaze new trails, and fail fast and learn quickly, to achieve positive outcomes for our customers and the business.&nbsp;</li><li><b>People really matter:</b> We win as a team. We care about all humans—our customers and our employees—achieving professional greatness and making a meaningful impact on the world.</li><li><b>Ownership leads to results:</b> When we say we’ll deliver, we deliver. We act responsibly with integrity, high standards, and hold ourselves accountable to the results of our actions.</li><li><b>Expertise creates value:</b> We are learners. We continuously build and share knowledge, invest in growing ourselves, and put expertise into action to fully realize our potential and goals.</li><li><b>Transparency builds trust:</b> We respectfully tell it as it is. We are direct, honest, and open with the information that matters, and communicate in a caring way that builds stronger trusted relationships with each other.</li><div><br></div><div>#LI-Remote</div><div>#LI-EG1</div>","tags":"[\"javascript\",\"salesforce\"]","pubDate":"2025-06-04T21:39:19.834Z","link":"https://jobs.lever.co/zingtree/c7cf05ae-fa2f-4216-88a9-9e6c6a0068cb","slug":"senior-saas-solutions-architect-post-sales-implementation-zingtree-4888"},{"id":5793542954,"title":"Senior IT Engineer","company":"Fingerprint","image":"https://avatars.githubusercontent.com/u/67208791?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;&lt;strong&gt;Fingerprint&lt;/strong&gt;&amp;nbsp;empowers developers to stop online fraud at the source.&lt;/p&gt;\n&lt;p&gt;We work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies.&amp;nbsp;&lt;strong&gt;We are a globally dispersed, 100% remote company&lt;/strong&gt; with a strong open-source focus. Our flagship open-source project is &lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;FingerprintJS&lt;/a&gt; (20K stars on GitHub).&lt;/p&gt;\n&lt;p&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;We have raised $77M&amp;nbsp;&lt;/a&gt;and are backed by Craft Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.tesla.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.tesla.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Tesla,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://facebook.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://facebook.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Facebook,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.airbnb.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.airbnb.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Airbnb&amp;nbsp;&lt;/a&gt;), Nexus Venture Partners (previously invested in &lt;a href=&quot;https://www.postman.com/&quot;&gt;Postman&lt;/a&gt;, &lt;a href=&quot;https://www.apollo.io/&quot;&gt;Apollo.io,&lt;/a&gt; &lt;a href=&quot;https://min.io/&quot;&gt;MinIO&lt;/a&gt;, Druva)&amp;nbsp;and Uncorrelated Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://redis.io/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://redis.io/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Redis,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://rollbar.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://rollbar.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Rollbar&amp;nbsp;&lt;/a&gt;&amp;amp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://gradle.org/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://gradle.org/&quot; data-sk=&quot;tooltip_parent&quot;&gt;&amp;nbsp;Gradle&lt;/a&gt;).&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p data-pm-slice=&quot;1 1 []&quot;&gt;We are seeking a Senior IT Engineer to take ownership of our internal systems and infrastructure, drive automation, and lead the implementation of modern IT standards across the organization. This role is perfect for someone excited to scale secure, low-friction IT experiences in a fast-paced, remote-first environment. You&#39;ll work cross-functionally to ensure every team member has secure, reliable access to the tools they need from day one — while designing backend systems that are scalable, secure, and built for the long term.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;What You&#39;ll Do&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Access &amp;amp; Automation:&lt;/strong&gt; Replace manual access requests with scalable, automated workflows. Implement SSO solutions and integrate provisioning into Rippling. Build IT ticketing systems and self-service portals to streamline support.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Infrastructure &amp;amp; Strategy:&lt;/strong&gt; Collaborate with leadership to define and drive IT roadmap, and create scalable processes for a growing remote team.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Device Management:&lt;/strong&gt; Define desktop standards, manage MDM tools, and deploy zero-touch provisioning via Apple Business Manager.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Security:&lt;/strong&gt; Oversee endpoint protection, antivirus/EDR tools, OS and application patching, and secure data backup processes.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;SaaS &amp;amp; Google Workspace:&lt;/strong&gt; Administer Google Workspace and manage tool integrations (Slack, Notion, GitHub, etc.) to ensure security and efficiency.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Asset Management:&lt;/strong&gt; Lead full lifecycle hardware management — from procurement and onboarding to offboarding and decommissioning.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Qualifications&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;5+ years of experience in IT engineering, infrastructure, or systems administration.&lt;/li&gt;\n&lt;li&gt;Proven experience implementing Single Sign-On (SSO) solutions from start to finish.&lt;/li&gt;\n&lt;li&gt;Strong working knowledge of Google Workspace administration, SaaS management, and cloud-first infrastructure.&lt;/li&gt;\n&lt;li&gt;Expertise in macOS device management, including MDM tools and Apple Business Manager.&lt;/li&gt;\n&lt;li&gt;Experience with zero-touch provisioning, endpoint security, and IT automation.&lt;/li&gt;\n&lt;li&gt;Demonstrated success in replacing manual IT request systems with ticketing and workflow automation tools.&lt;/li&gt;\n&lt;li&gt;Proficient in scripting (e.g., Bash, Python) to support automation and infrastructure improvements.&lt;/li&gt;\n&lt;li&gt;Strong understanding of GDPR and global data privacy/security practices and how to apply them in internal systems.&lt;/li&gt;\n&lt;li&gt;Excellent communication and documentation skills.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Nice to Have&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience with SOC 2, ISO 27001, or similar compliance standards.&lt;/li&gt;\n&lt;li&gt;Familiarity with zero trust architecture and principles.&lt;/li&gt;\n&lt;li&gt;Background in supporting distributed, remote-first teams across multiple time zones.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em data-stringify-type=&quot;italic&quot;&gt;The base salary range for this role is $180,000 - $205,000. For cash compensation, we set standard ranges for all US based roles based on function, level and geographic location, benchmarked against similar stage growth companies. In order to be compliant with local legislation, as well as to provide greater transparency to candidates, we share salary ranges on all job postings regardless of desired hiring location. Final offer amounts are determined by multiple factors including geographic location as well as candidate experience and expertise, and may vary from the amounts listed above.&lt;/em&gt;&lt;/p&gt;\n&lt;p data-pm-slice=&quot;1 1 []&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Offers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Due to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based.&amp;nbsp;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of California, please read our CCPA notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-ccpa&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of the EU, please read our GDPR notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-gdpr&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"redis\",\"python\"]","pubDate":"2025-06-04T20:48:15.000Z","link":"https://fingerprint.com/careers/jobs/apply/?gh_jid=5558011004","slug":"senior-it-engineer-fingerprint-2371"},{"id":9048371028,"title":"Senior Data Analyst","company":"Supabase","image":"https://avatars.githubusercontent.com/u/54469796?s=200&v=4","description":"<p style=\"min-height:1.5em\">Supabase is on a mission to build the world’s best open-source backend platform for developers. We're looking for a <strong>Senior Data Analyst</strong> who is excited to dive into our usage data, find the hidden gems of insight, and champion decisions that push our products and business forward. If you thrive on turning messy datasets into meaningful stories—and want to help shape a platform used by thousands of developers around the globe—this is for you.</p><p style=\"min-height:1.5em\"></p><h3>What You’ll Do</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Uncover Key Insights:</strong> Analyze user behavior, platform usage patterns, and growth funnels. You’ll translate raw data into insights that guide product roadmaps, marketing strategies, and beyond.</p></li><li><p style=\"min-height:1.5em\"><strong>Build Dashboards &amp; Tools:</strong> Develop clear, actionable dashboards and self-serve analytics solutions for cross-functional teams (Product, Growth, Marketing, etc.), making crucial information accessible in seconds.</p></li><li><p style=\"min-height:1.5em\"><strong>Shape Experimentation &amp; Testing:</strong> Design and evaluate experiments (A/B tests, user engagement studies) to push the envelope on how we improve developer success, retention, and overall product adoption.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborate Cross-Functionally:</strong> You’ll be embedded with product managers, engineers, and other stakeholders to define requirements, prioritize analytics needs, and ensure every project is data-informed from day one.</p></li><li><p style=\"min-height:1.5em\"><strong>Architect Data Excellence:</strong> Help evolve our data pipelines, transform raw inputs into well-modeled tables, and maintain high-quality data. We leverage tools like <strong>BigQuery, dbt, and Hex</strong> — you’ll be hands-on in all of them.</p></li><li><p style=\"min-height:1.5em\"><strong>Mentor &amp; Elevate:</strong> As a senior member, you’ll set best practices for analytics within Supabase. You might review queries, mentor junior analysts, or introduce new approaches for advanced modeling and data storytelling.</p></li></ul><h3>What You’ll Bring</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Hands-On Analytics Chops:</strong> You’re comfortable writing complex SQL, digging into data warehouses, and rapidly prototyping solutions in tools like dbt, Hex, or similar analytics frameworks.</p></li><li><p style=\"min-height:1.5em\"><strong>Experience with Modern Data Stacks:</strong> Familiarity with event capture (e.g., PostHog, Segment), warehousing (BigQuery or Snowflake), and a transformation layer (dbt or Airflow).</p></li><li><p style=\"min-height:1.5em\"><strong>Strategic &amp; Curious Mindset:</strong> You spot patterns where others see chaos and quickly connect the dots between user behavior and business outcomes. Bonus if you have a background in SaaS or developer tools.</p></li><li><p style=\"min-height:1.5em\"><strong>Communication Superpowers:</strong> You translate data-speak into aha! moments for non-technical audiences. You can build a compelling narrative and share it in Slack, a meeting, or a well-crafted dashboard.</p></li><li><p style=\"min-height:1.5em\"><strong>Bias for Action:</strong> You move swiftly from question to data exploration, always with an eye on driving impact for the team. You’re comfortable proposing new ideas—and scrapping them if they don’t pan out.</p></li><li><p style=\"min-height:1.5em\"><strong>3–5+ Years of Relevant Experience:</strong> You’ve done this before—maybe in a high-growth startup or a data-driven tech company. You’ve got stories of big wins, tough lessons, and everything in between.</p></li></ul><h3>Why Join Supabase?</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote-First Team:</strong> Work from anywhere, connect with colleagues around the globe, and enjoy a flexible, async-friendly environment.</p></li><li><p style=\"min-height:1.5em\"><strong>Developer-Centric Culture:</strong> We live and breathe open source. You’ll have plenty of opportunities to contribute to (and leverage) the open-source community for data solutions.</p></li><li><p style=\"min-height:1.5em\"><strong>Ownership &amp; Impact:</strong> This isn’t a button-pushing gig. You’ll have full trust and autonomy to own projects from day one—and see real results from your work.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborative Atmosphere:</strong> We’re big on pairing up when it makes sense and dividing to conquer when needed. Either way, you’ll be surrounded by whip-smart folks eager to ship.</p></li></ul><p style=\"min-height:1.5em\"><strong>Ready to Apply?</strong></p><p style=\"min-height:1.5em\">Send us your resume, your best dashboard or SQL snippet, or whatever you think shows off your data prowess. We can’t wait to see how you’ll help us unearth fresh insights and fuel Supabase’s mission to build the world’s most developer-friendly backend platform.</p><p style=\"min-height:1.5em\"></p><h3><strong>We Offer:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">100% remote work</p></li><li><p style=\"min-height:1.5em\">Autonomy to own your roadmap and execution.</p></li><li><p style=\"min-height:1.5em\">Comprehensive health, vision, and dental coverage.</p></li><li><p style=\"min-height:1.5em\">Generous tech and education allowances to support your growth.</p></li><li><p style=\"min-height:1.5em\">Annual off-sites with the global Supabase team.</p></li></ul><h2>About the team</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a startup. It's unstructured.</p></li><li><p style=\"min-height:1.5em\">Collectively founded more than 30 startups.</p></li><li><p style=\"min-height:1.5em\">Globally distributed team with more than 30 different nationalities.</p></li><li><p style=\"min-height:1.5em\">We deeply believe in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</p></li><li><p style=\"min-height:1.5em\">We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</p></li></ul><h2>Process</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">The entire process is fully remote and all communication will happen over email or via video chat.</p></li><li><p style=\"min-height:1.5em\">Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.</p></li><li><p style=\"min-height:1.5em\">If you pass the screen you will be invited to up to four follow-up interviews. </p></li><li><p style=\"min-height:1.5em\">The calls:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">usually take between 20-45 minutes each depending on the interviewer.</p></li><li><p style=\"min-height:1.5em\">most of the time, are all 1:1.</p></li><li><p style=\"min-height:1.5em\">will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.</p></li></ul></li><li><p style=\"min-height:1.5em\">Once the interviews are over, the team will meet to discuss several roles and candidates and may:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">ask one or two follow-up questions over email or a quick call.</p></li><li><p style=\"min-height:1.5em\">go directly to making an offer.</p></li></ul></li></ul>","tags":"[\"sql\"]","pubDate":"2025-06-04T20:05:47.913Z","link":"https://jobs.ashbyhq.com/supabase/0c4ed980-53d2-4dfc-8019-318d8ee0cbb7","slug":"senior-data-analyst-supabase-7431"},{"id":2525228141,"title":"Collections Specialist - MX","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://empowerapp.mx/\"><u>Empower México</u></a> is a new venture for the company. Launched in 2022, we’ve already helped thousands of customers access fair credit in moments of need — using alternative data and technology to serve those often overlooked by traditional lenders. We’re scaling rapidly and preparing to launch new products that will expand our reach and deepen our impact across the country.</p><p style=\"min-height:1.5em\">We are seeking a Collections Strategy &amp; Analytics Manager to build a world-class collections function. This is a rare opportunity to take full ownership of collections strategy, risk segmentation, outreach channels, and analytics in a fast-growing, high- impact environment. If you’re looking for a foundational role where you can have massive impact scaling operations that expand financial inclusion, and a wide scope within a high performing team, this is the role for you.</p><p style=\"min-height:1.5em\">The ideal candidate is a strategic thinker with deep expertise in collections, risk, and analytics. They will have the opportunity to shape the vision, design best-in-class collections strategies, and eventually grow a high-performing team. This individual should be excited about getting in the weeds and hands-on leading analyses. They will drive experimentation, optimize collections performance, and implement data-driven decision-making across all aspects of the function.</p><p style=\"min-height:1.5em\">This is a remote role with a preference for individuals based in Mexico or in a similar time zone. Occasional travel will be required for company onsites and market visits (minimum 4-6 times per year).</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">RESPONSIBILITIES</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Test and iterate rapidly on different collections strategies, testing new outreach techniques, incentives, and risk-based approaches.</p></li><li><p style=\"min-height:1.5em\">Design and implement predictive collections scoring and automation, leveraging segmentation, data analytics, machine learning, and vendors to optimize recovery rates.</p></li><li><p style=\"min-height:1.5em\">Develop and scale collections outreach models—across digital, automated, and agent-led channels—to maximize efficiency and performance.</p></li><li><p style=\"min-height:1.5em\">Coordinate and manage relationships with external collection agencies to ensure aligned strategy, consistent performance, and compliance.</p></li><li><p style=\"min-height:1.5em\">Build and lead a high-performing collections strategy and analytics team, ensuring best-in-class execution and continuous improvement.</p></li><li><p style=\"min-height:1.5em\">Work cross-functionally with Credit, Data Science, Product, Growth, and Operations teams to refine collections strategy, enhance underwriting insights, and drive innovation.</p></li><li><p style=\"min-height:1.5em\">Own key collections KPIs, including delinquency rates, recovery efficiency, and overall portfolio performance, ensuring financial targets are met.</p></li><li><p style=\"min-height:1.5em\">Ensure compliance with all relevant regulatory requirements</p></li></ul><p style=\"min-height:1.5em\">QUALIFICATIONS</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">4+ years of experience in collections strategy, risk analytics, and credit risk management in financial services, preferably in consumer lending fintech.</p></li><li><p style=\"min-height:1.5em\">Proven expertise in data-driven collections strategies, risk segmentation, and model-driven outreach optimization. Deep familiarity with AI-driven collections scoring, automation, and optimization techniques is highly preferred.</p></li><li><p style=\"min-height:1.5em\">Strong technical skills—proficiency in SQL, Python, and analytics platforms.</p></li><li><p style=\"min-height:1.5em\">Happy to be hands-on and in the weeds driving analysis themselves.</p></li><li><p style=\"min-height:1.5em\">Experience working with cross-functional teams and managing complex initiatives in high-growth, fast-scaling environments.</p></li><li><p style=\"min-height:1.5em\">Strategic thinker with a strong execution mindset—able to translate high-level business objectives into clear, data-backed action plans.</p></li><li><p style=\"min-height:1.5em\">Excellent verbal and written communication skills, ability to communicate to an executive audience.</p></li><li><p style=\"min-height:1.5em\">Experience working with regulatory frameworks and compliance requirements in lending/collections is a plus.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Don't meet every qualification? If you're excited about this challenge and driven to innovate, we still want to hear from you!</strong></p><p style=\"min-height:1.5em\"></p><h2>What You'll Get at Empower</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Meaningful Ownership:</strong> Competitive salary and generous equity in a profitable, fast growing company.</p></li><li><p style=\"min-height:1.5em\"><strong>Complete Support:</strong> 100% coverage for medical, dental, vision, and life insurance, plus a generous WFH reimbursement.</p></li><li><p style=\"min-height:1.5em\"><strong>High-Impact Teams:</strong> The chance to thrive in a small, focused team where your contributions directly shape outcomes for our business and customers.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote First:</strong> A virtual first environment built on trust and outcomes.</p></li><li><p style=\"min-height:1.5em\"><strong>Team Connection:</strong> Twice-yearly company onsites where we come together to connect, learn, and build for the future (our last few have been in San Diego, Vail, and Flagstaff)!</p></li><li><p style=\"min-height:1.5em\"><strong>Growth Path:</strong> Ongoing opportunities for development in a dynamic, supportive, and creative environment.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>The Empower Way</h2><p style=\"min-height:1.5em\">The Empower Way is one where bold ambition meets an owner mindset, where open dialogue and spirited debate are encouraged, and where everyone works together to put our customers first. We believe diverse voices lead to the best ideas, and we foster an environment where every individual is valued, heard, and supported as part of one unified team working to change lives and build a more inclusive future.</p><p style=\"min-height:1.5em\"><strong>If that sounds like you, join us and be part of a team that's helping millions of people reshape their financial futures.</strong></p>","tags":"[\"sql\",\"python\"]","pubDate":"2025-06-04T18:58:04.375Z","link":"https://jobs.ashbyhq.com/empower%20finance/6dd4f9f0-4011-4f9f-8d2b-ef0878b41625","slug":"collections-specialist-mx-empower-3399"},{"id":2787649902,"title":"Vendor Management Manager, Customer Support","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><h2>The Opportunity: Vendor Management Manager, Customer Support</h2><p style=\"min-height:1.5em\">Empower is seeking a Vendor Management Manager to oversee our global BPO (Business Process Outsourcing) partnerships within the Customer Support (CS) organization. This person will play a critical role in ensuring that our external support providers deliver a high-quality, consistent, and brand-aligned customer experience.<br /><br />This role is responsible for the end-to-end performance and day-to-day operations of our BPO partners. That includes driving accountability, optimizing processes, and serving as the primary point of contact between our internal teams and external vendors.<br /><br />Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"></p><h2>How You’ll Make an Impact</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Own the BPO Relationship: </strong>Serve as the main liaison between Empower’s internal CS team and all third-party support vendors. Manage contracts, governance, and ongoing relationships to ensure alignment on goals and expectations.</p></li><li><p style=\"min-height:1.5em\"><strong>Performance Monitoring &amp; Continuous Improvement:</strong> Define and track KPIs, SLAs, and QA metrics. Regularly review vendor performance and implement action plans to address underperformance or gaps in service quality.</p></li><li><p style=\"min-height:1.5em\"><strong>Workforce Planning &amp; Forecasting: </strong>Collaborate with internal stakeholders to align support capacity with forecasted volumes. Ensure vendors are properly staffed, trained, and resourced to meet demand.</p></li><li><p style=\"min-height:1.5em\"><strong>Operational Oversight:</strong> Lead day-to-day operations across vendor sites, including shift coverage, productivity targets, ticket handling quality, and adherence to process standards.<br /><strong>Coaching &amp; Development: </strong>Partner with vendor Team Leads and Training Managers to provide guidance, escalate issues, and drive operational maturity. Support the development of frontline managers and ensure coaching practices align with internal standards.<br /><strong>Process Alignment: </strong>Work closely with internal CS teams to roll out new workflows, tools, or policy updates to vendor teams, ensuring smooth implementation and change management.</p></li><li><p style=\"min-height:1.5em\"><strong>Issue Resolution: </strong>Act as the first escalation point for any vendor-related service delivery concerns. Troubleshoot root causes and implement sustainable fixes.</p></li><li><p style=\"min-height:1.5em\"><strong>Strategic Projects: </strong>Contribute to outsourcing strategy, vendor selection, onboarding, and scaling initiatives as we expand support globally.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>Why You’re a Great Fit</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years in vendor management, operations, or customer support, with direct experience managing outsourced support teams</p></li><li><p style=\"min-height:1.5em\">Proven ability to manage remote teams across time zones and cultures</p></li><li><p style=\"min-height:1.5em\">Strong data orientation — you know how to read dashboards and turn them into action</p></li><li><p style=\"min-height:1.5em\">Excellent communication and relationship-building skills; you're a partner, not just a taskmaster</p></li><li><p style=\"min-height:1.5em\">Experience in a scaling or high-growth environment is a plus</p></li></ul><p style=\"min-height:1.5em\"><br /></p><h2>Our Interview Process</h2><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Initial Recruiter Call: </strong>A conversation to learn about your experience and what you're looking for in your next role.</p></li><li><p style=\"min-height:1.5em\"><strong>Hiring Manager Interview:</strong> A deeper discussion about your background and the Vendor Management Manager opportunity.</p></li><li><p style=\"min-height:1.5em\"><strong>Skills Panel:</strong> Meet with Empower team members to discuss your expertise and problem-solving approach.</p></li><li><p style=\"min-height:1.5em\"><strong>Leadership Conversation:</strong> A final conversation with our CEO to discuss how you'll contribute to Empower's mission (and how we can help you achieve your career goals along the way).</p></li></ol><p style=\"min-height:1.5em\"><strong>Don't meet every qualification? If you're excited about this challenge and driven to innovate, we still want to hear from you!</strong></p><p style=\"min-height:1.5em\"></p><h2>What You'll Get at Empower</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Meaningful Ownership:</strong> Competitive salary and generous equity in a profitable, fast growing company.</p></li><li><p style=\"min-height:1.5em\"><strong>Complete Support:</strong> 100% coverage for medical, dental, vision, and life insurance, plus a generous WFH reimbursement.</p></li><li><p style=\"min-height:1.5em\"><strong>High-Impact Teams:</strong> The chance to thrive in a small, focused team where your contributions directly shape outcomes for our business and customers.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote First:</strong> A virtual first environment built on trust and outcomes.</p></li><li><p style=\"min-height:1.5em\"><strong>Team Connection:</strong> Twice-yearly company onsites where we come together to connect, learn, and build for the future (our last few have been in San Diego, Vail, and Flagstaff)!</p></li><li><p style=\"min-height:1.5em\"><strong>Growth Path:</strong> Ongoing opportunities for development in a dynamic, supportive, and creative environment.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>The Empower Way</h2><p style=\"min-height:1.5em\">The Empower Way is one where bold ambition meets an owner mindset, where open dialogue and spirited debate are encouraged, and where everyone works together to put our customers first. We believe diverse voices lead to the best ideas, and we foster an environment where every individual is valued, heard, and supported as part of one unified team working to change lives and build a more inclusive future.</p><p style=\"min-height:1.5em\"><strong>If that sounds like you, join us and be part of a team that's helping millions of people reshape their financial futures.</strong></p>","tags":"[]","pubDate":"2025-06-04T16:37:01.748Z","link":"https://jobs.ashbyhq.com/empower%20finance/105663e0-1c90-4f39-9754-6b90b822cad7","slug":"vendor-management-manager-customer-support-empower-7027"},{"id":5222860213,"title":"Marketing Manager Spanish LATAM","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt;\">We are looking for a Growth Manager Spanish LATAM&nbsp; to lead and execute Airalo’s regional campaign marketing strategy. This role is critical in driving customer acquisition and brand growth across Latin America through impactful storytelling, data driven content, and fully integrated 360° marketing campaigns. You will be in charge of yearly campaign planning, execution and measurement across all marketing channels, content, social media, influencer, PR, and performance marketing teams.</span></div><h3>Responsibilities include but aren't limited to:</h3><li>Develop and execute the LATAM go to market strategies aligned with business goals, regional insights, and funnel stage priorities (awareness to conversion).</li><li>Plan and manage and measure 360 multi channel marketing campaigns in collaboration with regional and global teams (brand, content, performance, PR, influencer, product marketing).</li><li>Own and optimize content across multiple channels: landing pages, blog, social media, app stores, email, push, influencer scripts, video, and paid ads.</li><li>Ensure content is localized effectively to improve organic visibility and trafficeDrive brand storytelling that resonates with LATAM audiences while remaining consistent with Airalo’s global brand voice.</li><li>Collaborate with external/internal writers, creators, agencies, and internal teams to scale content production and local relevance.</li><li>Lead content briefs, calendars, and creative reviews to ensure timely and high impact campaigns delivery.</li><li>Analyze content performance and funnel impact, using data to guide decisions and iterate on strategy.</li><li>Ensure budget efficiency and maximize revenue opportunities across marketing spend.</li>,<h3>Must haves</h3><li>4+ years of experience in full stack marketing strategy, content marketing, preferably in tech, travel, or mobile first companies.</li><li>Proven experience creating and managing full funnel content across owned, earned, and paid channels.</li><li>Demonstrated ability to plan and lead 360° regional campaigns, including creative direction and cross-functional collaboration.</li><li>Exceptional storytelling and copywriting skills, with the ability to adapt tone and messaging to different platforms and audiences.</li><li>General understanding of SEO, marketing analytics and performance tracking tools</li><li>Experience managing content teams, freelancers, and/or agencies.</li><li>Native level Spanish, with strong English proficiency.</li><li>Deep understanding of LATAM markets, consumer behavior, and cultural nuances.</li><li>Comfortable in a fast paced, growth driven, remote-first environment.</li><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"seo\"]","pubDate":"2025-06-04T16:17:18.427Z","link":"https://jobs.lever.co/airalo/d2aacbbe-a9e3-489b-9dd4-dab55e15c0d3","slug":"marketing-manager-spanish-latam-airalo-6769"},{"id":2072775557,"title":"Partner Sales Director - Global System Integrator (GSI)","company":"Canonical","image":"https://avatars.githubusercontent.com/u/53057619?s=200&v=4","description":"&lt;p&gt;Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation, and IoT. Our customers include the world&#39;s leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1200+ colleagues in 75+ countries and very few office-based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.&lt;/p&gt;\n&lt;p&gt;The company is founder-led, profitable, and growing.&lt;/p&gt;\n&lt;p&gt;Global System Integrators (GSI) play a crucial role in Canonical growth plans in the coming 3 years. We are hiring a&amp;nbsp;&lt;strong&gt;Partner Sales Director&lt;/strong&gt; to work closely with Canonical GSI partners throughout their sales cycles and across their sales organizations to facilitate Ubuntu based solutions and opportunities, as well as help GSI build long term digital transformation platforms with Ubuntu stacks and services.&lt;/p&gt;\n&lt;p&gt;Reporting to the VP Global Alliances and Channels, the Partner Sales Director&amp;nbsp;will be responsible for building trusted relationships with partners, increasing Canonical market share and attach rate, evangelizing about the partnership and leading all business interactions from engineers to CxO level. They will own the strategy, the sell-to, sell-through and sell-with motions with the GSI and will animate many customer workshops, sales events, public presentations and executive engagements.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;The role entails&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Build strategic relationships with partners at levels, and stickiness with Ubuntu technology&lt;/li&gt;\n&lt;li&gt;Deep understanding of Linux and cloud software ecosystem, and open source selling models&lt;/li&gt;\n&lt;li&gt;Negotiate contracts and commercial business terms&lt;/li&gt;\n&lt;li&gt;Deep understanding of partner organizations and sales models, in particular with Global System Integrators&lt;/li&gt;\n&lt;li&gt;Work closely with marketing, sales engineering and product management to deliver on targets, objectives and provide a voice of the partner&lt;/li&gt;\n&lt;li&gt;Lead executive interlocks between partners and Canonical leadership team&lt;/li&gt;\n&lt;li&gt;Ability to travel - sometimes internationally - up to 40% of the time&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;What we are looking for in you&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Extensive experience in alliance or indirect sales management roles&lt;/li&gt;\n&lt;li&gt;Extensive experience with OpenStack, virtualization, containers and other Cloud technologies.&lt;/li&gt;\n&lt;li&gt;Autonomous, disciplined, hands-on, get-it-done mentality&lt;/li&gt;\n&lt;li&gt;Ability to capture customer requirements, evaluate gaps, identify and create opportunities&lt;/li&gt;\n&lt;li&gt;Passionate about Ubuntu products and mission&lt;/li&gt;\n&lt;li&gt;Comfortable in fast-paced and high pressure environments with ambitious achievement goals&lt;/li&gt;\n&lt;li&gt;Excellent communication and presentation skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;What we offer colleagues&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognize outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Distributed work environment with twice-yearly team sprints in person&lt;/li&gt;\n&lt;li&gt;Personal learning and development budget of USD 2,000 per year&lt;/li&gt;\n&lt;li&gt;Annual compensation review&lt;/li&gt;\n&lt;li&gt;Recognition rewards&lt;/li&gt;\n&lt;li&gt;Annual holiday leave&lt;/li&gt;\n&lt;li&gt;Maternity and paternity leave&lt;/li&gt;\n&lt;li&gt;Team Member Assistance Program &amp;amp; Wellness Platform&lt;/li&gt;\n&lt;li&gt;Opportunity to travel to new locations to meet colleagues&lt;/li&gt;\n&lt;li&gt;Priority Pass and travel upgrades for long-haul company events&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;About Canonical&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open-source projects and the platform for AI, IoT, and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence; in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since our inception in 2004.​ Working here is a step into the future and will challenge you to think differently, work smarter, learn new skills, and raise your game.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Canonical is an equal opportunity employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.&lt;a href=&quot;https://canonical.com/careers/diversity/identity&quot;&gt; Whatever your identity, we will give your application fair consideration.&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;#LI-remote&lt;/p&gt;","tags":"[]","pubDate":"2025-06-04T15:42:35.000Z","link":"https://job-boards.greenhouse.io/canonical/jobs/3572118","slug":"partner-sales-director-global-system-integrator-gsi-canonical-4477"},{"id":8298101437,"title":"Partner Sales Manager - IHV Alliances","company":"Canonical","image":"https://avatars.githubusercontent.com/u/53057619?s=200&v=4","description":"&lt;p&gt;Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world&#39;s leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1100+ colleagues in 75+ countries and very few office based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.&lt;/p&gt;\n&lt;p&gt;The company is founder led, profitable and growing.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are hiring a Partner Sales Manager to be a key contributing team member within the growing IHV alliances organization. Large OEM or Independent Hardware Vendor (IHV) brands - Dell, HPE, IBM, Lenovo, Ericsson, Cisco, Fujitsu and many more - are major partners for Canonical. These companies build software-defined solutions to capitalize on global open source mandates and associated macro trends. Canonical’s flagship product, Ubuntu, and its broader open source portfolio are key ingredients for these partners to realize their aspirations. Canonical represents the best platform for rapid open source innovation.&lt;/p&gt;\n&lt;p&gt;Reporting to the Head of IHV Alliances, the Partner Sales Manager will work closely with IHV and Canonical teams in various geographies to enable IHV teams, generate and transact opportunities, drive a Canonical agenda within an IHV, and achieve targeted results. They are responsible to build trusted relationships with our partners, increase Canonical market share and attach rate, evangelize the partnership and drive business interactions from across persona - from engineer to CxO. They will often run customer workshops focused on particular initiatives at that customer, attend sales events, give public presentations and participate in executive engagements.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: This is a remote role.&lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;The role entails&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Build strategic relationships and enable partner teams on the partnership&lt;/li&gt;\n&lt;li&gt;Build pipeline and transact opportunities through an IHV&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Grow partner awareness of open source capabilities on Canonical Ubuntu&lt;/li&gt;\n&lt;li&gt;Demonstrate a deep understanding of the Linux and cloud software ecosystem&lt;/li&gt;\n&lt;li&gt;Deliver on targets, objectives and provide a voice of the partner&lt;/li&gt;\n&lt;li&gt;Travel regularly - sometimes internationally - to drive partnerships in person&lt;/li&gt;\n&lt;li&gt;Align and support internal canonical field teams - identify, support, grow, transact&lt;/li&gt;\n&lt;li&gt;Expand existing footprint with IHV customers with an aim to upsell to broader portfolio&lt;/li&gt;\n&lt;li&gt;Support and contribute to broader strategy, initiatives and key campaigns&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What we are looking for in you&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience in alliance or indirect sales management roles&lt;/li&gt;\n&lt;li&gt;Autonomous, disciplined, hands-on, get-it-done mentality&lt;/li&gt;\n&lt;li&gt;Ability to capture customer requirements, evaluate gaps, identify and create opportunities&lt;/li&gt;\n&lt;li&gt;Passionate about Ubuntu products and mission&lt;/li&gt;\n&lt;li&gt;Comfortable in fast-paced and high pressure environments with measurable goals&lt;/li&gt;\n&lt;li&gt;Experience with Linux, virtualization, containers, and other cloud technologies&lt;/li&gt;\n&lt;li&gt;Excellent communication and presentation skills&lt;/li&gt;\n&lt;li&gt;Team player with superior accountability and customer support skills&lt;/li&gt;\n&lt;li&gt;Credibility and working knowledge of IHVs - their products, go-to-market motion, and field&lt;/li&gt;\n&lt;li&gt;Experience managing cross-functional teams and track record of operational excellence&lt;/li&gt;\n&lt;li&gt;Willingness to travel up to 4 times a year for internal events&lt;/li&gt;\n&lt;li&gt;Hands on experience with Salesforce and Google Suite a plus&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;What we offer colleagues&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognize outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Distributed work environment with twice-yearly team sprints in person&lt;/li&gt;\n&lt;li&gt;Personal learning and development budget of USD 2,000 per year&lt;/li&gt;\n&lt;li&gt;Annual compensation review&lt;/li&gt;\n&lt;li&gt;Recognition rewards&lt;/li&gt;\n&lt;li&gt;Annual holiday leave&lt;/li&gt;\n&lt;li&gt;Maternity and paternity leave&lt;/li&gt;\n&lt;li&gt;Team Member Assistance Program &amp;amp; Wellness Platform&lt;/li&gt;\n&lt;li&gt;Opportunity to travel to new locations to meet colleagues&lt;/li&gt;\n&lt;li&gt;Priority Pass and travel upgrades for long-haul company events&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;About Canonical&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open-source projects and the platform for AI, IoT, and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence; in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since our inception in 2004.​ Working here is a step into the future and will challenge you to think differently, work smarter, learn new skills, and raise your game.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Canonical is an equal opportunity employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.&lt;a href=&quot;https://canonical.com/careers/diversity/identity&quot;&gt; Whatever your identity, we will give your application fair consideration.&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;#LI-remote&lt;/p&gt;","tags":"[\"salesforce\"]","pubDate":"2025-06-04T15:27:49.000Z","link":"https://job-boards.greenhouse.io/canonical/jobs/6950219","slug":"partner-sales-manager-ihv-alliances-canonical-1731"},{"id":2117856153,"title":"Partner Sales Director - IHV Alliances","company":"Canonical","image":"https://avatars.githubusercontent.com/u/53057619?s=200&v=4","description":"&lt;p&gt;Hardware brands - Dell, HPE, IBM, Lenovo, Cisco, Ericsson and many more - are major partners for Canonical. These companies often build software-defined solutions which they take to market and Ubuntu is a key ingredient in cloud-native and edge or IoT solutions. More and more of those solutions depend on open source. Canonical Ubuntu is the best platform for rapid open source innovation.&lt;/p&gt;\n&lt;p&gt;The IHV Alliance Sales Director is responsible for IHV partner success - we want them to thrive and grow their business with Canonical software, solutions and services. This is a leadership and management role, responsible for a team who cover all IHV Alliances worldwide.&lt;/p&gt;\n&lt;p&gt;Reporting to the VP Global Alliances &amp;amp; Channels, our IHV Alliance Sales Director will work closely with strategic partners across their complex organizations to engage with their innovation teams and ensure that they consider and integrate Ubuntu stacks and solutions. For example, private clouds, container solutions, and vertical solutions for industries like telco and automotive, are increasingly built on open source and Ubuntu. We are the challenger platform, but we are growing quickly in the industry.&lt;/p&gt;\n&lt;p&gt;The Director is responsible to build trusted relationships with IHV partners, increase Canonical market share and attach rate, evangelize the partnership and lead all business interactions from engineer to CxO. They will often run customer workshops focused on particular initiatives at that customer, attend sales events, give public presentations and lead executive engagements.&lt;/p&gt;\n&lt;p&gt;As an IHV Alliance Sales Director you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Build strategic relationships with IHV partners at levels&lt;/li&gt;\n&lt;li&gt;Grow their awareness of open source capabilities on Canonical Ubuntu&lt;/li&gt;\n&lt;li&gt;Demonstrate a deep understanding of the Linux and cloud software ecosystem&lt;/li&gt;\n&lt;li&gt;Negotiate contracts and commercial business terms&lt;/li&gt;\n&lt;li&gt;Demonstrate a deep understanding of large and complex organizations&lt;/li&gt;\n&lt;li&gt;Lead partnerships in APAC with companies like Lenovo, Huawei, Quanta, Fujitsu, Inspur, H3C,&amp;nbsp; NEC, Asus etc.&lt;/li&gt;\n&lt;li&gt;Lead partnerships in EMEA with companies like Ericsson, Nokia, Bull, Siemens&lt;/li&gt;\n&lt;li&gt;Lead partnerships in the Americas with companies like Dell, HPE, IBM, Supermicro&lt;/li&gt;\n&lt;li&gt;Work closely with marketing, sales engineering and product management&lt;/li&gt;\n&lt;li&gt;Deliver on targets, objectives and provide a voice of the partner&lt;/li&gt;\n&lt;li&gt;Lead executive interlocks between IHV and Canonical leadership&lt;/li&gt;\n&lt;li&gt;Travel regularly - sometimes internationally - to drive partnerships in person&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Valued skills and experience&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience in alliance or indirect sales management roles&lt;/li&gt;\n&lt;li&gt;Autonomous, disciplined, hands-on, get-it-done mentality&lt;/li&gt;\n&lt;li&gt;Ability to capture customer requirements, evaluate gaps, identify and create opportunities&lt;/li&gt;\n&lt;li&gt;Passionate about Ubuntu products and mission&lt;/li&gt;\n&lt;li&gt;Comfortable in fast-paced and high pressure environments with measurable goals&lt;/li&gt;\n&lt;li&gt;Experience with Linux, virtualization, containers, and other cloud technologies.&lt;/li&gt;\n&lt;li&gt;Excellent communication and presentation skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we offer colleagues&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognize outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Distributed work environment with twice-yearly team sprints in person&lt;/li&gt;\n&lt;li&gt;Personal learning and development budget of USD 2,000 per year&lt;/li&gt;\n&lt;li&gt;Annual compensation review&lt;/li&gt;\n&lt;li&gt;Recognition rewards&lt;/li&gt;\n&lt;li&gt;Annual holiday leave&lt;/li&gt;\n&lt;li&gt;Maternity and paternity leave&lt;/li&gt;\n&lt;li&gt;Team Member Assistance Program &amp;amp; Wellness Platform&lt;/li&gt;\n&lt;li&gt;Opportunity to travel to new locations to meet colleagues&lt;/li&gt;\n&lt;li&gt;Priority Pass and travel upgrades for long-haul company events&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About Canonical&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open-source projects and the platform for AI, IoT, and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence; in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since our inception in 2004.​ Working here is a step into the future and will challenge you to think differently, work smarter, learn new skills, and raise your game.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Canonical is an equal opportunity employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.&lt;a href=&quot;https://canonical.com/careers/diversity/identity&quot;&gt; Whatever your identity, we will give your application fair consideration.&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;#LI-remote&lt;/p&gt;","tags":"[]","pubDate":"2025-06-04T15:14:31.000Z","link":"https://job-boards.greenhouse.io/canonical/jobs/4126502","slug":"partner-sales-director-ihv-alliances-canonical-2549"},{"id":4002725504,"title":"Senior Python/Full Stack Developer (Django-focused) (worldwide remote)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p><strong>CloudLinux</strong> is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful. </p><p>We are truly a great place to work!</p><p>Check out our website for more information - <a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a>&nbsp;</p><p></p><p>We are looking for a <strong>Senior Python/Full Stack Developer (Django-focused)</strong> to create an internal build &amp; automation system from scratch. The product is designed to expedite the delivery of security patches as part of Extended Lifecycle Support Services provided by CloudLinux.&nbsp;</p><p>Since the system will be established for internal use your end users will be colleagues working next to you. This is a great opportunity to bring value to fellow engineers!</p><p>The system is meant to be built from scratch, therefore a wide knowledge of the end-to-end pipeline of architecture/design phase, planning, development, and deployment is a must.</p><p></p><p><strong>Key Responsibilities:</strong></p><ul> <li>Design, develop, test, and deliver web applications using Django and related technologies.</li> <li>Technical ownership of the created application.</li> <li>Implement user interfaces using front-end technologies (especially JavaScript frameworks like Refine or React).</li> <li>Work with Linux-based systems for deployment and development, including container management (Docker, Kubernetes).</li> <li>Build pipelines for code testing and delivery.</li> <li>Ensure application security and data protection.</li> <li>Troubleshoot and debug code across the stack.</li> <li>Version control using Git, including branching, merging, and pull requests.</li> <li>Review your colleagues' code.</li> <li>Plan your work forward.</li> </ul><p><strong>Requirements</strong></p><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>Minimum of 5 years of experience in Python (Django) or full-stack development.</li> <li>Proficiency in Django and Python for backend development.</li> <li>Strong experience with Linux as a development and deployment environment.</li> <li>Experience with front-end technologies like React, Vue.js, or Angular (at least 1 year).</li> <li>Proven experience in building web applications and scalable systems.</li> <li>Hands-on experience with containers, such as Docker, for development and production.</li> <li>Proficiency with Git for version control.</li> <li>Solid understanding of SQL and experience with relational databases (e.g., PostgreSQL, MySQL).</li> <li>Experience with libraries for managing background tasks like Celery or similar.</li> <li>Experience with tools for managing task queues like RabbitMQ or Kafka.</li> <li>Strong experience with building CI pipelines in tools like Gitlab or Jenkins.</li> <li>Strong problem-solving skills and attention to detail.</li> <li>An intermediate level of English language proficiency.</li> <li>Ability to work with vague requirements.</li> <li>You are a team player who can collaborate effectively.</li> </ul><p></p><p><strong>It would be great if you also have:</strong></p><ul> <li>Experience with test automation frameworks.</li> <li>Experience with Kubernetes, helm charts, and ArgoCD or similar.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth:</li> <ul> <li>Interesting and challenging projects,</li> <li>Mentor and other knowledge-exchange programs;</li> </ul> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide;</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves to ensure you maintain a healthy work-life balance;</li> <li>Compensation for private medical insurance;</li> <li>Co-working and gym/sports reimbursement;</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p><br><br></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"mysql\",\"sql\",\"docker\",\"kubernetes\",\"python\",\"javascript\",\"react\",\"vue\",\"angular\",\"django\",\"kafka\"]","pubDate":"2025-06-04T00:00:00.000Z","link":"https://apply.workable.com/j/6811ED85AB","slug":"senior-python-full-stack-developer-django-focused-worldwide-remote-cloudlinux-2547"},{"id":9377081607,"title":"Senior Python/Full Stack Developer (Django-focused) (worldwide remote)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p><strong>CloudLinux</strong> is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful. </p><p>We are truly a great place to work!</p><p>Check out our website for more information - <a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a>&nbsp;</p><p></p><p>We are looking for a <strong>Senior Python/Full Stack Developer (Django-focused)</strong> to create an internal build &amp; automation system from scratch. The product is designed to expedite the delivery of security patches as part of Extended Lifecycle Support Services provided by CloudLinux.&nbsp;</p><p>Since the system will be established for internal use your end users will be colleagues working next to you. This is a great opportunity to bring value to fellow engineers!</p><p>The system is meant to be built from scratch, therefore a wide knowledge of the end-to-end pipeline of architecture/design phase, planning, development, and deployment is a must.</p><p></p><p><strong>Key Responsibilities:</strong></p><ul> <li>Design, develop, test, and deliver web applications using Django and related technologies.</li> <li>Technical ownership of the created application.</li> <li>Implement user interfaces using front-end technologies (especially JavaScript frameworks like Refine or React).</li> <li>Work with Linux-based systems for deployment and development, including container management (Docker, Kubernetes).</li> <li>Build pipelines for code testing and delivery.</li> <li>Ensure application security and data protection.</li> <li>Troubleshoot and debug code across the stack.</li> <li>Version control using Git, including branching, merging, and pull requests.</li> <li>Review your colleagues' code.</li> <li>Plan your work forward.</li> </ul><p><strong>Requirements</strong></p><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>Minimum of 5 years of experience in Python (Django) or full-stack development.</li> <li>Proficiency in Django and Python for backend development.</li> <li>Strong experience with Linux as a development and deployment environment.</li> <li>Experience with front-end technologies like React, Vue.js, or Angular (at least 1 year).</li> <li>Proven experience in building web applications and scalable systems.</li> <li>Hands-on experience with containers, such as Docker, for development and production.</li> <li>Proficiency with Git for version control.</li> <li>Solid understanding of SQL and experience with relational databases (e.g., PostgreSQL, MySQL).</li> <li>Experience with libraries for managing background tasks like Celery or similar.</li> <li>Experience with tools for managing task queues like RabbitMQ or Kafka.</li> <li>Strong experience with building CI pipelines in tools like Gitlab or Jenkins.</li> <li>Strong problem-solving skills and attention to detail.</li> <li>An intermediate level of English language proficiency.</li> <li>Ability to work with vague requirements.</li> <li>You are a team player who can collaborate effectively.</li> </ul><p></p><p><strong>It would be great if you also have:</strong></p><ul> <li>Experience with test automation frameworks.</li> <li>Experience with Kubernetes, helm charts, and ArgoCD or similar.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth:</li> <ul> <li>Interesting and challenging projects,</li> <li>Mentor and other knowledge-exchange programs;</li> </ul> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide;</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves to ensure you maintain a healthy work-life balance;</li> <li>Compensation for private medical insurance;</li> <li>Co-working and gym/sports reimbursement;</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p><br><br></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"mysql\",\"sql\",\"docker\",\"kubernetes\",\"python\",\"javascript\",\"react\",\"vue\",\"angular\",\"django\",\"kafka\"]","pubDate":"2025-06-04T00:00:00.000Z","link":"https://apply.workable.com/j/6811ED85AB","slug":"senior-python-full-stack-developer-django-focused-worldwide-remote-cloudlinux-3292"},{"id":4620292159,"title":"Senior Python/Full Stack Developer (Django-focused) (worldwide remote)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p><strong>CloudLinux</strong> is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful. </p><p>We are truly a great place to work!</p><p>Check out our website for more information - <a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a>&nbsp;</p><p></p><p>We are looking for a <strong>Senior Python/Full Stack Developer (Django-focused)</strong> to create an internal build &amp; automation system from scratch. The product is designed to expedite the delivery of security patches as part of Extended Lifecycle Support Services provided by CloudLinux.&nbsp;</p><p>Since the system will be established for internal use your end users will be colleagues working next to you. This is a great opportunity to bring value to fellow engineers!</p><p>The system is meant to be built from scratch, therefore a wide knowledge of the end-to-end pipeline of architecture/design phase, planning, development, and deployment is a must.</p><p></p><p><strong>Key Responsibilities:</strong></p><ul> <li>Design, develop, test, and deliver web applications using Django and related technologies.</li> <li>Technical ownership of the created application.</li> <li>Implement user interfaces using front-end technologies (especially JavaScript frameworks like Refine or React).</li> <li>Work with Linux-based systems for deployment and development, including container management (Docker, Kubernetes).</li> <li>Build pipelines for code testing and delivery.</li> <li>Ensure application security and data protection.</li> <li>Troubleshoot and debug code across the stack.</li> <li>Version control using Git, including branching, merging, and pull requests.</li> <li>Review your colleagues' code.</li> <li>Plan your work forward.</li> </ul><p><strong>Requirements</strong></p><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>Minimum of 5 years of experience in Python (Django) or full-stack development.</li> <li>Proficiency in Django and Python for backend development.</li> <li>Strong experience with Linux as a development and deployment environment.</li> <li>Experience with front-end technologies like React, Vue.js, or Angular (at least 1 year).</li> <li>Proven experience in building web applications and scalable systems.</li> <li>Hands-on experience with containers, such as Docker, for development and production.</li> <li>Proficiency with Git for version control.</li> <li>Solid understanding of SQL and experience with relational databases (e.g., PostgreSQL, MySQL).</li> <li>Experience with libraries for managing background tasks like Celery or similar.</li> <li>Experience with tools for managing task queues like RabbitMQ or Kafka.</li> <li>Strong experience with building CI pipelines in tools like Gitlab or Jenkins.</li> <li>Strong problem-solving skills and attention to detail.</li> <li>An intermediate level of English language proficiency.</li> <li>Ability to work with vague requirements.</li> <li>You are a team player who can collaborate effectively.</li> </ul><p></p><p><strong>It would be great if you also have:</strong></p><ul> <li>Experience with test automation frameworks.</li> <li>Experience with Kubernetes, helm charts, and ArgoCD or similar.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth:</li> <ul> <li>Interesting and challenging projects,</li> <li>Mentor and other knowledge-exchange programs;</li> </ul> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide;</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves to ensure you maintain a healthy work-life balance;</li> <li>Compensation for private medical insurance;</li> <li>Co-working and gym/sports reimbursement;</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p><br><br></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"mysql\",\"sql\",\"docker\",\"kubernetes\",\"python\",\"javascript\",\"react\",\"vue\",\"angular\",\"django\",\"kafka\"]","pubDate":"2025-06-04T00:00:00.000Z","link":"https://apply.workable.com/j/6811ED85AB","slug":"senior-python-full-stack-developer-django-focused-worldwide-remote-cloudlinux-2288"},{"id":2028463279,"title":"Senior Python/Full Stack Developer (Django-focused) (worldwide remote)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p><strong>CloudLinux</strong> is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful. </p><p>We are truly a great place to work!</p><p>Check out our website for more information - <a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a>&nbsp;</p><p></p><p>We are looking for a <strong>Senior Python/Full Stack Developer (Django-focused)</strong> to create an internal build &amp; automation system from scratch. The product is designed to expedite the delivery of security patches as part of Extended Lifecycle Support Services provided by CloudLinux.&nbsp;</p><p>Since the system will be established for internal use your end users will be colleagues working next to you. This is a great opportunity to bring value to fellow engineers!</p><p>The system is meant to be built from scratch, therefore a wide knowledge of the end-to-end pipeline of architecture/design phase, planning, development, and deployment is a must.</p><p></p><p><strong>Key Responsibilities:</strong></p><ul> <li>Design, develop, test, and deliver web applications using Django and related technologies.</li> <li>Technical ownership of the created application.</li> <li>Implement user interfaces using front-end technologies (especially JavaScript frameworks like Refine or React).</li> <li>Work with Linux-based systems for deployment and development, including container management (Docker, Kubernetes).</li> <li>Build pipelines for code testing and delivery.</li> <li>Ensure application security and data protection.</li> <li>Troubleshoot and debug code across the stack.</li> <li>Version control using Git, including branching, merging, and pull requests.</li> <li>Review your colleagues' code.</li> <li>Plan your work forward.</li> </ul><p><strong>Requirements</strong></p><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>Minimum of 5 years of experience in Python (Django) or full-stack development.</li> <li>Proficiency in Django and Python for backend development.</li> <li>Strong experience with Linux as a development and deployment environment.</li> <li>Experience with front-end technologies like React, Vue.js, or Angular (at least 1 year).</li> <li>Proven experience in building web applications and scalable systems.</li> <li>Hands-on experience with containers, such as Docker, for development and production.</li> <li>Proficiency with Git for version control.</li> <li>Solid understanding of SQL and experience with relational databases (e.g., PostgreSQL, MySQL).</li> <li>Experience with libraries for managing background tasks like Celery or similar.</li> <li>Experience with tools for managing task queues like RabbitMQ or Kafka.</li> <li>Strong experience with building CI pipelines in tools like Gitlab or Jenkins.</li> <li>Strong problem-solving skills and attention to detail.</li> <li>An intermediate level of English language proficiency.</li> <li>Ability to work with vague requirements.</li> <li>You are a team player who can collaborate effectively.</li> </ul><p></p><p><strong>It would be great if you also have:</strong></p><ul> <li>Experience with test automation frameworks.</li> <li>Experience with Kubernetes, helm charts, and ArgoCD or similar.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth:</li> <ul> <li>Interesting and challenging projects,</li> <li>Mentor and other knowledge-exchange programs;</li> </ul> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide;</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves to ensure you maintain a healthy work-life balance;</li> <li>Compensation for private medical insurance;</li> <li>Co-working and gym/sports reimbursement;</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p><br><br></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"mysql\",\"sql\",\"docker\",\"kubernetes\",\"python\",\"javascript\",\"react\",\"vue\",\"angular\",\"django\",\"kafka\"]","pubDate":"2025-06-04T00:00:00.000Z","link":"https://apply.workable.com/j/6811ED85AB","slug":"senior-python-full-stack-developer-django-focused-worldwide-remote-cloudlinux-7360"},{"id":8058481302,"title":"Senior Python/Full Stack Developer (Django-focused) (worldwide remote)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p><strong>CloudLinux</strong> is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful. </p><p>We are truly a great place to work!</p><p>Check out our website for more information - <a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a>&nbsp;</p><p></p><p>We are looking for a <strong>Senior Python/Full Stack Developer (Django-focused)</strong> to create an internal build &amp; automation system from scratch. The product is designed to expedite the delivery of security patches as part of Extended Lifecycle Support Services provided by CloudLinux.&nbsp;</p><p>Since the system will be established for internal use your end users will be colleagues working next to you. This is a great opportunity to bring value to fellow engineers!</p><p>The system is meant to be built from scratch, therefore a wide knowledge of the end-to-end pipeline of architecture/design phase, planning, development, and deployment is a must.</p><p></p><p><strong>Key Responsibilities:</strong></p><ul> <li>Design, develop, test, and deliver web applications using Django and related technologies.</li> <li>Technical ownership of the created application.</li> <li>Implement user interfaces using front-end technologies (especially JavaScript frameworks like Refine or React).</li> <li>Work with Linux-based systems for deployment and development, including container management (Docker, Kubernetes).</li> <li>Build pipelines for code testing and delivery.</li> <li>Ensure application security and data protection.</li> <li>Troubleshoot and debug code across the stack.</li> <li>Version control using Git, including branching, merging, and pull requests.</li> <li>Review your colleagues' code.</li> <li>Plan your work forward.</li> </ul><p><strong>Requirements</strong></p><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>Minimum of 5 years of experience in Python (Django) or full-stack development.</li> <li>Proficiency in Django and Python for backend development.</li> <li>Strong experience with Linux as a development and deployment environment.</li> <li>Experience with front-end technologies like React, Vue.js, or Angular (at least 1 year).</li> <li>Proven experience in building web applications and scalable systems.</li> <li>Hands-on experience with containers, such as Docker, for development and production.</li> <li>Proficiency with Git for version control.</li> <li>Solid understanding of SQL and experience with relational databases (e.g., PostgreSQL, MySQL).</li> <li>Experience with libraries for managing background tasks like Celery or similar.</li> <li>Experience with tools for managing task queues like RabbitMQ or Kafka.</li> <li>Strong experience with building CI pipelines in tools like Gitlab or Jenkins.</li> <li>Strong problem-solving skills and attention to detail.</li> <li>An intermediate level of English language proficiency.</li> <li>Ability to work with vague requirements.</li> <li>You are a team player who can collaborate effectively.</li> </ul><p></p><p><strong>It would be great if you also have:</strong></p><ul> <li>Experience with test automation frameworks.</li> <li>Experience with Kubernetes, helm charts, and ArgoCD or similar.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth:</li> <ul> <li>Interesting and challenging projects,</li> <li>Mentor and other knowledge-exchange programs;</li> </ul> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide;</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves to ensure you maintain a healthy work-life balance;</li> <li>Compensation for private medical insurance;</li> <li>Co-working and gym/sports reimbursement;</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p><br><br></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"mysql\",\"sql\",\"docker\",\"kubernetes\",\"python\",\"javascript\",\"react\",\"vue\",\"angular\",\"django\",\"kafka\"]","pubDate":"2025-06-04T00:00:00.000Z","link":"https://apply.workable.com/j/6811ED85AB","slug":"senior-python-full-stack-developer-django-focused-worldwide-remote-cloudlinux-3908"},{"id":6808039569,"title":"Director of Channel Partnerships","company":"Digital Science","image":"https://remotive.com/job/2014783/logo","description":"<div><!--block--><strong>About us</strong></div><div><!--block--><br>We are <a href=\"https://www.digital-science.com/\" rel=\"nofollow\">Digital Science</a> and we are advancing the research ecosystem. </div><div><!--block-->We are a pioneering technology company, and our vision is of a future where a trusted and collaborative research ecosystem drives progress for all. We believe in better, open, collaborative and inclusive research. In creating the next generation of tools and working in partnership with the community we tackle some of the biggest challenges to research. In order to achieve our vision, we need innovative, inspiring and dynamic people to join our team. Want to join us?<br><br></div><div><!--block--><strong>Your new role<br><br></strong>We’re seeking a strategic and execution-focused Director of Channel Partnerships to lead and expand our global partner ecosystem. This role is responsible for developing and executing the company’s channel sales strategy, managing relationships with key partners, and driving revenue through indirect sales channels—including resellers, alliances, and other channel partners—particularly in the government, corporate R&amp;D, and academic sectors.<br><br></div><div><!--block-->You will identify, onboard, and enable strategic partners to promote and support Digital Science’s SaaS solutions and data licensing offerings. You’ll work cross-functionally with Sales, Marketing, Product, and Legal to align channel initiatives with our commercial goals, ensuring partners are fully equipped and motivated to succeed.</div><br><br><div class=\"h3\">What you’ll be doing </div><div><!--block--><strong>1. Channel Strategy &amp; Execution<br></strong><br></div><ul style=\"\"><li style=\"\"><!--block-->Develop and execute a global channel strategy aligned with commercial objectives and growth targets.</li><li style=\"\"><!--block-->Analyze market trends and partner ecosystems to identify strategic opportunities.</li><li style=\"\"><!--block-->Define and track success metrics to continuously optimize channel performance.<br><br></li></ul><div><!--block--><strong>2. Partner Acquisition &amp; Development<br></strong><br></div><ul style=\"\"><li style=\"\"><!--block-->Identify, recruit, and onboard new channel partners across corporate, government, and academic sectors.</li><li style=\"\"><!--block-->Build strong relationships with key decision-makers to drive long-term engagement.</li><li style=\"\"><!--block-->Segment and prioritize partners to focus resources where they deliver the most impact.<br><br></li></ul><div><!--block--><strong>3. Joint Go-to-Market Planning<br></strong><br></div><ul style=\"\"><li style=\"\"><!--block-->Co-develop business plans with partners, including sales goals, target markets, and resource allocation.</li><li style=\"\"><!--block-->Drive co-selling and co-marketing initiatives to expand pipeline and accelerate growth.</li><li style=\"\"><!--block-->Support partners in complex deal structuring and key account opportunities.<br><br></li></ul><div><!--block--><strong>4. Partner Program Management<br></strong><br></div><ul style=\"\"><li style=\"\"><!--block-->Build and manage a scalable partner program, including enablement, incentives, and performance tracking.</li><li style=\"\"><!--block-->Conduct regular business reviews to evaluate progress and align on goals.</li><li style=\"\"><!--block-->Continuously refine program structure based on partner feedback and performance data.<br><br></li></ul><div><!--block--><strong>5. Sales Enablement &amp; Partner Success<br></strong><br></div><ul style=\"\"><li style=\"\"><!--block-->Deliver onboarding, training, and sales tools to ensure partner readiness and effectiveness.</li><li style=\"\"><!--block-->Support partner teams with consistent messaging, collateral, and sales playbooks.</li><li style=\"\"><!--block-->Serve as a point of contact for issue resolution and strategic deal support.<br><br></li></ul><div><!--block--><strong>6. Cross-Functional Collaboration<br></strong><br></div><ul style=\"\"><li style=\"\"><!--block-->Work with Sales, Product, Marketing, and Legal to align channel efforts with company goals.</li><li style=\"\"><!--block-->Coordinate with Marketing to develop channel campaigns and partner assets.</li><li style=\"\"><!--block-->Share partner feedback internally to drive product and process improvements.<br><br></li></ul><div><!--block--><strong>7. Reporting &amp; Performance Management<br></strong><br></div><ul style=\"\"><li style=\"\"><!--block-->Track partner pipeline, revenue contribution, and program ROI.</li><li style=\"\"><!--block-->Prepare reports and insights for executive stakeholders to inform strategic decisions.</li><li style=\"\"><!--block-->Ensure compliance with partner agreements and regulatory requirements as needed.</li></ul><br><br><div class=\"h3\">What you’ll bring to the role</div><ul style=\"\"><li style=\"\"><!--block-->5+ years of experience in channel sales, strategic partnerships, or alliances, with demonstrated impact in at least two of our core segments: Government, Corporate R&amp;D, or Academic research markets. Experience should include partner acquisition, enablement, and revenue generation in complex or regulated environments.<br><br></li><li style=\"\"><!--block-->Industry background in SaaS or data/analytics-driven platforms is strongly preferred, with a solid understanding of how to position and sell technology solutions through indirect channels in highly technical or research-intensive industries.<br><br></li><li style=\"\"><!--block-->Proven track record of building, scaling, and optimizing channel partner programs that contribute significantly to pipeline growth, customer acquisition, and revenue performance. Experience should include the design of tiered partner models, incentive structures, and joint go-to-market initiatives.<br><br></li><li style=\"\"><!--block-->Strong commercial acumen and contract negotiation skills, including experience structuring and managing complex, multi-party agreements. Able to balance partner value creation with sustainable margins and compliance considerations.<br><br></li><li style=\"\"><!--block-->Excellent interpersonal, communication, and stakeholder engagement skills, with the ability to build trusted relationships across internal teams and externally with senior executives at partner organizations.<br><br></li><li style=\"\"><!--block-->Operational proficiency with CRM platforms (e.g., Salesforce), PRM tools, and analytics systems used to manage and report on partner pipeline, performance, and engagement.<br><br></li><li style=\"\"><!--block-->Familiarity with government procurement processes and compliance frameworks such as FedRAMP, DFARS, and ITAR is a plus, particularly in the context of working with federal agencies or government-affiliated research institutions.</li></ul><br><br><div class=\"h3\">Living our Values</div><div><!--block-->We invest in, nurture and support innovative businesses and technologies that make all parts of the research process more open, efficient and effective. </div><div><!--block--><br></div><div><!--block-->The talent we secure is fundamental to us achieving our vision and our growth plans. The values we live by are:</div><div><!--block--><br></div><div><!--block-->We are <strong>brave in the pursuit of better</strong></div><div><!--block-->We are <strong>collaborative and inclusive</strong></div><div><!--block-->We are <strong>always open-minded</strong></div><div><!--block-->We are <strong>from and for the community</strong> <br><br>We're an equal opportunity employer. All applicants will be considered for employment without attention to race, colour, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status</div><img src=\"https://remotive.com/job/track/2014783/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"salesforce\",\"legal\"]","pubDate":"2025-06-03T18:51:00.000Z","link":"https://remotive.com/remote-jobs/sales-business/director-of-channel-partnerships-2014783","slug":"director-of-channel-partnerships-digital-science-369"}]